[
  {
    "id": "何婧菡",
    "name": "何婧菡 Isabella He",
    "chineseName": "何婧菡",
    "className": "⼗⼀年级问源班",
    "tutorName": "夏梓元 Emily",
    "gpa": 3.8222222222,
    "photo": "/photos/何婧菡-X.jpg",
    "strengths": [
      "English Advanced 2（B2+）",
      "平面构成与品牌",
      "创作时刻"
    ],
    "weaknesses": [
      "English Advanced 2（B2+）",
      "未来规划 III"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🎨 Crafts",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 雅思6.5-7分\n 11⽉2号考雅思，⼀定要达到6.5，最好7分\n\n计划：每天复习1list单词，按时完成每次上课的作业，⼀定要按照⽼师的要求复盘错题，做精听精读。\n需要在上课的时候理解出题思路和重要的考点，做题的时候就更加能理解了，⼩聪明和⼤积累要⼀起⽤啊。\n要把听⼒稳定在7以上，写作提⾼到6/6.5，阅读提⾼到6.5，⼝语6分。\n现在要把这个任务放在最重要的位置，因为考完之后就可以把雅思放在后⾯了呵呵呵。\n如果没考到6.5就会变的很⿇烦，后⾯⼏乎没有时间再学雅思了所以⽟⽶黄我们加油。\n 作品集项⽬⼀\n 其实是到明年暑假要完成项⽬⼀，但是寒假前应该要完成⼤部分了吧\n\n9⽉结束前画完⾊稿，国庆去上课学纸绘线稿怎么画，带着⼀点⼩技巧回学校，创作时刻和晚上1⼩时艺术晚⾃习画\n线稿，11⽉结束前画完线稿（2个⽉）。12⽉开始上⾊，寒假结束前画完第⼀本绘本和第⼆本的草稿（定好游戏部分）\n（3个⽉）。\n或者边勾线边上⾊，到寒假结束前也要完成。\n寒假前要画完绘本的20张线稿，最好能开始上⾊。\n ⼿⼯社加油加油\n 当⼀个好社长\n\n规划好每段时间要⼲什么，按照开学做的规划上完30节课。\n要耐⼼处理冲突和难搞的⼈，但是实在不⾏就算了也满⾜不了所有⼈的需求。\n⼀定要达成已经设定好的产出，让社员都跟上进度，提供可以搞到的所有东西。",
      "selfReflection": "相⽐上学期，我发现了我更多的短板和不⾜，也在很多杂乱的思考中对⾃⼰有了更多的认知。⾸先相⽐⾼⼀，这学期的任\n务和节奏明显更加紧凑⼀些，很多任务留的时间没有之前那么久，⽽且多线并⾏⼏乎变成很平常的事情，但是我花了⼤半\n个学期的时间才感受到这样的变化，意识到之前那样随意的态度会搞砸很多事情。我很喜欢拖延，喜欢先做⾃⼰想做的事\n再去挽救之前没做好的事，所以这样的习惯导致很多任务逾期，来不及做最重要的事情。但是说点乐观的，没有这些搞砸\n的瞬间，我可能还在⽤⾼⼀的单线程思维强硬地应付⼤量任务。所以下学期我应该先思考放开重要事情后会产⽣的代价，\n再决定要不要先爽了再弥补。",
      "tutorComment": "亲爱的何婧菡，\n⾸先祝贺你凭借⾃⼰的努⼒渡过了这⼀漫长⽽“⽜马”的学期！\n在专业上，我看到了你不懈的付出。⽆论是项⽬、⽐赛还是⽇常作业，你都始终保持谦逊和努⼒，并且在上半学期发现问\n题后及时调整，看着最终趋于稳定的发挥和丰厚的产出，真⼼为你感到⾼兴；同时，你的英语标化也取得了优异的成绩，\n总之，在学术上你的踏实勤勉值得⼀个⼤⼤的拥抱～\n当然，这个学期的活动也颇为丰富，因此我看到了更多你在公共场合勇敢展现⾃⼰的“⾼光时刻”，我知道这对⾝为i⼈的你\n来说是个不⼩的挑战，但你还是⾮常优秀地完成了，为⾃⼰⿎个掌吧～\n寒假是个⾮常好的机会来休整充电，所以，请好好休息吧～期待假期回来之后看到你：\n1. 在忙碌和紧张中依然能够把好⾃⼰⽅向盘，有节奏有⽅法地组织和安排⾃⼰的学术任务和时间规划，不拖延也不慌乱。\n2. 虽然你是⼀个⾮常有执⾏⼒且吃苦耐劳型“纯⽜马”，但有的时候总会忙不过来的～所以是时候想⼀想“优先级/重要性”。\n如何抓住事情的重点、怎样做“减法”，以及更重要地是，明确出属于你⾃⼰的风格、原则、价值、判断，然后坚定地相信\n⾃⼰，可以帮助你度过很多⽣活、创作和表达中的挑战。\n3. 即使英语标化已经取得了喜⼈的成绩，但相信经过素养答辩你应该看到了继续训练⼝语和公共演讲的重要性。未来，还\n会有⾮常多这样的表达机会，期待你能够更加⾃信和从容地应对。\n别担⼼，我们⼀起并肩前⾏，相信你⼀定会更加接近你的梦想！",
      "selfReflectionSummary": "这学期的任 务和节奏明显更加紧凑⼀些，很多任务留的时间没有之前那么久，⽽且多线并⾏⼏乎变成很平常的事情，但是我花了⼤半 个学期的时间才感受到这样的变化，意识到之前那样随意的态度会搞砸很多事情。",
      "tutorCommentSummary": "这个学期的活动也颇为丰富，因此我看到了更多你在公共场合勇敢展现⾃⼰的“⾼光时刻”，我知道这对⾝为i⼈的你 来说是个不⼩的挑战，但你还是⾮常优秀地完成了，为⾃⼰⿎个掌吧～ 寒假是个⾮常好的机会来休整充电，所以，请好好休息吧～期待假期回来之后看..."
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你以一份静水深流般的踏实与匠心，出色地诠释了“幕后英雄”的价值。你或许不是舞台上最瞩目的焦点，但你的认真、细\n致与富有创见的思考，是班级从经典细读到戏剧创作这场漫长旅程中，不可或缺的稳定基石与灵感源泉。你的特点在戏剧\n《红楼梦》主题的剧本创作中得到了集中体现。你主动承担了PPT制作和灯光设计这一关键却常被忽略的幕后工作，让台\n上的表演因你的幕后支持而更加完整、有力。这充分展现了你出色的执行力、审美力与团队责任感。在剧本构思阶段，你\n提出了将 《红楼梦》中经典的“黛玉葬花”场景，与现代都市情侣的情感状态进行拼贴创作的大胆构想。这证明你不仅读懂\n了黛玉，更读懂了时代，你是一位内心丰富、善于建立跨时"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Dear Isabella,\nI appreciate the focus you show during our lessons. While your attentiveness is a great asset, I have noticed that \ninconsistent homework submission and occasional misunderstandings of key concepts are hindering your progress. To \nbuild more confidence, I encourage you to participate "
      },
      {
        "name": "English Advanced 2（B2+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Isabella generally has a strong overall grasp of English, and she shows solid ability in her coursework in English \nlistening assessments. In class discussions, however, she often appears hesitant or shy to speak, as if she does not \nfully trust her ability to communicate aloud. Moving forward, I en"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Isabella demonstrated outstanding performance. Her examination \nof reasons young women consume niche subculture accessories on Xiaohongshu and the impacts on aesthetics \nrevealed sharp consumer culture awareness. She handled the literature review e"
      },
      {
        "name": "大学心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "You are a hardworking student who brings a positive attitude to our psychology lessons. While your grades are decent, I \nsense a gap between your classroom effort and your ability to apply concepts flexibly on assessments. It seems that \nonce the wording of a question changes, your confidence wavers"
      },
      {
        "name": "平面构成与品牌",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你一旦进入创作状态，思路与手速都非常迅捷，想法层出不穷，展现出极强的创造力与反应能力。但在这种高密度的灵感\n迸发中，也需要适时停下来，回望自己正在讲述的究竟是一个怎样的故事，避免被一时闪现的想法牵着走。可以先将这些\n灵感记录下来，必要时借助 mind map 等方式梳理思路，帮助整体叙事更加清晰。在创作方向上，也可以开始尝试更具延\n展性的练习，例如更细化的表达或较长线索的故事创作。目前你在速涂与短时灵感型创作中已经游刃有余，若能有意识地\n走出这一舒适区，挑战更复杂、更持续的创作结构，将有助于你获得新的突破与成长。"
      },
      {
        "name": "创作时刻",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "学期初你对 sketchbook 的探索方向还在逐步摸索中，但在不断尝试与实践的过程中，你逐渐找到了适合自己的创作路\n径，也明确了需要重点练习的内容。整体作品完成度高，质量稳定。若能在之后的创作中更早地进行时间规划，将有助于"
      },
      {
        "name": "体育：综合格斗",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "何婧菡同学课堂态度认真，能够积极参与动作练习，对站立技术掌握情况较好。她在课堂中能够听从指导，尝试调整动作\n细节，技术完成度较高。建议继续保持专注和积极性，同时在力量和耐力方面进行适度补充训练，以支撑更高强度的动作"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期的未来规划课程围绕三个单元展开，帮助你理解基于全面评估政策的大学申请逻辑，学习查校与选校，并最终完成\n了你自己的大学清单。通过回顾和梳理课外活动，你也完成了第一版activity bank和简历。这些看似基础的准备，其实正\n是在为未来申请一点点铺路。\n在第一单元中，你能够跟上课程节奏，通过模拟招生官案例分析，认真思考全面评估下大学究竟在看什么。同时，在重新\n梳理七大申请材料模块的过程中，你也再次明确了校内成绩的提升目标。这一步并不轻松，但你愿意正视、也愿意规划，\n本身就很值得肯定。进入第二单元，你开始向内厘清自己真正看重的选校标准——专业资源扎实、生活舒适度高、便利性\n强，以及与教授之间"
      }
    ],
    "academicStrength": "Excels in English Advanced 2（B2+） and 4 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "何梓豪",
    "name": "何梓豪 Hank He",
    "chineseName": "何梓豪",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "束晨燕 Eva",
    "gpa": 2.6555555556,
    "photo": null,
    "strengths": [
      "荣誉生命科学 I"
    ],
    "weaknesses": [
      "大学微积分 I",
      "荣誉商科 I",
      "未来规划 III"
    ],
    "activities": [
      "🏀 Basketball",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提升英语标化成绩 \t基本达成\n 每⽇积累背20个单词\n 利⽤⾃习和完成作业后的时间背单词，每天早上复习前⼀天积累的单词。\n 提升作业准时提交率 \t基本达成\n 争取准时提交率在90%\n 每⽇检查是否有作业即将到期，并规划未交作业的完成时间。\n 提升校内平均成绩 \t基本达成\n 保证校内成绩都在3以上并⼀部分到4\n 时刻注意每个学科的成绩以及作业任务完成情况，多向⽼师询问。并计划提升成绩⽅案。",
      "selfReflection": "我认为我是⼀个乐观且在学习上很能找到⽅向的⼈，可以在不⾜中进步不受挫折的影响反⽽可以转化为动⼒。",
      "tutorComment": "这⼀学期，我看到你在关键时刻开始学会为⽬标⽤⼒。你在看不见的地⽅认真准备雅思，也愿意为重要的课程投⼊额外时\n间，这说明你已经能够确⽴⽬标，并为之持续⾏动。这份安静⽽稳定的执⾏⼒，是你很重要的成长。同时，在⽇常课堂\n⾥，你有时显得收着⼒⽓：坐在后排、状态偏低，让⼈分不清是兴趣不⾜，还是刻意不想“太⽤⼒”。但你需要记住，学习\n始终是为⾃⼰服务的，与他⼈的眼光⽆关，每⼀步投⼊都不会⽩费。你待⼈温和、乐于配合，是⼀个让⼈放⼼的⼈。我也\n希望你把这种对集体的在意，延伸到对规则和⽇常细节的重视上，⽐如周⼀的正装和宿舍的内务——那同样是成熟的⼀部\n分。\n⾼⼆下时间很短，节奏很快，希望你在“不计较得失”的同时，给⾃⼰多⼀点紧迫感，把已经建⽴起来的⽬标感，真正转化\n为⾏动⼒。你正在⾛在⼀条对的路上，接下来，只需要更坚定⼀些。",
      "selfReflectionSummary": "我认为我是⼀个乐观且在学习上很能找到⽅向的⼈，可以在不⾜中进步不受挫折的影响反⽽可以转化为动⼒。",
      "tutorCommentSummary": "希望你把这种对集体的在意，延伸到对规则和⽇常细节的重视上，⽐如周⼀的正装和宿舍的内务——那同样是成熟的⼀部 分。"
    },
    "futureDirection": "大学?",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "何梓豪同学本学期学习态度端正，能够按时、认真完成各项作业，表现出谦逊的学习品质。课堂上，他善于倾听，\n对文学与生活保有细腻的感知。在《红楼梦》改编作品中，展现出他对人物与情节有良好的理解与感受，这是其语文学习\n中非常重要的优势。尤为突出的是，他在舞台表演中精准把握了人物特质，以富有创意、自然生动的演绎为班级演出增添\n了亮色，展现了被舞台激发的表达魅力。\n        希望你能够在保持细腻感受力的同时，进一步增强学习信心，夯实语文学科的基础能力，尤其是在精读方法、答题\n逻辑与文本分析策略上形成稳定的方法意识。例如，在阅读时坚持“慢读”与“回读”，关注人物言行背后的情感与立场，而\n不仅仅是情节。"
      },
      {
        "name": "大学微积分 I",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Hank’s performance has been unsatisfactory this semester, consistently falling below expectations. He is currently \nnavigating a steep learning curve, compounded by a language barrie and gaps in his mathematical foundation. \nSpecifically, a lack of fluency in mathematical notation has made it challe"
      },
      {
        "name": "English Elementary 2（A2）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hank is generally a quiet student, but he has shown clear progress and strong ability during the semester. He prepares \nvery well for dictation and is usually among the top students in the class. His phonics skills are strong, and he can often \nsay difficult words, such as translation, before others"
      },
      {
        "name": "英语语法强化",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Dear Hank, you maintained a rather high level of participation this semester, except for the weeks that you were sick. \nWhen you were here with us, you were able to fully concentrate and be attentive. This result of yours was achieved \nthrough improved learning habits and a commitment to learning. I"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hello Hank. It was great having you in China Study this semester. I clearly saw how you stepped up as a leader in group \ntasks and carried the heaviest load to ensure assignments got done. However, I really expect that instead of doing the \nwork for others, focus on mobilizing your team and learning"
      },
      {
        "name": "荣誉商科 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Hank shows clear potential for excellence in Business, demonstrating sharp moments of insight when fully immersed in \nthe material. While his work quality is high when he applies himself, he often remains a passive observer during class \ndiscussions. To bridge the gap between his current performance"
      },
      {
        "name": "荣誉生命科学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "这一学期，你在荣誉生命科学课上展现出了出色的思维能力。你听课效率很高，总能快速理解复杂的生物学概念，成绩也\n比较理想。但在老师看来，你还有很大的潜力没有完全发挥出来。在科学研究中，敏捷的思维固然重要，但严谨的细节往\n往是通往卓越的关键。希望下学期你能更关注细节，认真完成每一次作业。"
      },
      {
        "name": "体育：篮球",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "You are a smart and lively child, honest in character, strictly adhering to discipline, and demanding of yourself. You care \nabout the collective and actively participate in various activities and social practice programs. You study diligently and \nyour grades have been steadily improving. You respe"
      },
      {
        "name": "未来规划 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Hank 的升学目标越来越明确了，今年也在 AP 和雅思上投入了更多时间，不过在未来规划的作业上，投入还有提升空\n间，所以整体完成度还有进步的余地。这些作业不仅是任务，更是帮助你梳理目标、积累经验的重要环节。希望你能在保\n持学术准备的同时，也把作业的节奏和质量跟上，让整体表现更完整。\n老师相信，只要你在未来规划上再多一些坚持和主动，你的思考力和执行力会进一步提升，也会让你的整体申请更加有竞"
      }
    ],
    "academicStrength": "Excels in 荣誉生命科学 I",
    "academicWeakness": "Needs improvement in 大学微积分 I and 2 other course(s)"
  },
  {
    "id": "余思绮",
    "name": "余思绮 Rowling Yu",
    "chineseName": "余思绮",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "李林平 Jason",
    "gpa": 2.5,
    "photo": "/photos/余思绮-J.jpg",
    "strengths": [
      "Academic Excellence",
      "Leadership",
      "Creativity",
      "Analytical Thinking"
    ],
    "weaknesses": [
      "荣誉预备微积分 I",
      "English Intermediate 2（B1）",
      "荣誉心理学 I"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": "Not available",
      "selfReflection": "这学期的我与上学期相⽐，有了明显的变化。\n上学期的我更多是在完成任务：按照要求学习、按照时间推进，却很少停下来思考这些事情对“我”本⾝意味着什么。我的\n⽬标往往来⾃外界期待，⽽不是内在判断，因此在遇到困难或不确定性时，容易动摇，也缺乏主动调整⽅向的勇⽓。\n⽽这学期，我开始更加清楚地认识⾃⼰。我学会在⾏动之前思考⽬的，在完成之后进⾏反思。我不再只关注结果是否“合\n格”，⽽是关注过程是否真正促进了我的成长。⾯对挑战，我⽐以前更愿意主动沟通、寻求反馈，并根据反馈做出改变，\n⽽不是简单地坚持或逃避。\n我对⾃⼰的欣赏，来⾃这些变化本⾝。\n我欣赏⾃⼰逐渐建⽴起的⾃我反思能⼒，也欣赏⾃⼰在不确定中依然愿意尝试和调整的态度。即使并⾮每⼀次选择都是最\n优解，但我开始为⾃⼰的决定负责，并从经验中提炼真正有价值的认识。这种成长不⼀定⽴刻带来成绩上的飞跃，但让我\n更加稳定、清醒，也更加⾃信。\n我对⾃⼰的期待，是持续⽽长期的。\n我希望⾃⼰能继续保持这种主动思考和⾃我修正的能⼒，在学习和⽣活中做出更有意识的选择。同时，我也期待⾃⼰在未\n来能更加坚定——在理解他⼈期待的同时，不失去对⾃⾝兴趣、价值和⽬标的判断⼒，逐步成长为⼀个既理性⼜有⽅向感\n的⼈。",
      "tutorComment": "在飞盘课的绿茵场上，总能看到你活跃的⾝影——你奔跑、接盘、传递，带着专注与热情，那充满活⼒的样⼦让⼈印象深\n刻。这正说明你拥有很好的⾏动⼒与投⼊的潜能。\n如果能将这份在运动中的专注与活⼒，也迁移到⽇常学习与时间管理中来，相信你会有更出⾊的表现。期待你在新学期\n⾥，进⼀步做好时间规划，把每天的重⼼放在按时完成作业、上课专⼼听讲上，减少闲聊与发呆的时间，并充分利⽤好留\n⽩与⾃修时段，合理分配作业与复习任务。\n你就像飞盘场上那道利落的⾝影⼀样，只要⽅向清晰、节奏有序，就能稳稳接住每⼀个挑战。期待看到你在时间管理与学\n习专注度上的进步，让⾃⼰不仅运动出⾊，学业也同样从容闪亮。\n思绮，继续奔跑吧，朝着更有序、更⾼效的下学期！\n个⼈成⻓\n100.00%\n作业提交率\n94.39%\n作业准时提交率\n1\n⾃主性评级\n98.0\n凌云积分",
      "selfReflectionSummary": "我不再只关注结果是否“合 格”，⽽是关注过程是否真正促进了我的成长。",
      "tutorCommentSummary": "你在时间管理与学 习专注度上的进步，让⾃⼰不仅运动出⾊，学业也同样从容闪亮。"
    },
    "futureDirection": "传统媒体",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "思绮，你能及时完成作业并主动提问，这表明你有学好语文的意愿和基础。但课堂上忙于其他作业、专注度不足，导致对\n核心内容理解不深，这直接限制了作业质量的提升。在戏剧展演中，因对剧本理解不够深入而影响了团队协作，这再次印\n证了“准确理解”是有效参与和高质量产出的前提。效率源于专注，请务必分清主次，保障语文课堂的绝对专注，这是你提\n升理解力、改善作业质量、进而增强自信的关键一步。先从“一节课全程跟紧”这个小目标开始吧！下学期加油！"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Rowling’s overall performance is rated as \"Growing.\" She excelled in class participation and note-taking, which is a very \npositive sign. However, her homework quality and exam scores, particularly her final exam result, were weak, indicating \na common gap between passive understanding and active ap"
      },
      {
        "name": "English Intermediate 2（B1）",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "Dear Rowling, looking back to your performance of this semester,  I can not tell whether you are satisfied or not. You \nhave painted a rather vague image for me as there is not enough learning evidence. I think you need to develop \nstronger study routines to support progress continuously as I do not"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Rowling demonstrated solid mastery and thoughtful balance. Her \nexploration of how mass media fulfill social responsibilities while pursuing profits reflected commendable awareness of \nethical journalism tensions. She handled the literature review "
      },
      {
        "name": "荣誉心理学 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "这一学期你在心理学课上的表现有明显的进步曲线。虽然在学期前期，你偶尔会在课堂上分心，导致对一些基础概念的理\n解不够透彻，遇到了一定的挑战。但让我非常认可的是，你在学期后期表现出了较大的主观能动性，对待学业的态度认真\n了一些，能基本完成各项教学要求。这种及时调整状态、努力追赶的劲头是非常宝贵的。接下来的学习中，希望你能试着\n在课堂上更专注一些，遇到不懂的理论及时提问，把这份努力的势头保持下去，相信你在学业上会有更稳健的提升。"
      },
      {
        "name": "大学经济学 I",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "Rowling, you are clearly a very bright student with a sharp mind—what some might call \"cleverness\"—and I truly enjoy \nthe unique depth of thought you bring to our economics discussions. You have a way of looking at problems that is \ngenuinely interesting and insightful. However, that intelligence is"
      },
      {
        "name": "大学商业研究 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Rowling is generally attentive and capable, often surprising me with her insights during assessments like the Earnings \nCall. To achieve more consistent performance, she is encouraged to speak up more in class to test her ideas. Greater \npreparation before major assessments will help her fully lever"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "余思绮在本学期的体育课里总是努力完成每一次接盘，会很主动地进行跑动接盘。可以在比赛里完成战术要求的团队配\n合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Rowling，这一学期，你们正式进入了大学申请准备的起步阶段。在未来规划课上，你完成了选校维度的梳理，设计了属\n于自己的梦校海报，初步产出了课外活动清单初步描写，并制作了个人简历。这些任务不只是作业本身，更是一次次对自\n我认知与未来方向的深入思考。\n你在学习状态上出现了一些起伏，成绩较以往有所波动，这需要你更加关注当前的学习投入与节奏调整。随着课程难度的\n提升，尤其是英语基础仍需加强，学习过程中遇到挑战是正常的，但也需要你逐步学会主动应对与持续投入。\n在三方面谈中，我们也围绕学习目标与未来方向进行了深入沟通，希望你能更加清晰地认识到学业基础对实现商科梦想的\n重要性。你对商科方向的兴趣与坚持依"
      }
    ],
    "academicStrength": null,
    "academicWeakness": "Needs improvement in 荣誉预备微积分 I and 3 other course(s)"
  },
  {
    "id": "俞树涵",
    "name": "俞树涵 Sam Yu",
    "chineseName": "俞树涵",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "钱寒轩 Hanhsuan",
    "gpa": 2.7555555556,
    "photo": "/photos/俞树涵-J.jpg",
    "strengths": [
      "体育：综合格斗"
    ],
    "weaknesses": [
      "语文 III",
      "English Elementary 2（A2）",
      "英语词汇强化"
    ],
    "activities": [
      "⚽ Football",
      "🎭 Musical/Drama",
      "💼 Business Club",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 每天背单词\n 背诵英语课上积累的单词和雅思需要的单词\n 雅思考试达到4.5分\n 每天背⽇语\n 背诵50⾳图和⽇语单词\n 每天有空时背⼀些\n 早睡早起\n 11:30睡-6:40起\n 保证上课不犯困😪",
      "selfReflection": "不同：我开始更加注重于学习，更加积极参与每⼀门课程，我的⾜球技术也有显著提升\n欣赏和期待：我希望我能更加认真的学习英语，补习⼀下英语，能更加认真的写每⼀个作业：）",
      "tutorComment": "树涵，\n这⼀学期，我注意到你在很多⽅⾯都有了踏实的进步。你认真对待学业，遇到困难没有轻易退缩，⽽是尝试去理解、去解\n决；你在班级⾥和同学们相处融洽，待⼈真诚，总能让⼈感受到你的善意；你也愿意参与学校组织的各类活动，不张扬，\n却始终在场。这些看似平常的点滴，其实正是成长中最珍贵的部分。\n未来的路还很长，希望你能继续保持这份温和与坚持。在学习上，不必急于求成，但可以试着找到真正激发你兴趣的⽅\n向，哪怕只是⼀个⼩⼩的突破⼝，也可能带来意想不到的改变。同时，也别忘了多结识志同道合的朋友——友情不仅能带\n来⽀持，也能让你看到更⼴阔的世界。当然，也希望你和现在⾝边的朋友⼀直保持联系，彼此陪伴、互相⿎励。\n你是个温暖的⼤男孩，有责任感。这种特质很难得，也值得被珍惜。愿你在接下来的⽇⼦⾥，既不失内⼼的柔软，也能在\n需要时坚定前⾏。不⽤追求完美，只要每天⽐昨天多⾛⼀步，就是值得肯定的成长。加油！",
      "selfReflectionSummary": "不同：我开始更加注重于学习，更加积极参与每⼀门课程，我的⾜球技术也有显著提升 欣赏和期待：我希望我能更加认真的学习英语，补习⼀下英语，能更加认真的写每⼀个作业：）。",
      "tutorCommentSummary": "树涵， 这⼀学期，我注意到你在很多⽅⾯都有了踏实的进步。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "树涵，你后半学期的状态比前半学期有所好转，这是一个积极的信号。作业能及时完成，但在“应付”与“认真”之间，你常\n常选择了前者，这限制了你能力的真实展现。戏剧展演中台词记忆的困难，部分根源可能就在于前期对剧本研读不够“走\n心”。学习需要的是全身心的投入。请告别“应付”心态，尝试在每一项任务中都注入真正的思考：哪怕是记台词，也去理解\n人物为何这样说；哪怕是做作业，也追求一个环节的透彻。当你开始认真对待过程，结果自然会不同。是时候唤醒你沉睡"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Sam’s overall performance is rated as \"Developing.\" He participated consistently in class and completed his project \nsatisfactorily. However, the quality of his homework and his exam results, particularly his low final exam score, indicate \nsignificant gaps in his knowledge. A \"back-to-basics\" appro"
      },
      {
        "name": "English Elementary 2（A2）",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Sam has showed a serious attitude since the first lesson and has made some clear improvements during the semester. \nAlthough his vocabulary size is still limited, he can usually understand the main idea in listening tasks, and his control of \nChinese use and chatting in class has improved a lot afte"
      },
      {
        "name": "英语词汇强化",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Sam’s engagement in this course is sometimes influenced by his peers, and his interest tends to focus more on the \ntopics than on the language itself. At present, he has not invested enough effort in English learning, especially in \nvocabulary memorization, which is essential even for spoken fluency"
      },
      {
        "name": "积极倾听与主动回应",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你本学期表现基本良好，在听说方面都表现良好，读写部分需要再加强。期末考试进步很大，反映出你自己一直在努力。\n上课时能认真听讲，大声跟读，作业完成得很好，建议继续保持现在的学习习惯的同时也能更有展现自己能力的勇气和自\n信，读写部分可以参考教科书的练习完成一些简单的日文作文，使自己在日语的读写部分再加以提高。"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Sam demonstrated developing growth and emerging dedication. \nHis examination of how \"interest tribes\" on short video platforms, such as guzi and hanfu circles, shape contemporary \nhigh school students' subcultural identities revealed promising awar"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Your friendly demeanor and willingness to learn are great assets. However, to see the improvement you want, you need \nto change how you spend your 45 minutes in class. Instead of just listening, try to connect the new topics to what you \nalready know right there in the moment. Additionally, don't li"
      },
      {
        "name": "体育：综合格斗",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期综合格斗课程中，你的表现非常出色，尤其是对于摔柔技术的理解能力非常强，并且你在课程中会经常帮助其他同\n学，让课堂氛围积极健康。并且在PA环节中你一直在领导和带领其他的同学，给老师留下了深刻的映像。继续保持你强"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "本学期 Sam 在未来规划方面愈发坚定。从三方面谈时大声表达出境意愿，到 peer 环节自信地进行美国大学演讲，再到最\n终决定挑战高级别商赛，你的每一步都走得扎实有力。这份自信，深深植根于你在云谷收获的素质提升与同窗情谊。面对\n未来，大学的筛选准则是现实且严谨的，希望你能拿出日就月将的毅力，在接下来的时间里持续进化，赢下属于你的申请\n季"
      }
    ],
    "academicStrength": "Excels in 体育：综合格斗",
    "academicWeakness": "Needs improvement in 语文 III and 3 other course(s)"
  },
  {
    "id": "刘亦恒",
    "name": "刘亦恒 Layne Liu",
    "chineseName": "刘亦恒",
    "className": "⼗⼀年级问源班",
    "tutorName": "杨晓晶 Jaye",
    "gpa": 3.2555555556,
    "photo": "/photos/刘亦恒-X.jpg",
    "strengths": [
      "荣誉商科 I",
      "体育：综合格斗"
    ],
    "weaknesses": [
      "English Elementary 1（A1）"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "💼 Business Club",
      "🎨 Crafts",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 英语学习提⾼与标化考试提⾼\n 每天20个单词，在⾼2上学期结束前雅思到达4.0\n 每天坚持背诵20个单词，词汇练习\n 申请到A2\n 争取在期中考试之前全部获得3申请A2\n 数学能⼒提⾼、作业准时提交率达到90%、校内所有课程都达到3\n数学积极询问问题、准时完成每天的homework 、作业保质保量的完成（包括PA）",
      "selfReflection": "这学期中我参加了多次竞赛，提⾼了⾃⼰的英语能⼒，同时通过多次竞赛提⾼了⾃⼰的管理能⼒。",
      "tutorComment": "亲爱的Layne，恭喜你完成了这漫长⼜充实的G11第⼀学期！\n这个学期，你的优势表现得⾮常清晰，也⾮常“像你⾃⼰”。你对商科有着真诚⽽持续的兴趣，在相关课程和商赛中投⼊度\n很⾼，能够主动思考问题、快速进⼊状态，并在商赛中取得了令⼈肯定的成绩，这不仅体现了你的能⼒，也说明你在⾃⼰\n真正感兴趣的领域⾥，具备深⼊钻研和⾼效输出的潜⼒。在⼩组任务中，你同样表现出强烈的责任感，愿意主动承担⾓\n⾊、推进进度，是团队中可靠、让⼈放⼼的⼀员。英语学习⽅⾯，你的学习态度和习惯值得肯定：你⾃信、主动，也⾮常\n⾃律，愿意利⽤课外时间通过英⽂剧集和词汇复习不断输⼊，⼝语进步尤为明显。与此同时，在荣誉预备微积分课程中，\n你能够保持基本的课堂参与和作业完成度，项⽬表现也达到熟练⽔平，但考试成绩持续未达到预期，反映出你在核⼼概念\n和基础理解上仍存在⼀定挑战，这⼀部分需要被认真看见和正视。\n展望未来，希望你在继续深耕商科兴趣与优势的同时，也能对“短板学科”投⼊同样有策略的努⼒。荣誉预备微积分并不是\n单靠完成任务就能⾃然提升的学科，建议你尽早、集中地对关键章节进⾏针对性补强，把模糊的概念⼀⼀拆解、补牢基\n础，这将直接影响你后续的学习信⼼和表现。英语⽅⾯，你已经⾛在⼀条正确的路上：接下来需要从“愿意表达”迈向“更精\n准地表达”，通过阅读更长、更复杂的⽂本，以及更频繁地写作与修改，逐步提升深度与准确性。你有⾃我驱动的能⼒，\n也愿意为⽬标付出⾏动，只要在⽅法上更聚焦、在节奏上更持续，就完全有可能让英语和数理课程逐步追上你的整体发\n展。期待你在新的学期⾥，既敢于放⼤⾃⼰的热爱，也能稳稳补齐基础，向⼀个更加均衡、成熟的学习者迈进。",
      "selfReflectionSummary": "这学期中我参加了多次竞赛，提⾼了⾃⼰的英语能⼒，同时通过多次竞赛提⾼了⾃⼰的管理能⼒。",
      "tutorCommentSummary": "这个学期，你的优势表现得⾮常清晰，也⾮常“像你⾃⼰”。"
    },
    "futureDirection": "艺术史/创业/创业",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你以得体的风范和可靠的责任心，诠释了何为“谦谦君子，温润如玉”。你在集体中总是令人感到安心与敬佩。在需要协作\n时，你总是主动承担责任，并能出色地完成所肩负的部分，无论是资料梳理、观点整合还是流程协调，你都表现得沉稳而\n高效。你的剧本《判词之外》敏锐地抓住了《红楼梦》中 “太虚幻境判词”这一预示命运、充满宿命论色彩的核心设定，并\n将其进行了一场极为犀利的现代转译。你将古典的“判词”转化为当代社会中无处不在的评价体系。老师对你最真诚的期待\n是：在课堂讨论中更积极地参与和分享，你将完成从优秀的“思考者”到卓越的“思想启发者”的关键跨越。"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Layne achieved an overall performance rating of \"Developing.\" His class participation and homework completion were \nacceptable, and his project was rated as \"Proficient.\" However, his exam scores from the midterm to the final remained \nlow, suggesting fundamental difficulties with the core course co"
      },
      {
        "name": "English Elementary 1（A1）",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Layne is a confident, active, and self-motivated learner. Throughout the semester, he has shown a positive and \npersistent attitude toward English learning. His learning habits are well established and reliable. I am particularly \nimpressed by Layne’s progress in speaking and truly appreciate his se"
      },
      {
        "name": "英语词汇强化",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Layne is a quiet student who is not always highly engaged in class, and a few absences have also affected her \nconsistency. However, he is careful with vocabulary learning and remembers new words well. At this stage, he needs to \nfocus more on applying these words in real use, especially in speaking"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Layne demonstrated excellent refinement. His investigation of how \nAI video push algorithms intensify information cocoons was cutting-edge. He handled the literature review deeply, \neffectively critiquing key algorithmic biases. Layne’s fieldwork p"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "I am thrilled with the progress you have made. It feels like something \"clicked\" for you midway through the term. Your \nimproved efficiency in class and your willingness to share diverse perspectives have greatly enriched our lessons. You \nhave proven to yourself that once you find the right approac"
      },
      {
        "name": "荣誉商科 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Layne is a sharp and insightful contributor when engaged, often cutting to the heart of class work and projects with \nintuition. His high participation and grades reflect his capability. However, he should guard against overconfidence, \nensuring he acts on his quick understanding to achieve comprehe"
      },
      {
        "name": "体育：综合格斗",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "刘亦恒同学课堂态度认真，积极参与各项训练，身体素质较好，对双腿摔和十字固技术掌握情况良好。他能够在练习中保\n持专注，并尝试在动作细节上进行改进。建议继续巩固现有技术，多进行实战模拟和高强度练习，进一步提升技术熟练度"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Layne，你的学习节奏越来越扎实了，这个学期还主动带着学弟学妹们一起冲全国站商赛，真的很棒。\n在三方面谈中，我们也对你的升学目标做了更深入的讨论，无论从哪个维度来看，英语都是你现在最重要的目标。\n同时，在选校的角度上，我们可以尝试保持更开放的思路，给自己更多可能性。"
      }
    ],
    "academicStrength": "Excels in 荣誉商科 I and 1 other course(s)",
    "academicWeakness": "Needs improvement in English Elementary 1（A1）"
  },
  {
    "id": "刘宇澄",
    "name": "刘宇澄 Elianna Liu",
    "chineseName": "刘宇澄",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "钱寒轩 Hanhsuan",
    "gpa": 3.7444444444,
    "photo": null,
    "strengths": [
      "English Advanced 2（B2+）",
      "荣誉中国研究",
      "荣誉艺术精修 I"
    ],
    "weaknesses": [
      "English Advanced 2（B2+）",
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "💼 Business Club",
      "🎤 Debate"
    ],
    "growthPortrait": {
      "goals": "Not available",
      "selfReflection": "这个学期在忙碌中度过，也伴随着许多第⼀次。⼈总会在⼀段时间的 lock in 状态⾥，感到的同时难以描述的快乐。这\n时，浮现出可以坚固和打磨的部分，成为最好的切⼊⼝，代表还有很多事可以做。\n在中国研究的项⽬中，第⼀次完成了⼀篇从零到⼀的论⽂：⽂献综述、访谈、⽅法论、讨论与结论，以及引⽤。⼼理与经\n济的写作也是如此，体会到创造所带来清晰的愉悦与成就感。于是我逐渐发现，⼀天可以写完⼀份1200词的报告，24⼩\n时的可能性，以及连续7⼩时全然投⼊状态究竟代表什么。\n我看到的⼈⽂学科，有多元⽅式阐明那些本⾝⽆形的思考，捕捉⼀些没有⽂字即难以把握的情感。受到在⼈⽂学科中构建\n世界观的作者的启发，我可以将这些内容作为视⾓，剖析社会中的现象，并通过其他⼈的思想，观察，做联系，从⽽构建\n我⾃⼰的世界观。\n⽆意间看到这句话，“当风格稳定下来，⼈也更平静。” 看似简单，却在这个阶段产⽣了很深的共鸣。这个学期，我好像格\n外认真地在寻找⾃⼰的风格，并在⼀种风格上停留、完善，不断加深对⾃⼰的认知。随之⽽来的是愉悦，平静和灵感。同\n时，对⾃然与创造极其向往，⽆限接近，指向各种各样的创作。这段时间，我思考了许多，也有了更深的⾃我认知。⾯对\n许多问题时，能够给出更坚定的答案。\n“你现在感受到的、想到的⼀切，都是真实且有⼒量的。”",
      "tutorComment": "宇澄，进⼊⾼⼆以来，你⾝上迸发出的能量让⼈眼前⼀亮。最让我为你⾼兴的，是你在不断尝试中逐渐明晰了⾃⼰的兴趣\n所在——从最初勇敢选修经济、艺术，到最终确认社会科学是你真正热爱的⽅向。这份探索的勇⽓和清醒的⾃我认知，远\n⽐⼀时的成绩更珍贵。\n你在社科和⽂科上的表现尤为出⾊，不仅成绩优秀，思考也有深度，连学科⽼师都多次肯定你的理解⼒与表达能⼒。这说\n明你不仅找到了⽅向，也正在⽤踏实的努⼒把热爱转化为实⼒。\n与此同时，你⾝边始终有知⼼的朋友相伴，彼此⽀持、真诚相待，这份⼈际关系中的温暖与信任，也是你成长路上的重要\n⽀撑。看到你学业与⼈际都稳步向前，作为导师，我感到由衷欣慰。\n未来的路，希望你继续追随内⼼的热爱，在擅长的领域深⼊学习，保持这份清醒与热情，相信你会⾛出属于⾃⼰的精彩道\n路。",
      "selfReflectionSummary": "这个学期在忙碌中度过，也伴随着许多第⼀次。",
      "tutorCommentSummary": "希望你继续追随内⼼的热爱，在擅长的领域深⼊学习，保持这份清醒与热情，相信你会⾛出属于⾃⼰的精彩道 路。"
    },
    "futureDirection": "社会科学",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "宇澄，你学习踏实，课堂上能专注听讲、适时提问，作业也能认真及时完成，展现出良好的学习习惯。在戏剧展演的后台\n工作中，你与团队配合默契，技术性任务完成得出色，体现了你的协作精神与责任感。目前，作业和课堂思考的质量还有\n提升空间，这意味着你需要在“理解”的基础上，更多地向“分析”与“评价”迈进。建议在阅读时多问几个“为什么”，在写作前\n先搭建逻辑框架。思维的深度与速度同等重要。你具备扎实的基础，只需再加一把深入思考的火，便能燃起更亮的智慧之"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Elianna’s overall performance is rated as \"Developing.\" She participated actively in class and completed her project \nsatisfactorily. However, her homework completion was inconsistent, and her exam results were at the \"Growing\" level, \nsuggesting that her foundational knowledge network requires stre"
      },
      {
        "name": "English Advanced 2（B2+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Elianna has an exceptionally strong command of English and is clearly ready for a greater language challenge. She \nspeaks fluently, creatively, and with a wide-ranging vocabulary, and her writing reflects the same high level of skill. She \nhas virtually no difficulty listening to, understanding, and"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Elianna demonstrated exceptional refinement and outstanding \nleadership. Her analysis of how perfectionism in Xiaohongshu and YouTube lifestyle vlogs constructs the \"ideal self\" for \n16-22-year-old women was masterful and profound. She handled the "
      },
      {
        "name": "大学心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "I appreciate your focus and your polite nature in class. I know that recent grade fluctuations have been a source of \nworry for you, but please don't be discouraged. This is just a sign that we need to tweak your approach. While you are \nquiet on the outside, I want your mind to be \"loud\" on the ins"
      },
      {
        "name": "大学经济学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Elianna, I truly admire your persistence and how much you care about achieving high scores; it clearly reflects the high \nstandards you set for yourself. This drive is a powerful motivator for academic success. However, as we move forward, I \nwant to see you channel that ambition into a deeper focus"
      },
      {
        "name": "荣誉艺术精修 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "宇澄，虽然你之前没有系统学习过艺术，但课堂上你展现出良好的感知力和上手能力。在作业中，你能结合自己的理解，\n清晰地表达出独特的审美判断——色彩、构图或材料的选择都透露出你对美的敏感。这种直觉和勇气是艺术探索的重要起\n点。希望你继续保持开放的心态，在后续学习中积累更多经验，让这份灵感慢慢生长。"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "刘宇澄在本学期的体育课里总是努力完成每一次接盘，可以在比赛里完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期的未来规划课程围绕三个单元展开，帮助你理解基于全面评估政策的大学申请逻辑，学习查校与选校，并最终完成\n了属于你自己的大学清单。通过回顾和梳理课外活动，你也完成了第一版activity bank和简历。这些看似基础的准备，其\n实正是在为未来的申请一点点铺路。\n在第一单元中，你能够紧跟课程节奏，通过模拟招生官案例分析，认真思考大学究竟在看什么。同时，在重新梳理七大申\n请材料模块的过程中，你也再次清晰地意识到了校内成绩的重要性。过去无法改变，但专注当下永远来得及，我对你接下\n来的成绩提升充满信心。进入第二单元，你开始向内厘清自己真正看重的选校标准——专业资源是否扎实、能否与教授和\n同学建立紧密"
      }
    ],
    "academicStrength": "Excels in English Advanced 2（B2+） and 3 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "刘沐华",
    "name": "刘沐华 Arno Liu",
    "chineseName": "刘沐华",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "江宁 Johnny",
    "gpa": 4.68,
    "photo": null,
    "strengths": [
      "语文 III",
      "大学微积分 I",
      "One Schoolhouse: AP Statistics I"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "⚽ Football",
      "🎭 Musical/Drama",
      "💼 Business Club",
      "🎨 Crafts"
    ],
    "growthPortrait": {
      "goals": " 提升综合学术能⼒ \t超越\n\n1.校内学术成绩4，5对半开\n2.两门OSH成绩稳定在95%以上\n3.SAT1540+\n4.学术竞赛上获得奖项\n\n1.全科精熟，并且优势学科（Business，Statistics，Macroeconomics，P.E，Future Planing）超越\n（1）制定学习时间表：\n每周固定时间复习⾮优势科⽬，每门每周⾄少⼀次深度学习，每次45分钟；\n（2）优势科⽬中安排更⾼阶内容的挑战训练（如难题，英⽂原版书籍阅读等）每周⾄少3次。\n（3）知识补强与反馈机制：\n（1）通过错题本和“回顾笔记”制度定期反思学习盲区。\n（2）借助外部资源强化学习：\n（3）使⽤例如可汗学院（Khan Academy）、Bilibili，Tik Tok等平台补强弱科；\n2.在学术竞赛上取得成绩\n（1）HimCm争取⼀等奖\n（2）沃顿商赛进⼊半决赛\n3. Macroeconomics 5分\n（1）完成课程学习进度（去年10⽉-4⽉）：\n通过OSH完成6章节内容，包括阅读、笔记与对应练习；\n（2）刷题与真题训练（4⽉-5⽉）：\n每周练习Progress check题和OSH练习\n（3）考前冲刺阶段（5⽉-5⽉5⽇）：\n锁定错题题型集中突破；参加⾄少两场完整模拟考试；\nStatistics 5分\n（1）完成课程学习进度（去年10⽉-4⽉）：\n通过OSH完成6章节内容，包括阅读、笔记与对应练习；\n（2）刷题与真题训练（4⽉-5⽉）：\n每周练习Progress check题和OSH练习\n（3）考前冲刺阶段（5⽉-5⽉5⽇）：\n锁定错题题型集中突破；参加⾄少两场完整模拟考试；\n4.SAT 1540+\nⅠ. 基础学习阶段（9 ⽉ – 10 ⽉中旬）\n⽬标：完成核⼼知识学习，全⾯熟悉题型与解题思路。\n学习任务：\n1.完成语法和阅读的基础知识学习\n2.在笔记本上记录关键知识点\nⅡ. 强化刷题与真题训练阶段（10 ⽉下旬 – 11 ⽉）\n⽬标：在掌握基础的前提下，提升解题速度和准确度。\n学习任务：\n1.刷难度在680+的阅读题，并且每⼀道错题在错题本上记录并分析\n2.刷⼤量语法题，对每⼀个语法点产⽣⾃⼰的认识\nⅢ. 考前冲刺阶段（12 ⽉ 1 ⽇ – 12 ⽉ 31 ⽇）\n⽬标：实战模拟 + 查缺补漏，稳定发挥。\n学习任务：\n锁定错题题型：集中突破最常错的 2–3 类题型。\n完整模拟考试：\n⾄少参加 2–3 场全真模拟考试，严格按照正式考试时间。\n每次模拟后复盘 1–2 天，总结时间分配和答题策略。\n考前 1 周：\n主要回顾错题本和核⼼语法点；\n每天练习 1–2 套⼩规模题保持⼿感；\n调整作息，与考试⽇保持⼀致。\n 多元发展，提升组织能⼒和领导⼒ \t超越\n 1.完成⼀篇论⽂写作\n2.通过⾜球社团延伸个⼈活动\n\n论⽂写作：\n阶段⼀：选题与框架（9 ⽉ – 10 ⽉）\n任务：\n确定研究⽅向（如：交通拥堵的最优调度、医疗资源分配、碳排放控制、⾦融视⾓下的教育不平等等）。\n初步查阅⽂献（Google Scholar、CNKI、SSRN），收集⾄少 10 篇相关研究。\n明确模型思路：数学建模（优化/博弈/回归/仿真）或⾦融分析（成本收益分析、风险模型）。\n搭建论⽂框架（引⾔—⽅法—案例—结论）。\n阶段⼆：模型与分析（11 ⽉）\n任务：\n⽤ Python/Excel/Matlab 建⽴初步模型；\n测试不同情景，收集数据并进⾏敏感性分析；\n完成论⽂中“⽅法与结果”部分的初稿。\n阶段三：写作与修改（12 ⽉）\n任务：\n完成全⽂初稿（3000–4000 字为宜，英⽂写作更具学术价值）；\n邀请⽼师或同学进⾏反馈；\n根据反馈进⾏修改，完成定稿。\n成果：⼀篇结构完整、逻辑清晰的学术论⽂，可⽤于学术竞赛或⼤学申请材料。\n⾜球社团（待定）",
      "selfReflection": "Compared with the previous semester, this semester reflects a clearer sense of direction and greater self-awareness in\nmy academic and personal development. I became more focused on learning processes and on how reflection and\npersistence shape real progress.\nOne major achievement this semester was earning a 112 on the TOEFL. More than the score itself was the change in\nmy learning approach. I shifted from fragmented practice to a more systematic strategy by identifying weaknesses and\nmaintaining long-term consistency, particularly in speaking and writing. This experience helped me understand the value\nof gradual improvement. My participation in HiMCM and the Wharton Global High School Investment Competition also\nled to noticeable growth. Taking on leadership responsibilities required clear communication, coordination, and decision-\nmaking under pressure, which strengthened both my leadership and individual problem-solving skills. Academically, my\nperformance remained stable across rigorous courses while continuing to improve, reflecting better time management.\nBeyond academics, the football club I founded continued to develop. This semester, I focused on sustainability by\nstrengthening its structure and clarifying a long-term vision for continued impact.\nAt the same time, this semester revealed areas for improvement. My SAT preparation faced setbacks. While progress\nwas slower than expected, the experience strengthened my capacity for reflection and resilience. In physics, limited time\nand inefficient study methods created challenges, showing that more targeted strategies are needed.\nLooking ahead, I aim to achieve a breakthrough in SAT preparation through more focused methods, expand my\npersonal initiatives to contribute more to the community, and advance further in the Wharton competition to represent\nmy school with greater responsibility and impact.\n“We are what we repeatedly do. Excellence, then, is not an act, but a habit.”-Aristotle",
      "tutorComment": "To Arno，\n最近你和我分享了两个令⼈欣喜的消息： ⼀个是沃顿商赛获得了全球前50， 另⼀个是政治学考过了。从竞争度上，它们\n分属两端，却同样令⼈欣喜，我在想，这是为什么呢？后来我意识到它俩本质上是⼀致的——都是⼈们抱着期待，所获得\n的成果。也正因如此，我发觉万事有期待很重要：有期待就会有动⼒，有期待就有实现的可能。\n云⾕要做100年，这本⾝就是⼀种期待，是全体在校⽼师们的期待，为了这份期待我们在努⼒。我也希望你有期待，对⾃\n⼰的未来有期待，具体地，⾸先是对⾃⼰的升学有期待。期待不怕⾼，但怕没有，因此要有且可以期待的⾼⼀些，朝着这\n份期待去努⼒，⼀步步往前⾛，届时也会收获成倍的喜悦。\n⾄于其他⽅⾯，你都在道路上坚定着⾛着，我没有担⼼。\n加油，少年，⼤胆做梦，⼤胆往前⾛。\n江宁 , 2026.02.02",
      "selfReflectionSummary": "Compared with the previous semester, this semester reflects a clearer sense of direction and greater...。",
      "tutorCommentSummary": "希望你有期待，对⾃ ⼰的未来有期待，具体地，⾸先是对⾃⼰的升学有期待。"
    },
    "futureDirection": "经济/商学",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "沐华，你的学习风格颇有“深藏不露，暗自用功”的智慧。课上貌似轻松，实则思维紧跟，课后更是持续精进，这种高效的\n学习策略让你事半功倍，作业质量也稳步提升。戏剧展演中，你积极认真、状态松弛，这种“松弛感”恰恰是良好心理素质\n和专注投入的表现。只是团队合作中还需要探索新方法保证任务以更高质量完成。今后，除了个人精进，不妨更主动地承\n担组织、协调之责，将个人智慧转化为团队动能。你已找到自己的节奏，请保持这份从容与笃定！"
      },
      {
        "name": "大学微积分 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Arno has delivered an excellent performance this semester, maintaining high standards with only minor fluctuations. He \ncombines strong logical reasoning with sharp abstraction skills, proactively clarifying doubts to ensure his understanding \nis solid. A standout aspect of his progress is the signi"
      },
      {
        "name": "One Schoolhouse: AP Statistics I",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "Arno’s performance in the AP Statistics course reflects developing strength in logical reasoning and problem solving, \nparticularly when he engages fully with unfamiliar or multi-step problems. He demonstrates the ability to apply core \nstatistical ideas and work through questions that require inter"
      },
      {
        "name": "thinking and expressive flexibility.",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Arno, your performance is exemplary. You consistently demonstrate strong leadership by confidently initiating and \nguiding class discussions, and your commitment to producing well-researched, thoughtfully revised work is truly \ncommendable. These qualities make you a standout contributor.\nTo build u"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Arno demonstrated exceptional mastery and insightful depth. His \nexploration of how commercial interests shape mass media's response to fake news and misinformation was \noutstanding, tackling a critical nexus of economics, journalism, and informati"
      },
      {
        "name": "One Schoolhouse: AP Macro Economics I",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "Arno started the course strong and has built on this throughout the semester. He does a great job of raising questions \nand acting on feedback; this shows in his continual growth. In his end of semester reflection, Arno shared how his \napplication of concepts has improved through his coursework. “On"
      },
      {
        "name": "大学商业研究 I",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "Arno enters the course with a strong conceptual understanding often exceeding his peers. To maximize his growth, he is \nencouraged to actively participate in discussions to see how these theories apply to dynamic, real-world business \ncases. While he is a confident communicator and synthesizer durin"
      },
      {
        "name": "大学物理 I: 力学",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Arno has demonstrated satisfactory overall performance this semester, though his progress has fluctuated at times. He \npossesses strong logical reasoning and a solid mathematical foundation, allowing him to grasp new concepts quickly \nand connect them naturally to prior knowledge. He applies these p"
      },
      {
        "name": "体育：足球",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Arno has performed quite well in every of the practice drills that we set up. His coordination, conduction of the ball and \npassing is very accurate.Arno has demonstrated his quality in the test performed, both in passing and ball control as \nwell as in shooting at goal, since he does it with great "
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "刘队，由衷地想和你说，能加入你的成长旅程，我很幸运。一路走来，我也清晰地感受到我们之间那份日益加深的信任，\n这是作为老师的幸福时刻！\n这个学期对你来说，真的是“燃尽了”却也收获满满的一段。沃顿商赛的阶段性成果、托福的出分、UCB 每周凌晨两点的课\n程、One Schoolhouse 的两门并行学习……这些看似冷冰冰的节点，其实都浸透着你的时间和心血。正如你说的，坚毅\n是一种精神——你把它落在了每天的清晨和深夜。\n当然，这个学期也有不那么顺利的时刻：SAT 的起伏、理工科课程难度的提升，都给你提出了更高的要求。但你没有被动\n承受，而是用强大的行动力把困难拆解为路径，一步一步攻克。\n足球队的系统也"
      }
    ],
    "academicStrength": "Excels in 语文 III and 9 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "劳嘉欣",
    "name": "劳嘉欣 Doris Lao",
    "chineseName": "劳嘉欣",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "钱寒轩 Hanhsuan",
    "gpa": 3.3777777778,
    "photo": "/photos/劳嘉欣-J.jpg",
    "strengths": [
      "语文 III",
      "荣誉中国研究",
      "主修乐器 I"
    ],
    "weaknesses": [
      "English Elementary 1（A1）"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提⾼英语写作和阅读能⼒\n 争取成绩到2/3\n 好好做早读的阅读上课认真听，多背单词争取每次听写及格，每次都要提前准备好⼀篇单元作⽂，也争取在考试上\n（期中期末）及格",
      "selfReflection": "我眼中的⾃⼰很完美但也不完美。我好像还依然是那个充满好奇⼼待⼈很热情的⼩⼥孩。\n所以如果你问我眼中⾃⼰是什么样⼦，我会说：是在策划组织活动当领导者很优秀的样⼦、是在坚定的去做⾃⼰喜\n欢事情那种勇敢样⼦、是在⼀个⼈上台表演很好呈现时有魅⼒的样⼦、是在知道⾃⼰成绩没那么好背后默默努⼒的样⼦、\n是⾃⼰拍抖⾳时⾃信的样⼦、是在⼼情不好但还依然热情的样⼦、是在寝室⾥家⾥发疯的样⼦、是能处理任何问题有主见\n的样⼦。当然哪⽌这些也有，遇到⼀点⼩事就哭的样⼦、因为知道⾃⼰英语不好所以说英语时⼩⼼翼翼的样⼦。\n是不完美，未完成，但正因为如此，每⼀天早上醒来，我都还能在镜⼦⾥看见新的可能正在⽣成。\n⼗七岁的画布上，最重要的不是已经画了什么，⽽是留⽩的部分还等着什么。镜头背后的我，正在微微颤抖，也正在\n逐渐坚定。",
      "tutorComment": "嘉欣，这学期，你在学业上取得了实实在在的进步，不少科⽬都提升了⼀个等级，这份成果背后是你⽇复⼀⽇的坚持和努\n⼒，作为导师，我由衷为你感到欣慰。更让⼈欣喜的是，你在⼈际交往中也逐渐找到了属于⾃⼰的节奏——不急不躁，真\n诚⾃然。\n在学⽣会的⼯作中，你展现出阳光、积极的⼀⾯，善于沟通、懂得协调，总能把任务稳妥地推进，也让⼤家看到了⼀个可\n靠⼜温暖的嘉欣。这些能⼒，同样是成长中宝贵的财富。\n当然，我也想提醒你：学⽣⼯作固然重要，但学业仍是现阶段的根基，尤其是语⾔类科⽬，需要持续投⼊、下苦功夫。不\n妨在忙碌中留出固定时间专注学习，找到两者之间的平衡点，才能⾛得更稳、更远。\n希望你能继续保持现在的节奏，不骄不躁，⼀步⼀个脚印。前⽅的路还很长，但以你的踏实与韧性，⼀定会越⾛越开阔。\n加油，嘉欣！",
      "selfReflectionSummary": "我眼中的⾃⼰很完美但也不完美。",
      "tutorCommentSummary": "这学期，你在学业上取得了实实在在的进步，不少科⽬都提升了⼀个等级，这份成果背后是你⽇复⼀⽇的坚持和努 ⼒，作为导师，我由衷为你感到欣慰。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "嘉欣，你是一位“兴趣驱动型”的学习者，对自己认同的任务（如导演工作）能展现出极强的责任心、极高的自我要求与出\n色的执行力——戏剧展演中你尽责用心的导演表现便是明证。这种追求卓越的劲头若能平摊到所有学习环节，你的语文能\n力将有质的飞跃。作业迭代的主动性值得称赞，它体现了你的反思精神。下一步，或许可以尝试对“不感兴趣”的文本或任\n务进行“挑战性解读”，将其视为拓展思维边界的训练。语文的广度与深度，往往就在征服一个个“不感兴趣”中建立起来！"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Doris achieved an overall performance rating of \"Developing.\" She performed very well in class participation, note-\ntaking, and daily homework, and her project was rated as \"Proficient.\" However, her exam results, particularly her final \nexam score, were significantly lower than her daily performanc"
      },
      {
        "name": "English Elementary 1（A1）",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Doris has worked very hard and consistently throughout this semester. She memorizes the required vocabulary in \nadvance and is always well prepared for quizzes. Although her results have not always met her expectations, she never \ngives up and maintains a positive attitude, actively looking for more"
      },
      {
        "name": "积极倾听与主动回应",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你本学期学习表现稳定，听说方面都有良好表现，读写部分还需要再加强，作业完成认真。期末考试成绩良好，进步很明\n显，反映出你自己一直在努力。课堂上有主动发言的勇气和自信，踊跃发言，积极参与口语练习，建议继续保持现在的学\n习习惯，读写部分可以参考教科书的练习完成一些简单的日文作文，使自己在日语的读写部分再加以提高。"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Doris demonstrated exceptional insight and refined excellence. Her \nsophisticated exploration of how Douyin \"pseudo-natural makeup\" videos use filters to create flawless authenticity and \nshape consumption patterns showcased masterful originality. "
      },
      {
        "name": "荣誉心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Your presence in class can be a bit of a puzzle. I see moments where you are deep in thought during interesting topics, \nbut also times where you seem to disconnect or lose energy completely. Your grades are plateauing not because you \nlack ability, but because you are \"skimming the surface.\" To imp"
      },
      {
        "name": "主修乐器 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Doris在本学期主修流行演唱课程中始终保持着对歌唱的真挚热爱，课堂上认真投入，练习态度积极。虽然起初在表演时\n略显紧张、自信心不足，但你能坚持完成每一次训练任务，并逐步尝试突破自己的舒适区。令人欣慰的是，在期末展演\n中，你以真诚而富有感染力的演唱打动了听众，展现出明显的进步和潜力，老师为你感到骄傲！希望下学期你能更勇敢地\n尝试不同风格的作品，大胆表达自我，相信随着经验的积累，你的声音和舞台魅力会越来越自信、耀眼。"
      },
      {
        "name": "体育：游泳",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期你对待游泳课程态度端正，训练刻苦踏实。自由泳节奏把控精准，换气技巧掌握熟练；蛙泳动作标准，手臂划水与\n腿部动作衔接自然。团队合作中，你乐于分享技巧，主动协助基础薄弱的同学，是团队里的得力帮手。愿你带着这份认真"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Doris，这一学期，你们正式进入了大学申请准备的起步阶段。在未来规划课上，你完成了选校维度的梳理，设计了属于\n自己的梦校海报，初步产出了课外活动清单初步描写，并制作了个人简历。这些任务不只是作业本身，更是一次次对自我\n认知与未来方向的深入思考。\n这一学期，再一次看到你不断进步与闪闪发光的样子，让人由衷欣喜。每一次三方面谈，你总是准备得最充分，思考细\n致、表达清晰，这份认真与投入始终贯穿在你的成长过程中。\n你也开启了更多元的探索，也让大家看到了你的潜力与可能性。你在商科领域同样有兴趣与能力，无论是项目管理、活动\n统筹，你都做得稳妥而出色，展现出很强的责任感与组织能力。在舞台上唱歌的你也是自信、"
      }
    ],
    "academicStrength": "Excels in 语文 III and 4 other course(s)",
    "academicWeakness": "Needs improvement in English Elementary 1（A1）"
  },
  {
    "id": "周小琳",
    "name": "周小琳 Serena Zhou",
    "chineseName": "周小琳",
    "className": "⼗⼀年级问源班",
    "tutorName": "夏梓元 Emily",
    "gpa": 3.8111111111,
    "photo": null,
    "strengths": [
      "语文 III",
      "荣誉统计学 I",
      "荣誉中国研究"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🎨 Crafts",
      "🎤 Debate",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 寒假托福：67+（或者多邻国110+\n 1、保持每周⼀百左右新词背诵。2、每周⾄少两篇课外英语阅读。3、学期内看三个ted视频。\n今年内考⼀次多邻国、100+\n ⽇语N3：150分以上通过\n 1、每周完成课⽂和单词背诵 2、挑⼀本书看五个章节以上。",
      "selfReflection": "如果能够看到既定的未来，你的选择是否会不⼀样？\n正是因为不知道「正确的道路」，你才能⾛出⾃⼰的路。\n⽽你⾛出的路，将会是珍贵的礼物。\n在你的过去，你从未、也不想思考未来的样⼦。你喜欢的东西⾜够多，⾜够塞满你的⽣活，⾜够挡住你向前的视线。你好\n像什么都能做，好像什么都想做，你的未来向四⾯⼋⽅延续着。\n在你的今天，你想要、也必须踏出选择的第⼀步。你要选择⾃⼰的未来，你得告诉世界你想要的明天。过去的万千条道路\n反⽽成为了对于未来的迷雾。你的未来会选择这之中的哪⼀条？哪⼀条⼜能通往你的幸福？\n你总想要找到最完美的⼀条路。\n但尽管抱着诸多的疑问，你依旧前进着。你说你坚毅，你说你没停下过，你也确实做到了。你学着⽇语（N3阅读满分！）\n和英语，准备着EJU，也学着学校的课程。课程之外，你坚持着⾃⼰喜欢的绘画和舞蹈你开始了⾳乐创作的学习，凭着⾃\n⼰的努⼒研究着DAW的使⽤，也努⼒的学着乐理。你既在往前⾛着，也⼀直在做你作为⾃⼰的事情。\n不论如何，因为你⼀直在往前，所以你⼀直在靠近能够⾛上最完美的路的你。\n你觉得你眼中的⾃⼰是怎样的呢？你想要⾜够与众不同，⼜想要不那么虚⽆缥缈。但我知道，你的世界⼀直在由你守护\n着。\n我也不知道你该以什么⾝份活下去，但我相信，你⼀定创造活成你能够堂堂正正笑出来的未来。",
      "tutorComment": "亲爱的⼩琳：\n⾸先祝贺你在坚持与努⼒中稳扎稳打渡过了这⼀漫长的学期！\n正如你在素养答辩的标题：I didn’t quit! 在这个学期，我看到了你⾝上的坚毅、责任感和勇⽓。⾯对不确定的未来，你没\n有放弃思考，勇敢地做出了符合内⼼和价值观的决定，并⽤实际⾏动去践⾏⾃⼰选择的责任，展现出了⾮常成熟的⼀⾯。\n在学术上，你也不曾懈怠，能够稳稳地完成每⼀项任务。即使在素养答辩的时候你⾝体有恙，但依然坚持去完成，深夜还\n在反复修改你的反思论⽂直⾄达到内⼼要求。作为你的导师，我真的⾮常感动和欣喜看到你有这样的成长变化，虽然你在\n答辩中说⾃⼰“weak”，但我想你这个学期就是在⽤真实的⾏动展现你的⼒量与光芒！我也相信这段时间的经历在未来都能\n够成为你迷茫时的“底⽓”。\n所以，这个寒假请好好休整，为接下来⽆论是语⾔考试、留考还是AP都做好准备吧！它们都会是不⼩的挑战，所以也期\n待你可以：\n1. 在多任务并⾏的时候能够沉稳地规划好⾃⼰学习的节奏，做好任务和时间管理不拖延；\n2. 注意⽇常积累不要松懈，⽆论是语⾔学习还是刷题都不是⼀蹴⽽就的，都需要长时间培养“感觉”；\n3. 当然，最重要的还是管理和照顾好⾃⼰的⾝体与情绪，这些是⼀切的基础。\n期待下学期看到⼀个更加⼤胆、⾃信的⼩琳，相信我们⼀起可以并肩向着⽬标稳步迈进！",
      "selfReflectionSummary": "如果能够看到既定的未来，你的选择是否会不⼀样。",
      "tutorCommentSummary": "这个学期，我看到了你⾝上的坚毅、责任感和勇⽓。"
    },
    "futureDirection": "艺术方向",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你如同一颗闪烁着独特光芒的“鬼马精灵”，你的核心特质在于充满灵性的创意与严谨的作业态度。 你鬼马精灵，思维跳\n跃，常有出人意表的见解；你极富创意，总能在经典文本中发现新的诠释角度。难能可贵的是，这份灵动并未影响你对待\n学业的严谨，你的作业完成得很认真，质量稳定，体现了良好的学习习惯。这种感性与理性的平衡，在你主导的戏剧构思\n中达到了完美融合。最令人印象深刻的是你的剧本，你敏锐地抓住了《红楼梦》中“金钏儿被逼跳井”这一极具悲剧张力与\n压迫感的事件，并将其内核——一种在权力与伦理压迫下青春生命的脆弱与毁灭——创造性地移植到 “现代少女与母亲之\n间紧张关系” 的叙事框架中。这个选择本身，就显示了你对"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Dear Serena,\nYou have demonstrated an excellent grasp of our honor statistics material this semester. Your focused attention during \nlectures and the consistently high quality of your homework assignments show a commendable level of dedication. You \nhave clearly mastered the technical aspects of dat"
      },
      {
        "name": "English Intermediate 2（B1）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Dear Serena, you have shown clear growth this term, especially in your willingness to learn and reflect on yourself. You \nhave a great wealth of knowledge within you that I want to create opportunities to share. My only concern is that for now, \nyou have not demonstrated equal performance in speakin"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Serena demonstrated commendable performance. Her emphasis \non the role of dance UP owners' attire in spreading pan-secondary culture and reasons for choices captured an \nengaging intersection of fashion and digital subcultures. She handled the lite"
      },
      {
        "name": "大学人文地理 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hello Serena. It was a pleasure having you in our CL human geography course. I appreciate your clear progress during \nthe second half of the semester.  The topic selection of PA task is impressive as the border, its tension and the impacts \nare clearly identified and well-focused. However, I can see"
      },
      {
        "name": "大学商业研究 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Serena clearly understands the course content and skillfully leverages AI to produce comprehensive reports. To fully \nbenefit from the collaborative environment, she is encouraged to step out of her comfort zone and participate more in \nclass. Bringing the confidence of her written work and her Mock"
      },
      {
        "name": "荣誉生命科学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "这一学期，你在荣誉生命科学课上的表现非常稳健。无论是课堂听讲的专注度，还是课后作业的质量，都体现了你严谨、\n负责的学习态度，成绩也一直保持在优秀水平。作为老师，我非常欣赏你这种踏实的学风。不过我也注意到，你在课堂讨\n论时有些过于安静了。其实，把脑海中的思考转化成语言表达出来，不仅能帮你理清思路，也是学习中很重要的一种能\n力。希望下学期能看到你稍微主动一点，大胆分享你的见解，期待你的进步。"
      },
      {
        "name": "体育：美国体育舞蹈",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你是一个极具天赋且踏实的学生。你的身体柔韧性非常好，学习新动作的速度极快，并且一旦学会就能记得非常牢固，这\n种高效的学习能力是你的巨大优势。现在的你更多是在技术层面上完成了动作，在表现力上还有很大的提升空间。建议你\n多观察一些专业选手的舞台状态，尝试在跳舞时加入更多的自信与热忱，让你的表演更具生命力。 老师期望你能打破内\n心的羞涩，在音乐响起时完全释放自我。希望在不久的将来，我能看到一个不仅动作标准、更是充满自信笑容的周小琳，"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期的未来规划课程围绕三个单元展开，帮助你逐步理解基于全面评估政策的大学申请逻辑，学习查校与选校，并最终\n完成了属于你自己的大学清单。通过回顾和梳理课外活动，你也完成了第一版 activity bank 和简历。虽然申请日本大学的\n材料要求与其他国家有所不同，但你依然以一贯认真、踏实的态度完成了每一项任务。拥有这样的品质，无论走哪条路，\n都会走得很稳。\n在第一单元中，你能够紧跟课程节奏，通过模拟招生官案例分析，认真思考全面评估下大学究竟在看什么，并同步梳理了\n现阶段七大申请材料模块的准备度。进入第二单元，你开始向内厘清自己真正看重的选校标准——学校环境、生活条件、\n社会认可度以及专业匹配度等"
      }
    ],
    "academicStrength": "Excels in 语文 III and 4 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "周禾雨",
    "name": "周禾雨 Lily Zhou",
    "chineseName": "周禾雨",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "束晨燕 Eva",
    "gpa": 3.5333333333,
    "photo": "/photos/周禾雨-E.jpg",
    "strengths": [
      "荣誉统计学 I",
      "主修乐器 I",
      "荣誉乐理 I"
    ],
    "weaknesses": [
      "荣誉心理学 I",
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提升专业能⼒ \t达成\n 每天⾄少进⾏声乐的练习30分钟\n 利⽤课间时间练习⽓息，在⾃习或者主修乐器课上练习歌曲",
      "selfReflection": "这学期的我明显⽐上个学期更加的努⼒⼀些，也将⾃⼰的⽣活更加充实了起来，虽然经常⾮常繁忙但是我也做了很多的坚\n持，且成绩也⼀直有在进步。我会花更多的时间在学习上，包括在专业练习上也花了更多的时间，对⽐以前有很⼤的进步\n了，在繁忙的时候也⼀样能做更多的坚持，所以我希望下学期也是如此，我觉得也不需要再多的努⼒，能保持像这学期⼀\n样的努⼒就很好了，但是我希望下学期我还可以坚持在专业⽅⾯花更多精⼒。",
      "tutorComment": "这⼀学期，你最重要的变化，是开始⽤⾏动为⾃⼰争取空间。稳定的学业表现、清晰的时间管理和可靠的⽇常状态，让你\n在期中顺利升级为 Agency 2。这不是奖励，⽽是你⽤长期⾃律换来的信任，也意味着你已经具备更⾃主地管理⾃⼰的能\n⼒。正是在这样的基础上，你在专业⽅向上的投⼊开始显现成果。我还清晰地记得你在1⽉14⽇“⽆标签⾳乐会”上演唱的\n《半句再见》，这是你第⼀次站上舞台，却并不⽣涩——声⾳⾥有控制、有情绪，也有勇⽓。我相信是你这⼀年持续练\n习、反复打磨的结果。谢谢你带来的演出，它让⼈感受到⾳乐被认真对待时所拥有的⼒量。\n进⼊⾼⼆，课程选择更⾃主、更贴近兴趣后，你的学习节奏也更加顺畅。即便被不同项⽬牵扯、时间紧张，你依然能把成\n绩稳住，这说明你正在学会在复杂环境中坚持重要的事。接下来要做的，是持续下去，把稳定变成常态。我知道，英语依\n然是你需要正⾯⾯对的挑战。你已经投⼊了⾜够多的尝试，接下来更重要的是找到真正适合⾃⼰的⽅法，也要学会借⼒\n——向⽼师、同伴寻求⽀持。\n⾼⼆下的时间短、节奏快。希望你继续⽤清醒的规划和坚定的执⾏，为⾃⼰⾛稳这段路。你已经在为未来积累底⽓，接下\n来，只需要⼀步⼀步⾛下去。",
      "selfReflectionSummary": "这学期的我明显⽐上个学期更加的努⼒⼀些，也将⾃⼰的⽣活更加充实了起来，虽然经常⾮常繁忙但是我也做了很多的坚 持，且成绩也⼀直有在进步。",
      "tutorCommentSummary": "希望你继续⽤清醒的规划和坚定的执⾏，为⾃⼰⾛稳这段路。"
    },
    "futureDirection": "音乐表演",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "周禾雨同学在语文学科中展现出突出的感受力与思考深度，具备优秀的自我管理能力，整体学习状态较为稳定。她\n的写作尤其突出，能够在作品中自然流露真挚的个人情感与人生体验，语言细腻而有力量，体现出成熟的表达意识与良好\n的文字掌控能力。在《红楼梦》戏剧改编项目中，她对人物形象的理解到位，舞台呈现自然得体，个人剧本创作展现出良\n好的艺术创造力与现实关照意识。         \n        今后，希望你能够更加坚定地进行自我表达，持续保持写作优势，并将这种内在思考进一步转化为多样化的表达形\n式。需要特别注意的是，请尽量减少请假对学习节奏的影响，如有缺课情况，希望你主动与老师沟通，及时补齐学习内\n容。在保"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Dear Lily,\nYou have demonstrated an excellent grasp of our honor statistics material this semester. Your focused attention during \nlectures and the consistently high quality of your homework assignments show a commendable level of dedication. You \nhave clearly mastered the technical aspects of data "
      },
      {
        "name": "English Intermediate 1（A2+）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Lily is a hardworking student who demonstrates a clear commitment to her studies through her meticulous note-taking \nand consistent efforts to participate in class activities. She clearly values the academic structure of the course and puts \na great deal of effort into her written records. However, "
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hello Lily. It was a great pleasure having you in China Study this semester. I was particularly impressed by your ability to \npull meaningful questions out of social phenomena. Your curiosity about how different cultures shape and assign \nmeanings to 'blood' after watching the Balinese cockfighting "
      },
      {
        "name": "荣誉心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "It is great to see that you have a natural interest in the \"fun\" side of Psychology. However, learning this subject requires \nmore than just bringing your ears to class; you need to bring your full mind. I notice that you tend to tune out during the \ntheoretical parts, which leaves your knowledge fo"
      },
      {
        "name": "主修乐器 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Lily，你拥有非常珍贵的演唱天赋——声音辨识度高，音色清亮又富有质感，而且稳定性极强。无论是在课堂练习还是小\n规模展示中，你总能稳稳地完成作品，音准、节奏、气息控制都相当可靠，让人一听就记住。更难得的是，你唱歌时自带\n一种从容的气质，不慌不忙却充满感染力。接下来，可以试着挑战风格更多元的作品，比如爵士、音乐剧或艺术歌曲，拓\n展你的音乐边界。同时也可以在情感表达上做更细致的层次设计，让“好听”变成“动人”。你已经站在了一个很高的起点"
      },
      {
        "name": "荣誉乐理 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "禾雨是班里最认真对待日常练习的学生，透过这些用心完成的作业，能看到你细心的性格和严格的自我要求。PA任务中\n你创作的旋律充满灵气；自弹自唱时的投入与自信，让音乐在你身上有了最生动的诠释。建议在保持优势的同时，针对部\n分听唱薄弱环节加强专项训练，多做反复练习。相信凭借这份热爱和努力，你会在音乐道路上走得更远、更稳，最终将热"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "周禾雨本学期的体育课里总是努力完成每一次接盘，可以在比赛里完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "本学期 Lily 在校园里给我的感觉是越来越自如、舒展了。从你提交的规划和面谈表现来看，你对未来的勾勒已然从抽象变\n得具象。这种笃定，带出了更多表演上的自信与表达欲。作为音乐生，你不仅圆满完成了本学期的专业考核，在 PA 任务\n里对自我的深挖也精准而细腻。相信今年这个关键转折点会为你带来质的飞跃，非常期待你接下来的作品集产出，让我们"
      }
    ],
    "academicStrength": "Excels in 荣誉统计学 I and 2 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "奚梓嘉",
    "name": "奚梓嘉 Carrie Xi",
    "chineseName": "奚梓嘉",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "陈⽴俊 Jason Chen",
    "gpa": 4.2444444444,
    "photo": "/photos/奚梓嘉-Johnny.jpg",
    "strengths": [
      "One Schoolhouse: AP Statistics I",
      "English Advanced 2（B2+）",
      "荣誉中国研究"
    ],
    "weaknesses": [
      "English Advanced 2（B2+）",
      "未来规划 III"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提升英语⽔平，雅思⼩分提升 \t基本达成\n ⼩分到6.5，总分保持7.0或者冲7.5\n\n1. 每周做2-3篇雅思阅读和听⼒，保持语感，稳住⽬前的分数\n2. 写作每周练2-3篇⼤作⽂，并且复习⼀些写作的词汇和句法\n3. ⼝语每周练5个话题左右，可以积累⼀些题⽬的回答内容\n 校内成绩维持，4及以上 \t未达成\n\n1. 校内三门CL课程：微积分、⼼理学、经济。认真完成每⼀项作业和任务，有不会的问题就及时提问。\n2. One Schoolhouse按时进展，认真对待线上学习\n3. 英语及其他学科定期复习，也是要认真对待\n4. CL课程有学不会的内容要及时补课，防⽌有知识点疏忽",
      "selfReflection": "在步⼊⾼⼆的第⼀学期，从⼀开始的全部必修课，到这学期新学了很多CL课程，整体的课程难度都明显升⾼了许多，平\n时的学习⽣活也愈加充实和忙碌。但是，我依旧合理的安排了时间，按时并⾼质量的完成了⼏乎每⼀个任务。在这学期\n中，我在学习CL课程中遇到的最⼤的困难就是上课听不懂，题⽬不会做。但是在跟相应的任课⽼师沟通后，改变了⼀下\n本来死板并有些错误的学习⽅法，不再⼀味地抄笔记。在期中考试过后，巩固了很多之前的知识点，为期末考试前分担⼀\n些压⼒。\n当然，我也参加了⼀些竞赛⽐如HiMcM和NEC的⽐赛。HiMcM的竞赛那两周刚好撞上期中考试，压⼒⾮常⼤，但是和同\n学之间分配好了任务，周末⼀起花费时间完成了论⽂，不仅没有耽误期中考试，在截⽌⽇期前也提交了⼀篇完整的学术论\n⽂。⽽NEC的竞赛⼜涉及到了我还没学到的微观经济的知识，也是⾮常具有挑战性的，还好的是最后也是取得了⼀个挺不\n错的⽐赛成绩，也继续在为后续⽐赛做相应的准备。接下来⼀学期，将会有更多的课外活动和校内学业压⼒需要⾯对，希\n望⾃⼰能够合理规划好时间和精⼒，按部就班的完成每⼀个任务，并做到最好。",
      "tutorComment": "亲爱的Carrie,\n作为你的班主任和新任导师，我很荣幸能见证并参与你⾼中阶段的成长。你展现出的学术能⼒、⽬标感和⾏动⼒令我印象\n深刻。⽆论是应对CL课程挑战时的积极调整，还是在HiMcM、NEC等竞赛中与团队⾼效协作、迎难⽽上的表现，都证明\n你不仅善于规划时间，更具备将压⼒转化为动⼒的成熟⼼态。你⽗母所说的“清晰做出⾃⼰想要的抉择，不怕畏惧，迎难\n⽽上”，正是对你品格最贴切的描述。\n在学术⽅⾯，你对⾃⼰的认知⾮常清晰——善于研究、重视数据、追求严谨，这⼀点在你对Inquiry与Research-Based\nArgumentation两项核⼼能⼒的理解与实践中有充分体现。你不仅是⾼效的学习者，更是具备初步学术素养的探索者。\n成长是⼀个不断⾃我完善的过程。在全⼒以赴奔向⽬标的同时，不妨偶尔放缓脚步，留意⾝边⼈的节奏与感受。优秀的领\n导者与团队成员，不仅懂得驱动⾃⼰，也懂得凝聚他⼈。你已拥有⾜够的⼒量去影响世界，⽽细腻的同理⼼与协作中的温\n度，会让这份⼒量更加完整、更具感染⼒。\n期待你在接下来的⼀学期中，继续保持着这份专注与热情，⾛向更⼴阔的舞台。⽆论前⽅还有什么挑战，相信你都能步伐\n坚定、⼼怀温暖地⾯对。\n陈⽴俊Jason Chen",
      "selfReflectionSummary": "这学期新学了很多CL课程，整体的课程难度都明显升⾼了许多，平 时的学习⽣活也愈加充实和忙碌。",
      "tutorCommentSummary": "期待你在接下来的⼀学期中，继续保持着这份专注与热情，⾛向更⼴阔的舞台。"
    },
    "futureDirection": "经济学",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "梓嘉，你身上有一种举重若轻的从容。戏剧展演中，你在后台将PPT、音效与灯光控制得井井有条，这种沉稳细致的执行\n能力是团队不可或缺的支撑。课堂和作业方面，你大多能认真对待，表现出良好的潜力。偶尔的说话嬉戏或作业质量未达\n最佳，或许是因为尚未完全激发内心的追求。马上高三了，是时候将这份潜力转化为稳定卓越的表现了。建议你设定明确\n的学习目标，在文本分析上更注重逻辑的层层递进，在写作上更锤炼语言的精准与优美。你完全有能力做得更出色，请相"
      },
      {
        "name": "大学微积分 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Carrie has met expectations this semester, although her grasp of the material varies by topic. She exhibits robust logical \nreasoning and abstraction capabilities, often reacting swiftly to new ideas during discussions. However, this rapid \nprocessing sometimes compromises depth; her performance wou"
      },
      {
        "name": "One Schoolhouse: AP Statistics I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Carrie has demonstrated consistent commitment to her first online course, successfully managing the rigor of AP \nStatistics alongside her in-person curriculum. She shows a strong ability to articulate statistical reasoning, particularly \nwithin Free Response Questions (FRQs) where she applies deep c"
      },
      {
        "name": "English Advanced 2（B2+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Carrie is consistently attentive in class and shows a genuine desire to learn and improve. She completes written work \nand in-class exercises carefully, attentively, and with a solid level of English ability, often demonstrating structured \nthinking and an acceptable grasp of grammar and vocabulary."
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Carrie demonstrated solid proficiency and thoughtful engagement. \nHer focus on how Douyin users perceive recommendation algorithms in regulating emotions and their psychological \nimpacts showed commendable insight into algorithmic influence. She ha"
      },
      {
        "name": "大学心理学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "I truly admire your diligent attitude and the respect you show for the subject. I know you care deeply about your \nperformance, and it can be frustrating when grades don't reflect your effort. I believe the key for you is to shift from \n\"recording\" the lecture to \"wrestling\" with it. Don't just wait"
      },
      {
        "name": "大学经济学 I",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "Carrie, you possess a rare combination of natural \"spirit\" for economics and an incredible work ethic. Throughout your \njourney preparing for the NEC (National Economics Challenge), I have witnessed firsthand your persistence and \ndedication, particularly in your essay work, which was truly brillian"
      },
      {
        "name": "体育：综合格斗",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "奚梓嘉同学在课堂中态度友好，能够配合教师完成练习，对新内容接受度尚可。但由于出勤不够稳定，部分训练内容缺乏\n系统练习，影响了整体进步节奏。建议多多参与课堂练习，尽量少在场边休息哦。"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Carrie 本学期的表现远超预期。面对 AP 报名阶段的心理波动，你展现了极强的自我调节能力，通过数学、经济学术竞赛\n并行及写作冬校的一系列具体产出，迅速回归学术正轨。在同时修读四门大学难度课程且兼顾夏校申请的高压下，你不仅\n维持了高效的产出，更建立起了一种良性的执行力惯性。这种“快节奏、高饱和”的状态是你学术自信的源泉，2026年我们"
      }
    ],
    "academicStrength": "Excels in One Schoolhouse: AP Statistics I and 6 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "孙启涵",
    "name": "孙启涵 Peter Sun",
    "chineseName": "孙启涵",
    "className": "⼗⼀年级问源班",
    "tutorName": "Chen Zhixiu",
    "gpa": 3.1222222222,
    "photo": "/photos/孙启涵-X.jpg",
    "strengths": [
      "体育：足球",
      "未来规划 III"
    ],
    "weaknesses": [
      "大学经济学 I"
    ],
    "activities": [
      "⚽ Football",
      "🎭 Musical/Drama",
      "🎤 Debate",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": "Not available",
      "selfReflection": "这个学期的我变得更加的成熟，很好掌握了⾮暴⼒沟通的能⼒，在踢球的时候不会只⼀味的压⼒队友和上头，在家庭中发\n⽣争执也会选择最优解去处理问题，同时经过各种事情的磨练我从⼀开始⽆知莽撞懵懂的⼩孩⼦慢慢成长为了⼤⼈。在之\n后我希望我能⾛出⼀些事情的阴影去找到⾃⼰不要再低沉在⾕底了，该为⾃⼰的未来拼⼀拼了。",
      "tutorComment": "孙启涵同学：\n这学期仿佛按下了快进键，不知道你⾃⼰复盘时，觉得哪⽅⾯的“技能点”加得最多？⼜有哪些关卡还在摸索、适应阶段？\n在学业上，标化成绩的进度条⾛得着实有点慢。语⾔这东西没法靠“临时抱佛脚”，它是⼀项需要长期积累的技能。光靠校\n内的课时肯定是不够的，你得在⽇常多⽤多练。⽽且英语不仅是⼤学申请的“敲门砖”，更是你解锁其他⾼阶课程的钥匙，\n所以不要让它限制你的发挥，必须想办法突破。⾄于校内学业，⽬前这种“不上不下”的舒适区其实相当危险。我觉得以你\n的头脑，不应该满⾜于达到最基本的学术要求。试着把对⾃⼰的要求再调⾼⼀档，多努⼒⼀把，肯定会有所收获。\n校园⽣活⽅⾯，你的常规表现⼀直很稳。最让我印象深刻的是你在运动场上的风采——每周三的⾜球雷打不动，橄榄球赛\n也从不缺席，在场上全⼒拼搏的样⼦确实很帅⽓！有时候我忍不住想，如果你能把这份劲头分出⼀半给学习，那成绩绝对\n突飞猛进。另外，唯⼀的⼩建议是，如果能在电⼦产品的使⽤上再多⼀点⾃制⼒，战胜屏幕的诱惑，那你的状态必然会有\n所提升。\n为⼈处事上，能明显感觉到你变得成熟低调了，不再像以前那样容易“上头”了。⾃从上次的⼩插曲后，你确实听进了劝，\n变得安分稳重了许多。特别值得点赞的是，你现在说话的⽅式收敛了，⽤词也⽂明了不少，这种变化⼤家都是看在眼⾥\n的。继续保持这份从容，你必然会结交到更多志同道合的伙伴们。\n个⼈成⻓\n100.00%\n作业提交率\n97.03%\n作业准时提交率\n1\n⾃主性评级\n109.0\n凌云积分",
      "selfReflectionSummary": "我变得更加的成熟，很好掌握了⾮暴⼒沟通的能⼒，在踢球的时候不会只⼀味的压⼒队友和上头，在家庭中发 ⽣争执也会选择最优解去处理问题，同时经过各种事情的磨练我从⼀开始⽆知莽撞懵懂的⼩孩⼦慢慢成长为了⼤⼈。",
      "tutorCommentSummary": "这学期仿佛按下了快进键，不知道你⾃⼰复盘时，觉得哪⽅⾯的“技能点”加得最多？⼜有哪些关卡还在摸索、适应阶段？ 在学业上，标化成绩的进度条⾛得着实有点慢。"
    },
    "futureDirection": "经济学",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "本学期的语文学习，你展现了一位思辨者清晰有力的风范。你不仅拥有独立的判断和逻辑能力，更能以富有感染力的方式\n表达复杂观点，展现出批判精神。你的核心优势在于卓越的思辨力与表达力。 你善于独立思考，不盲从于既有结论；你\n具备出色的辩论能力，你在剧本创作中的构思，敏锐地抓住了 《红楼梦》中“贾宝玉对科举功名（即传统规定成功路径）\n的抗拒与挣扎” 这一核心矛盾，并将其创造性地投射到当代高中生“李一凡”所面临的、被社会与家庭所定义的“成功之路”的\n压迫感上。期待你在课堂讨论中更积极、更主动地参与。 课堂是思想碰撞、彼此激发的熔炉。你缜密的逻辑、锋利的观"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Dear Peter,\nI truly appreciate your consistent focus in class and your diligence in submitting assignments on time. While your effort \nis clear, the accuracy of your homework suggests that some of the more complex statistical concepts are still a bit \nconfusing. To improve, I suggest creating a visu"
      },
      {
        "name": "English Intermediate 3（B1+）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Peter, it has been a pleasure to see the clear improvements you've made this term. Most notably, your speech has \nbecome more fluent and confident—you are expressing your ideas with greater ease, and it's wonderful to witness. This \ngrowth is a direct result of your consistent effort.\nTo build on th"
      },
      {
        "name": "积极倾听与主动回应",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你本学期学习表现稳定，听说读写各方面都有优良表现，作业完成认真。对自己要求很严格，期中与期末考试成绩良好，\n反映出你日语基础打得很好自己也一直在努力。上课时认真听讲，大声回答问题，对自己有兴趣的足球相关部分会自己查\n证，建议继续保持现在的学习习惯，听力部分可以听一些简单的日文歌曲，使自己在日语的听说方面再加以提高。"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Peter demonstrated solid achievement. His addressing of \ngovernance of inter-platform video porting chaos and its effects targeted a pressing digital issue. He handled the \nliterature review competently, effectively covering regulations and impacts"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "在这一学期的荣誉心理学课上，我很高兴看到你最明显的变化——那就是你终于克服了课上困倦的习惯，状态比开学初期\n振作了许多。能够从“瞌睡”的状态调整到愿意积极参与课堂，这本身就是一种态度的进步。不过，心理学是一门需要深挖\n的学科，目前你对知识的掌握还停留在比较表层的阶段，往往满足于“知道”，而没有去思考“为什么”。我希望在接下来的\n学习中，你不仅能保持这种清醒的课堂状态，更能试着沉下心来，对每一个知识点进行更深入的探究，不要只满足于浅尝\n辄止。只要你愿意在“钻研”上再多花一点功夫，你的成绩一定会有更大幅度的跨越。"
      },
      {
        "name": "大学经济学 I",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "Peter, your current performance doesn't reflect what you are truly capable of. While you have the ability to succeed, your \nfrequent distractions during class have made it difficult for you to stay on track, resulting in a lower accuracy rate on your \nassignments and tests. To see the results you wa"
      },
      {
        "name": "体育：足球",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Peter has performed  well in every of all drills that we set up. His coordination and conduction of the ball both are quite \ngood but he still needs to improve the accuracy on  passing the ball. Peter has good physical capacity and endurance, \nand he has demonstrated this in fitness exercises. He ne"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期 Peter 在未来规划上的产出，完全超出了我的预期。无论是课前“小金人”的惊艳，还是为大学代言时的那份投入，\n尤其是三方面谈时你气场全开、逻辑清晰的输出，都让我看到了你身上的潜力。在规划这条赛道上，你不仅懂玩法、看路\n径，更有明确的靶心。接下来的关键，就是将这份“懂”转化为更硬核的申请元素，全方位打磨国际生竞争力。非常期待"
      }
    ],
    "academicStrength": "Excels in 体育：足球 and 1 other course(s)",
    "academicWeakness": "Needs improvement in 大学经济学 I"
  },
  {
    "id": "孙昊宇",
    "name": "孙昊宇 Harry Sun",
    "chineseName": "孙昊宇",
    "className": "⼗⼀年级问源班",
    "tutorName": "Chen Zhixiu",
    "gpa": 1.2666666667,
    "photo": "/photos/孙昊宇-X.jpg",
    "strengths": [
      "Academic Excellence",
      "Leadership",
      "Creativity",
      "Analytical Thinking"
    ],
    "weaknesses": [
      "语文 III",
      "荣誉预备微积分 I",
      "English Intermediate 2（B1）"
    ],
    "activities": [
      "🏀 Basketball",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 成长⽬标\n 拿到较⾼的标化成绩，雅思超过6.0\n 利⽤时间去完成作业，并保证作业和标化考试不会出问题",
      "selfReflection": "Not available",
      "tutorComment": "孙昊宇同学：\n回顾本学期，你并⾮停滞不前，只是⽬前的步伐稍显缓慢。希望你能明⽩，回避问题并不能带来真正的轻松，唯有勇敢直\n⾯挑战，才能迎来成长的转机。\n在学业上，你的标化成绩暂未突破，校内英语投⼊也需加强。距离基本升学门槛尚有⼀段距离，这个寒假是你弯道超车的\n关键期。我建议你尽可能减少电⼦娱乐，集中精⼒攻克语⾔难关。校内课业虽较去年有⼩幅度提⾼，但仍有很⼤的进步空\n间。课堂专注度和作业质量是学习的基⽯，切勿因⼀时想偷懒⽽对⽇常作业敷衍了事，也不要因为畏难情绪⽽拖拉项⽬，\n浪费了你良好的资质。建议你借助客观、专业的⼯具建⽴更清晰的⾃我认知，少找理由，多找⽅法。不必好⾼骛远，只需\n脚踏实地，将⼿头的每⼀项任务落实到位，进步⾃然⽔到渠成。\n校园⽣活⽅⾯，你的⽇常⾏为规范总体良好。需要提醒你的是注意电⼦产品的合理使⽤，避免其对你的⾝⼼造成不良影响\n或负担。建议你尝试培养⼀项有益⾝⼼的兴趣爱好，或积极投⾝社团活动，通过贡献⾃⼰的⼒量来增强在集体中的参与感\n与归属感。\n为⼈处事上，独处或许是你已经习惯的⽅式，但这并不代表你⽆法融⼊集体。你可以尝试主动与同学接触，哪怕⼀开始只\n是静⼼聆听，这也是⼀种不错的互动⽅式。不要急于表达，⽇久见⼈⼼，相信你的善良与真诚，终会获得⼤家的认可。\n个⼈成⻓\n99.53%\n作业提交率\n82.63%\n作业准时提交率\n1\n⾃主性评级\n1 | tier2\n违纪情况\n1 | tier3\n违纪情况\n80.0\n凌云积分",
      "selfReflectionSummary": null,
      "tutorCommentSummary": "希望你能明⽩，回避问题并不能带来真正的轻松，唯有勇敢直 ⾯挑战，才能迎来成长的转机。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "我看到你内心怀有提升的愿望，并在最终的创作任务中展现出一定的叙事才能，这证明了你的潜力。在你提交的剧本中，\n你展现出了对日常生活细节的敏锐捕捉和生动的对话撰写能力。你描绘的“王奶奶”形象——一位不适应城市规则、言语质\n朴直率的老人——非常鲜活，其与高档餐厅环境的冲突，以及家庭内部的微妙张力，都刻画得真实可信，显示出你对人情\n世故的观察力和一定的编剧潜力。你的剧本片段像一颗种子，证明土壤里确有生命的可能。但现在，你需要为这颗种子提\n供它生长所必需的水分、阳光和持续的照料。 这需要你立刻在行动上做出坚决的改变：从“提交每一次作业”这一最低也是"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Harry’s overall performance is rated as \"Growing.\" A notable concern is his \"F\" in the note-taking dimension, which may \nbe due to absence, non-submission, or severely substandard quality, greatly hindering his ability to construct a \nknowledge framework. Although his homework and project performanc"
      },
      {
        "name": "English Intermediate 2（B1）",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Dear Harry, generally speaking, your performance for this semester is inadequate. You are a student with lots of \npotential, yet you failed to unlock it due to your very limited motivation. For the second half the semester, you showed \nmore willingness to learn and participate and you even printed v"
      },
      {
        "name": "荣誉中国研究",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Throughout the G11 China Study field investigation, Harry demonstrated emerging skills, laying groundwork for future \ngrowth. His topic explored basic media aspects. He handled the literature review by introducing ideas. Harry’s fieldwork \nplanning sketched outlines with ethical consideration, and h"
      },
      {
        "name": "大学人文地理 I",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Hello Harry. It was a pleasure having you in our CL human geography course. I appreciate your consistent presence in \nour lesson, however, I can see you frequently struggled to follow instructions and remain focused during class. \nCompleting assigned tasks may be a significant challenge and English "
      },
      {
        "name": "大学商业研究 I",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Harry has faced significant challenges this semester in adapting to the dynamic, collaborative nature of the class. It was \nencouraging to see peers initially reach out to include him, though sustaining that group dynamic proved difficult. The \nfinal project submission was unfortunately incomplete. "
      },
      {
        "name": "荣誉生命科学 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "这一学期，你在生命科学课上的参与度还有待提高。频繁的走神和作业的缺失，已经明显影响了你对知识点的掌握，导致\n成绩不理想。荣誉课程的学习强度较大，如果不能保证基础的作业练习和课堂专注力，差距会越来越大。老师希望你能反\n思一下目前的学习态度，下学期把心思带回课堂。希望在新的学期里，能看到一个更自律、更积极的你。"
      },
      {
        "name": "体育：篮球",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "You are a very special child. You have a relatively calm personality. Whenever you encounter a problem, you always \nhave your own unique insights. You can always remain silent and work hard in silence. Although you are calm and \nintroverted, you can also talk freely when the topic is interesting. Yo"
      },
      {
        "name": "未来规划 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Harry，这一学期，你们正式进入了大学申请准备的起步阶段。在未来规划课上，你完成了选校维度的梳理，设计了属于\n自己的梦校海报，初步产出了课外活动清单初步描写，并制作了个人简历。这些任务不只是作业本身，更是一次次对自我\n认知与未来方向的深入思考。\n你的学习之路依然走得不算轻松。虽然成绩上有了一点点进步，但整体仍处在需要重点突破的阶段，尤其是英语基础，目\n前对你来说依然是一个不小的挑战。\n有时你会沉浸在电脑世界里，也较少表达自己的想法，期待你从被动应付转向主动规划，一步一步推进改变，事情就会慢\n慢不同。哪怕每天只进步一点点，只要开始行动，就是在走向更好的自己。\n你有想法、有潜力，最重要的是找到节"
      }
    ],
    "academicStrength": null,
    "academicWeakness": "Needs improvement in 语文 III and 7 other course(s)"
  },
  {
    "id": "安真奂",
    "name": "安真奂 Elsa An",
    "chineseName": "安真奂",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "钱寒轩 Hanhsuan",
    "gpa": 3.7666666667,
    "photo": "/photos/安真奂-J.jpg",
    "strengths": [
      "荣誉统计学 I",
      "English Intermediate 3（B1+）",
      "英语词汇强化"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": "Not available",
      "selfReflection": "这学期像⼀⾯特别的镜⼦，让我看见了⾃⼰更清晰的轮廓。镜中的⾝影，由不同的光影交织——那是伏案钻研的专注，是\n运动场上的汗⽔，也是舞蹈房⾥的引领。回望这段旅程，我发现⾃⼰正以⼀种更主动、更坚定的姿态，尝试定义属于⾃⼰\n的形状。\n⾸先，是探索知识边界的形状。为了准备托福考试，我选择了⼀条并⾮最轻松的⾃学之路。它教会我的远不⽌语⾔本⾝：\n我学会了如何将宏⼤的⽬标分解为每⽇可控的任务清单，如何甄别海量⽹络资源的优劣，如何在与遗忘曲线的⽃争中科学\n规划复习节奏。当我第⼀次完整分析出长难句的复杂结构，或是在听⼒中清晰捕捉到连读的每个⾳节时，那种透过⽅法论\n穿透知识壁垒的顿悟感，让我确信，掌握⾃我驱动的学习能⼒，是⽐任何单项⾼分都更为珍贵的礼物。这过程塑造了我思\n维的筋⾻——更⾃律，也更缜密。\n与此同时，我努⼒保持⾝体这⼀“⾰命本钱”的蓬勃活⼒。我坚信，持续的体育锻炼是对意志最诚实的磨砺。⽆论课业压⼒\n如何，每周固定的跑步与⼒量训练从未间断。我在晨跑中迎接过⽆数个清晨，看天⾊由黛青转为明亮；也在疲惫的傍晚⽤\n⼀场酣畅淋漓的运动重新唤醒精神。这份坚持赠予我的，不仅是良好的体魄与充沛的精⼒，更是⼀种稳定的节奏感。它让\n我明⽩，⾝体与精神犹如双翼，只有协调振动，才能飞得更稳、更远。\n⽽最让我感到责任与成长并存的，是在舞蹈社的⾓⾊转变。从⼀名热爱舞蹈的队员到被推选为社长，我需要考虑的不再只\n是⾃⼰的动作是否标准。我组织招新，设计团建活动以凝聚社团；为了筹备校园艺术节的节⽬，我与⾻⼲们⼀起头脑风暴\n主题、筛选⾳乐、编排动作，并协调所有⼈的排练时间。当看到零基础的社员从⼿⾜⽆措到在舞台上⾃信绽放，当我们的\n作品收获热烈掌声，我深切体会到，领导⼒并⾮发号施令，⽽是服务、协调与点燃他⼈的热情。舞蹈社成了我实践合作、\n承担责任、创造美好的另⼀⽚天地。\n学期将尽，镜中的影像已悄然变化。那个曾被动接受安排的学⽣，如今正尝试⽤⾃⼰的双⼿去规划学业、强健⾝体、带领\n团队。我眼中的⾃⼰，或许尚显青涩，但内核已在挑战中变得更具韧性。这学期的每⼀份努⼒，都像⼀块拼图，让我的⼈\n⽣图景更为丰富⽴体。我知道，成长未有穷期，⽽我，正怀着更⼤的好奇与勇⽓，准备描绘下⼀章的⾃⼰。",
      "tutorComment": "真奂，这学期，我注意到你勇敢地选择了⾃⼰真正感兴趣的课程。这份敢于追随内⼼、不随波逐流的勇⽓，值得钦佩。在\n探索的过程中，你慢慢找到了学习的⽅向，也开始有了属于⾃⼰的节奏和感觉——这本⾝就是⼀种重要的成长。\n成绩固然重要，但不必急于⼀时。真正的理解与积累往往需要时间沉淀，⽽你已经⾛在了正确的路上。同时，看到你⾝边\n有了可以谈⼼、互相⽀持的朋友，我也由衷为你⾼兴。你待⼈真诚、⼼怀善意，这份品质终会被看见、被回应——善⼼以\n待，⾃然也会被善待。\n接下来的⽇⼦⾥，希望你在学业上能“脸⽪厚⼀点”：遇到不懂的问题，⼤胆去问；看到有⽤的资源，主动去争取。⽼师们\n⼀直都在，愿意为你解答疑惑、提供帮助，关键是你得愿意开⼝、愿意尝试。坚持你认定的⽅向，别怕⾛慢⼀点，只要不\n停下脚步，就⼀定会离⽬标更近。",
      "selfReflectionSummary": "这学期像⼀⾯特别的镜⼦，让我看见了⾃⼰更清晰的轮廓。",
      "tutorCommentSummary": "这学期，我注意到你勇敢地选择了⾃⼰真正感兴趣的课程。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "真奂，你本学期的语文学习像一首起伏有致的乐章。前半学期，课堂上你专注聆听、积极互动的身影令人印象深刻；后半\n学期状态的微妙波动，或许折射出高二学段的压力与挑战。可贵的是，你在戏剧展演中依然展现了不错的个人表现力，只\n是台词记忆的稳定性提醒我们：语文素养的基石在于日常扎实的积累——无论是经典文本的细读，还是语言表达的精确打\n磨。作业能及时完成，但质量尚有提升空间，这恰是你下阶段可着力之处：不必追求篇幅，但求每道题、每篇习作都成为\n一次思维的深耕。望你重拾初心的专注，让语文成为你应对压力的精神田园与表达利器！"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hi Elsa,\nYou have demonstrated an excellent grasp of our honor statistics material this semester. Your focused attention during \nlectures and the consistently high quality of your homework assignments show a commendable level of dedication. You \nhave clearly mastered the technical aspects of data ex"
      },
      {
        "name": "English Intermediate 3（B1+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Excellent work this term, Elsa. Your writing is a true strength; your essays are well-structured, your grammar is accurate, \nand you use a sophisticated vocabulary for this level. It's clear you have a strong understanding of the language.\nTo reach the next level, the key focus is on building confid"
      },
      {
        "name": "英语词汇强化",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Elsa is a well-behaved, outgoing, and confident student with a good instinct for English. She communicates comfortably \nin familiar situations, but her listening skills need further development, especially when facing more challenging topics. \nShe would also benefit from speaking more frequently in "
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Elsa demonstrated strong engagement and academic confidence. \nHer exploration of how “wellness” videos drive influencer visibility and product consumption was relevant and \nthoughtfully framed, reflecting a clear awareness of contemporary digital c"
      },
      {
        "name": "大学生物 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Elsa is a kind and positive student who always carries herself with a warm smile. She demonstrates good learning \nattitudes and growing potential. I encourage her to ask questions whenever she feels unsure—she is always welcome to \nseek support. With increased confidence and engagement, she can make"
      },
      {
        "name": "大学化学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Elsa is fortunate to have already discovered her true passion and future goal: the study of marine creatures. Identifying \nthis clear direction is a significant advantage. However, ambition must be matched by execution. Currently, her actions \ndo not always reflect the depth of her interest. To turn"
      },
      {
        "name": "体育：飞盘",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "安真奂在本学期的体育课里展现出了很好的理解能力，可以在比赛里充分沟通进攻空间完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期的未来规划课程主要聚焦深入大学申请全面评估政策、构建大学申请长名单、筹备申请材料。在第一单元里，你能\n紧跟老师的节奏，盘点当下的校内学术情况、制定托福考试时间线和备考计划，通过模拟招生官活动深入理解校内学术在\n申请中的重要性。在第二单元里，你向内梳理了符合自己价值观的选校标准（专业强、社团活动多、小班授课、交通便利\n等），并同时通过多场大学展、搜索Cialfo数据库、参与校友返校日等途径进一步探索了美国、加拿大、澳大利亚的大学。\n在第三单元里，你初步浮现了14个课外活动清单，制作了个人简历，并提炼了你的申请形象。正如我们在三方面谈中提到\n的，寒假托福冲80为夏校申请做准备，下学期Caps"
      }
    ],
    "academicStrength": "Excels in 荣誉统计学 I and 4 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "尹锦杰",
    "name": "尹锦杰 Oscar Yin",
    "chineseName": "尹锦杰",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "李婷婷 Tingting",
    "gpa": 2.8,
    "photo": "/photos/尹锦杰-E.jpg",
    "strengths": [
      "荣誉生命科学 I"
    ],
    "weaknesses": [
      "语文 III",
      "荣誉商科 I"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🎤 Debate",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 雅思4.5 \t基本达成\n ⼯作⽇每天背单词⾄少5个\n 平均成绩2及以上（理科⾼⼀点），语⽂不要F \t基本达成\n 上课认真听，作业不逾期",
      "selfReflection": "感觉没什么特别的变化，还是和上学期差不多",
      "tutorComment": "本学期你还有变化的，即使是⼩⼩的进步，也是改变的信号，虽然你⾃⼰在反思中觉得“没什么特别变化”，但妈妈却敏锐\n地捕捉到了你那⼀瞬间的长⼤——你开始认真思考热爱的价值、学业的⽅向以及未来的职业。正如妈妈所说，对未来的确\n定性进⾏多维度的思考，是你承担责任、真正长⼤的印记。学科⽼师也发现你与学期初的不同，同伴们也视你为理科⼭巅\n上的“⾼⼿”，这种幽默与⾃信是你在群体中的独特标签。\n你是⼀个拥有巨⼤潜能的宝藏少年。下学期，我希望看到你：\n不论是与⽼师还是同学交流，能更勇敢地输出你的想法，让你的智慧被更多⼈看见；进⼀步优化时间分配，在学习、休息\n与你擅长的娱乐（如游戏）之间找到更⾼效率的平衡点；告别“舒适区”⾥的轻松，去钻研那些看似“枯燥”但深刻的逻辑。\n“⼤胆去奔赴你的热爱吧，不必惧于试错。” 愿你带着这份敏锐与智慧，在下学期书写更精彩的篇章！",
      "selfReflectionSummary": "感觉没什么特别的变化，还是和上学期差不多。",
      "tutorCommentSummary": "你还有变化的，即使是⼩⼩的进步，也是改变的信号，虽然你⾃⼰在反思中觉得“没什么特别变化”，但妈妈却敏锐 地捕捉到了你那⼀瞬间的长⼤——你开始认真思考热爱的价值、学业的⽅向以及未来的职业。"
    },
    "futureDirection": "商科",
    "courses": [
      {
        "name": "语文 III",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "尹锦杰同学本学期的学习状态呈现出明显的阶段性变化，上学期虽有波动，但在期中前学习投入度逐步提升，取得\n了明显进步，在作业提交和考试成绩上均有体现，值得肯定。在《红楼梦》戏剧创排中，他表现尤为亮眼，展现出课堂之\n外的另一面：台词准备认真，人物性格把握准确，能够主动与同学配合排练，最终成功完成角色塑造与舞台呈现。这一过\n程充分说明，他具备良好的理解能力、执行力与持续投入的潜质。         \n        希望你能够更加清晰地看到自己在努力过程中的真实成长，对自身能力建立稳定而坚定的信心。接下来，建议你及\n时调整学习节奏，保持作业与复习的持续性，在阅读与写作中夯实基础能力。同时，也要将戏剧项"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Dear Oscar,\nI appreciate your consistent focus during our lessons and your reliability in turning in your work on time. While your \ndiligence is excellent, I’ve noticed that some assignments reflect a misunderstanding of the core statistical theories. \nBefore starting your homework, I encourage you "
      },
      {
        "name": "English Elementary 2（A2）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Oscar showed a positive change throughout the semester. In the first lessons, he could understand the main idea in \nlistening, though he missed some details and was slow in sentence-writing tasks. He did not always prepare for \ndictation, and his focus and note-taking needed improvement at the begin"
      },
      {
        "name": "英语语法强化",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Oscar, you are a student with lots of potential, yet you seem to have a habit of undermining yourself. You see new \nconcepts as uninteresting, therefore you try not to let them occupy too much of your thoughts. This mindset has stop \nyou from progressing significantly and I wish you could change tha"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hello Oscar. It was a pleasure having you in China Study this semester. While you often stay in the background during \nclass activities, I caught a glimpse of your potential during our discussion on the originality debate of AI. However, I have \nseen how you remain largely passive during most other "
      },
      {
        "name": "荣誉商科 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Oscar has tended to be passive in class this semester, often struggling with distractions when technology is in use. \nWhile he has shown creativity in leveraging AI for projects, producing some quality outputs, his overall effort in and out \nof class needs improvement. I encourage him to apply the s"
      },
      {
        "name": "荣誉生命科学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你是一个在学习上非常有灵气的学生，课堂上的反馈非常及时，对知识点的把握也很精准，这让你在学科评估中取得了不\n错的成绩。不过，目前的优秀对你来说似乎有些过于轻松了，你还没有真正挑战自己的上限。生命科学是一门极其缜密的\n学科，容不得半点疏忽。建议你以后在处理复杂问题时能再沉稳一些，多去推敲学术表述中的细节。期待下学期能看到一\n个更加精益求精、对待学问更加严谨的你。"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "尹锦杰在本学期的体育课里总是努力完成每一次接盘，可以在比赛里完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Oscar，这学期的三方面谈我们一起把目标设定和准备都理清楚了，做得很不错。你要记住，校内的表现和英语能力对于\n你的申请至关重要。希望你在上课的时候能再多一些投入，把平时积累的每一步都打得更扎实，这样整体准备会更稳、更\n有力量"
      }
    ],
    "academicStrength": "Excels in 荣誉生命科学 I",
    "academicWeakness": "Needs improvement in 语文 III and 1 other course(s)"
  },
  {
    "id": "庄舒媛",
    "name": "庄舒媛 Sue Zhuang",
    "chineseName": "庄舒媛",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "陈⽴俊 Jason Chen",
    "gpa": 3.9333333333,
    "photo": null,
    "strengths": [
      "语文 III",
      "荣誉预备微积分 I",
      "English Advanced 2（B2+）"
    ],
    "weaknesses": [
      "English Advanced 2（B2+）",
      "大学计算机科学原理 I",
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🎨 Crafts",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提⾼托福标化分数\n 把听⼒和阅读的⼩分都到20以上，写作⼝语22以上\n\n1.利⽤晚⾃习时间，做⼀休⼀的时间表，每隔⼀天晚⾃习进⾏1.5h的托福听⼒和阅读练习\n2.休息⽇进⾏每⽇两篇TED视频听⼒\n3.碎⽚化时间进⾏阅读词汇整理\n4.校内pioneers⼀边锻炼⾃⼰的⼝语\n5.多阅读范⽂⽂章，思考争议性题⽬，对其进⾏分析（对表托福写作）",
      "selfReflection": "今年我觉得这学期最⼤的不同就是真正的进⼊到了⼀个全新的课程⾥⾯，然后同时呢我在期中也升到了A3，这让我拥有\n了更多的学习时间和⾃主安排的时间。当然在今年的这个学期我们也都参加了特别多的活动，像是南⽠节圣诞还有新年\n碗，每⼀个活动和体验都让我影响⼗分之深刻。但是呢这个学期的时间实在是有点长，所以很多上学的时候还觉得其实蛮\n累的，⽐如就像是在做中国研究这门学科的时候，我们需要特别多的时间和精⼒去收集他的资料，然后再把它变成论⽂，\n这种断断续续的直到完成已经⽤了⼤概有三个⽉了，但是场不同科⽬的学习之后呢，我就发现其实有些知识还是蛮有意思\n的，只是只要多花时间去理解运⽤。然后其实在开学之前，我觉得这个学期我应该还是⽐较多时间就是可以做⾃⼰的事\n情，但是实际上学业还是很繁忙的。也更多的让我感觉到要合理分配⾃⼰的时间和任务，这样才能在接下来⾯对下学期的\n复习和学习能有更好的收获。",
      "tutorComment": "亲爱的舒媛，\n我记得在 2025 年年末，我送给你⼀个词——“丰盈”。这个导师的话⾥，我想再和你认真谈⼀谈它。\n我由衷地希望你始终⼼⾥有深度，眼⾥有世界。\n你待⼈有礼，⾏事知分⼨；在学业上持续向前，⾯对困难从不回避；在集体中踏实、稳定，是⼀个让⼈放⼼的存在。这些\n品质并不张扬，却极其珍贵，也将长久地⽀持你⾛向更远的地⽅。\n接下来的⾼⼆下学期与寒假，是⼀个珍贵的⽣长窗⼝。希望你有意识地多与有经验的成年⼈交流，倾听他们⾛过的路、作\n出的选择、承担过的代价。很多重要的成长，并不来⾃独⾃琢磨，⽽来⾃⼀次次真诚⽽清醒的对话。\n愿你在不断与世界建⽴连接的过程中，拓宽视野，也坚定内⼼——让你的丰盈，既有厚度，也有来处。",
      "selfReflectionSummary": "这学期最⼤的不同就是真正的进⼊到了⼀个全新的课程⾥⾯，然后同时呢我在期中也升到了A3，这让我拥有 了更多的学习时间和⾃主安排的时间。",
      "tutorCommentSummary": "亲爱的舒媛， 我记得在 2025 年年末，我送给你⼀个词——“丰盈”。"
    },
    "futureDirection": "工程?",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "舒媛，你课堂上注意力集中，与老师眼神交流积极；作业一贯认真、质量上乘，展现了极高的学习自律性。在戏剧展演\n中，你全身心投入，为完成角色不惜膝盖跪青，这份对角色的敬畏、对舞台的奉献精神，令人感动也令人钦佩。这不仅是\n对艺术的尊重，更是责任心的极致体现。你已具备了成就学业所需的核心品质：专注、自律与奉献。在接下来的学习中，\n希望你继续保持这份可贵的精神，并将舞台上的这份“走心”与“拼劲”，延续到对文学经典的深度解读与对人生议题的独立"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "Sue achieved an overall performance rating of \"Beyond Mastery\" this semester. She demonstrated a high level of \nengagement and quality in class participation, note-taking, and project work, reflecting strong study habits and self-\nmanagement skills. Her midterm exam performance was excellent, and al"
      },
      {
        "name": "English Advanced 2（B2+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Sue has a solid grasp of English, but she sometimes seems shy or hesitant to fully use her skills, especially when \nspeaking in front of classmates. When called on, she may give quick, simple answers, even though she has shown \nevidence of deeper understanding and stronger language ability than she "
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Sue demonstrated solid mastery and reflective depth. Her \nexploration of consequences when self-media platforms normalize filters and AI-generated visual content showed \ncommendable concern for authenticity in digital visuals. She handled the liter"
      },
      {
        "name": "大学经济学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Sue, from the first time I met you, I was struck by your wonderful sense of style—your hair is truly lovely, and you carry \nyourself with such grace. Beyond that, I have been very impressed by your academic discipline; your notes are \nmeticulously kept, and your focus during our lessons is exemplary"
      },
      {
        "name": "大学计算机科学原理 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Sue has been diligent in her AP CSP coursework and is unafraid to ask questions for clarification. Despite her strong \neffort, she occasionally experiences fatigue in class, which affects her academic productivity during instruction.\nI encourage Sue to establish a structured weekly review routine, r"
      },
      {
        "name": "One Schoolhouse：AP Physics 2",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Sue has continued to produce quality work throughout the second quarter of AP Physics 2. Sue scored highly on our \nrecent AP practice test, indicating that she is on track in her preparation for AP Physics 2 Exam. She has worked \ndiligently to develop ever stronger analytical skills, applying her kn"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "庄舒媛本学期的体育课里总是努力完成每一次接盘，可以在比赛里完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期的未来规划课程围绕三个单元展开，帮助你逐步理解基于全面评估政策的大学申请逻辑，学习查校与选校，并最终\n完成了属于你自己的大学清单。通过回顾和梳理课外活动，你也完成了第一版activity bank和简历。这些看似基础的准\n备，其实正是在为未来的申请一点点铺路，也是在为自己争取更多的可能性。\n在第一单元中，你能够紧跟课程节奏，通过模拟招生官案例分析，认真思考全面评估下大学究竟在看什么，并同步梳理了\n现阶段七大申请材料模块的准备度。进入第二单元，你开始向内厘清自己真正看重的选校标准——学术影响力、生活的舒\n适与便利、丰富的校园生活以及选课的灵活度等；向外则通过大学展、招生官来访和校友返校日等"
      }
    ],
    "academicStrength": "Excels in 语文 III and 4 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "徐伯骏",
    "name": "徐伯骏 Jay Xu",
    "chineseName": "徐伯骏",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "钱寒轩 Hanhsuan",
    "gpa": 0.7333333333,
    "photo": "/photos/徐伯骏-J.jpg",
    "strengths": [
      "English Advanced 2（B2+）"
    ],
    "weaknesses": [
      "语文 III",
      "大学微积分 I",
      "荣誉中国研究"
    ],
    "activities": [
      "⚽ Football",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": "Not available",
      "selfReflection": "Not available",
      "tutorComment": "伯骏，这⼀学期，我看到你在热爱的艺术领域迈出了新的⼀步——⽆论是尝试新的表现形式，还是在创作中投⼊更多思\n考，都体现出你的勇⽓和耐⼼。艺术的突破从来不是⼀蹴⽽就的，⽽你愿意花时间去摸索、去打磨，这份坚持值得肯定。\n同时，你也和同学们相处得越来越融洽，交到了知⼼的朋友，彼此⽀持、分享想法，这让你的⾼中⽣活多了温暖与⾊彩。\n作为⽼师，看到你既保有对艺术的热情，⼜在⼈际关系中展现出真诚与善意，感到很欣慰。\n不过，随着探索的深⼊，时间和精⼒的分配会变得更加重要。艺术的追求固然珍贵，但学校的学业要求同样是你现阶段不\n可忽视的责任。试着更主动地规划时间，在创作与课业之间找到可持续的节奏——这样，你才能既不辜负热爱，也不落下\n基础。\n愿你在保持敏感与创造⼒的同时，也培养起更清晰的时间管理能⼒。如此，你的才华与努⼒，才会有更坚实的⼟壤去⽣\n长、绽放。继续前⾏吧！",
      "selfReflectionSummary": null,
      "tutorCommentSummary": "我看到你在热爱的艺术领域迈出了新的⼀步——⽆论是尝试新的表现形式，还是在创作中投⼊更多思 考，都体现出你的勇⽓和耐⼼。"
    },
    "futureDirection": "艺术",
    "courses": [
      {
        "name": "语文 III",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "伯骏，你前半学期的状态堪称完美——认真听讲、积极互动、作业质量佳，展现了强大的学习潜能。尽管后半学期有所波\n动，戏剧展演筹备前期缺课较多，但你依然在关键时刻承担责任，出色完成了灯光控制任务。这说明了你的责任心与应急\n能力。学习是一场持久战，状态的稳定性至关重要。希望你能分析状态起伏的原因，重建持续专注的学习节奏。你的能力\n毋庸置疑，现在需要的是将前半程的爆发力，转化为贯穿始终的耐力。相信你能调整好步伐，迎头赶上！"
      },
      {
        "name": "大学微积分 I",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Jay’s performance has been unsatisfactory, marked by a distinct decline in the 2nd half of the semester. His extended \nabsence from school before the final exam caused him to miss a substantial volume of content, and the lack of practice \nhas made it arduous for him to keep pace. Consequently, his a"
      },
      {
        "name": "English Advanced 2（B2+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Jay has a very strong command of English and is clearly ready for continued challenge. When he is present in class, he \nconsistently offers unique, interesting, and logical insights that reflect deep critical thinking and a high level of maturity. \nHe communicates fluently and confidently, and his c"
      },
      {
        "name": "荣誉中国研究",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Throughout the G11 China Study field investigation, Jay demonstrated promising development and steady commitment. \nHis topic selection initiated an exploration of general media themes, providing a starting point for understanding digital \nlandscapes. He handled the literature review by introducing k"
      },
      {
        "name": "大学心理学 I",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "I see flashes of potential in you, which makes your lack of engagement all the more frustrating. By missing classes or \nzoning out, you are making this course much harder for yourself than it needs to be. You are spending your time playing \ncatch-up, learning isolated pieces of information without t"
      },
      {
        "name": "平面构成与品牌",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "你本身具备出色的艺术天赋，同时也形成了一套清晰而有效的自学方式。在创作过程中，你并不依赖单一的指导，而是能\n够主动寻找资料、不断尝试不同的方法，这使得你在课堂之外也能保持稳定的成长节奏，期待看到你精彩的成品。"
      },
      {
        "name": "创作时刻",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "我看到了你在 TouchDesigner 与 Photoshop 方面所投入的学习与实践，也能清晰感受到你对音乐与数字媒体方向的热\n情，以及你对酸性风格的持续兴趣与偏好。这些元素在你的多件作品中都有所体现，逐渐形成了较为鲜明的个人取向。希\n望在之后的创作中，能够看到你更多关于过程性的实验与探索，不仅呈现最终成果，也记录和展示思考与尝试的路径。同\n时，也期待你持续产出更多作品，在不断实践中进一步深化和拓展这一方向。"
      },
      {
        "name": "体育：足球",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Jay is still in the way of progressing, trying to assimilate the new concepts and skills of football. His attitude for learning \nand improving is quite positive. Jay has good physical ability, and he has demonstrated it in fitness exercises. He needs \nto improve his arm and upper body strength, gain"
      },
      {
        "name": "未来规划 III",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Jay，本学期的表现确实呈现出一种“高开低走”的态势。明明在海报展时你还是那个逻辑严密、对校友日音乐学院的课程\n和作品充满抱负的少年，你身上那种交叉学科的独特潜质本该有更灿烂的绽放。很遗憾本学期的后半程没能与你并肩前\n行。请记住，你曾经展现出的优秀是有目共睹的。期待下学期能看到你重新调整步频，出现在云谷的校园里，我们再一起"
      }
    ],
    "academicStrength": "Excels in English Advanced 2（B2+）",
    "academicWeakness": "Needs improvement in 语文 III and 7 other course(s)"
  },
  {
    "id": "徐梁越",
    "name": "徐梁越 Larry Xu",
    "chineseName": "徐梁越",
    "className": "⼗⼀年级问源班",
    "tutorName": "Chen Zhixiu",
    "gpa": 3.9555555556,
    "photo": "/photos/徐梁越-X.jpg",
    "strengths": [
      "语文 III",
      "大学微积分 I",
      "大学生物 I"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "⚽ Football",
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 校内学术\n 雅思分数达到7.0分，校内微积分，⽣物，化学冲5，校内成绩基本达到全4，校内物理保4，数学建模得奖（最好F\n奖）\n\n上课认真听讲，课后有不懂的知识点及时问⽼师，及时完成作业并订正，平时有空多练习CL学科题⽬（特别是\nFRQ）\n在周末在机构进⾏培训，平时每天背单词，每⽇完成阅读或听⼒⼀篇并完成做题分析发给⽗母，同时每⽇完成1-2篇\n⼝语练习\n在校队学习关于⽣物竞赛和数学建模的知识并及时进⾏回顾练习\n 兴趣爱好\n 进⼊周四的乐团训练，提升萨克斯能⼒，参加乐团的2次演出；西湖⼤学做实验\n 按时参加乐团，每天练习萨克斯30分钟，锻炼⾳感以及背乐谱，熟练萨克斯按键；在学习完实验操作之后进⾏整理\n ⽣活⽬标\n 保持每周打两次社团内的⾜球⽐赛，保持⾝⼼健康\n 准时参加社团，不缺勤，认真训练",
      "selfReflection": "与上学期相⽐，这学期的我更加沉稳，也更加有⽅向感。这学期，我进⾏了更多的实践并在其中不断确认并深化对⾃我的\n认识。\n在学习上，我不再只是完成既定任务，⽽是会主动思考学习内容背后的逻辑与意义。在学术探究过程中，我逐渐学会独⽴\n提出问题、查阅资料并进⾏整理与表达，对研究过程的耐⼼和专注度都有了明显提升。同时，我在英语表达、学术展⽰以\n及 PPT 和海报等成果呈现⽅⾯更加熟练，也更加注重逻辑性与整体表达效果。\n在课堂之外，我开始更主动地参与集体活动与合作项⽬，能够在团队中承担责任并与他⼈⾼效沟通。在公益相关活动中，\n我不再只停留在“参与”，⽽是更加理解帮助他⼈所蕴含的社会意义，也从中获得了成就感与价值感。",
      "tutorComment": "⼩徐同学：\n回顾这学期，感觉你正处于⼀个微妙的“拉锯战”中：学业与某些说不清楚的东西在争抢你的时间和精⼒，新的⾃我认知正\n在萌芽，⽽你也在努⼒摸索和适应新的关系模式。\n在学业上，雅思成绩屡次卡在瓶颈处，确实令⼈着急，这已经开始影响到夏校申请等后续机会了。校内成绩虽与上学期持\n平，没有出现低分，但也⼏乎没有看到“超越”的惊喜。不过，要特别恭喜你在数学建模⼤赛中获奖，这是你努⼒耕耘的回\n报，也证明了你的潜⼒。只是在擅长的⽣物和数学的⽇常学习中，你的表现并不算突出，仍有很⼤的进步空间。客观来\n说，本学期个别科⽬难度提升，学业负担确实加重了，但作业之余你并⾮没有时间去精进，只是这些宝贵的空档往往被⽆\n关紧要的琐事填满。课后效率偏低、⼼思难以完全沉潜下来，是你⽬前最⼤的阻碍。建议你利⽤假期静下⼼来，把复习和\n练习落到实处。希望你能给⾃⼰设定更⾼的标准，不要轻易被旁⼈的节奏带偏，专注⾛好⾃⼰的路。\n校园⽣活⽅⾯，你的个⼈纪律总体良好，虽然偶尔会因为⼀时幼稚犯下低级错误，但好在你听得进劝，改正也很快。很⾼\n兴看到你重新拿起了萨克斯风，持续的练习带来了⾁眼可见的进步。听说你最近⼏次校内外的演出也很精彩，值得⿎励。\n不过，还是要提醒你时刻记住学⽣的本分，学会给各项事务排好优先级。\n在为⼈处事上，近期你似乎出现了⼀些“排外关系”的倾向，这已经引起了⾝边好朋友们的些许不满，希望你能注意把握分\n⼨。在与同伴们的相处中，如果内核不够稳固，很容易被周围的环境影响。希望你能坚定本⼼，逐步形成⾃⼰独⽴的是⾮\n观，不随波逐流，只有这样才能活出真正的⾃⼰。",
      "selfReflectionSummary": "与上学期相⽐，这学期的我更加沉稳，也更加有⽅向感。",
      "tutorCommentSummary": "这学期，感觉你正处于⼀个微妙的“拉锯战”中：学业与某些说不清楚的东西在争抢你的时间和精⼒，新的⾃我认知正 在萌芽，⽽你也在努⼒摸索和适应新的关系模式。"
    },
    "futureDirection": "生物方向",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期的语文学习，你以全然的真诚与饱满的热情，投入到了从经典细读到创意实践的每一个环节。你的核心品质在于真\n诚的态度与高度的投入感。 你待人接物真诚，这使你自然而然地成为小组合作中值得信赖的伙伴。在课堂内外，你的参\n与度极高，总能积极回应、贡献想法。更难能可贵的是，你总是主动承担责任，无论是小组讨论的引领，还是戏剧项目的\n具体任务，你都乐于担当且完成得出色。你在戏剧表演中的投入同样令人印象深刻。你的剧本《“棍棒”与“键盘”》将《红\n楼梦》中“宝玉挨打”这一经典的父权压制与代际冲突事件，移植到当代精英家庭的语境中。将贾政转化为信奉精英教育的\n科技公司CEO，将“棍棒”的体罚隐喻为“键盘”所代表的"
      },
      {
        "name": "大学微积分 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Larry has delivered an excellent and consistent performance this semester. He possesses strong logical reasoning and \nabstraction skills, frequently enriching class discussions with his insights. He often approaches problems from a unique \nangle, employing non-conventional methods that demonstrate r"
      },
      {
        "name": "English Advanced 1（B2）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Larry is a pleasure to have in class due to his exceptionally positive attitude and his eagerness to ask questions. While \nhe currently works from a relatively weak linguistic foundation, particularly in his listening comprehension, his \nenthusiasm for learning is a significant asset. However, Larry"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Larry demonstrated strong proficiency. His assessment of how color \nstyles and light intensity affect animation video popularity was creative. He handled the literature review solidly, \neffectively exploring key visual psychology. Larry’s fieldwork"
      },
      {
        "name": "大学生物 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Larry is a dedicated student who actively accepts feedback and shows a genuine desire to improve. He has the \nacademic knowledge needed for high achievement, but much of it is still processed in Chinese. Strengthening his \nbiological English will help him understand questions more efficiently and re"
      },
      {
        "name": "大学化学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Larry Xu stands out for his relentless curiosity and proactive approach to learning. He is never satisfied with a partial \nunderstanding; if a concept remains unclear, he will ask successive, probing questions until he achieves absolute clarity. \nHis imagination and divergent thinking capabilities a"
      },
      {
        "name": "大学物理 I: 力学",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Larry has maintained a consistent performance this semester, though falling short of expectations. He possesses a \nstrong mathematical foundation and applies effective inquiry and experimental skills, likely transferred from his \nexperience in other sciences. However, he lacks a natural intuition fo"
      },
      {
        "name": "体育：飞盘",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "徐梁越在本学期的体育课里展现出了自己非常积极的运动态度和能力，你从稳定的接盘手成长到了可以在比赛中完成传接\n和助攻，体现出了你这学期的成长！\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "梁越，这个学期，对你来说是沉淀与充盈并行的一个阶段。无论是微积分还是物理，你都选择了难度更高的课程并扎实推\n进；HOSA 竞赛与 HIMCM 的圆满完成与获奖，也为这段努力写下了有力的注脚。\n“申请已经开始啦！”——这大概是我课上说得最多的一句话。而你也用实际行动证明了自己对大学申请的专注与投入。本\n学期的未来规划课程，我们聚焦理解高校的全面评估机制，学习查校与选校的方法，并同步启动了简历等申请材料的准\n备。让我印象最深的是你“人生印记时光轴”的作业：从最初的科学好奇到一次次实验尝试，从了解到竞赛实践，我看见了\n一个对生化怀抱热爱的你，沿着来时路一步步把兴趣变成能力、把能力变成方向。\n这个寒假"
      }
    ],
    "academicStrength": "Excels in 语文 III and 4 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "徐浩淼",
    "name": "徐浩淼 Evita Xu",
    "chineseName": "徐浩淼",
    "className": "⼗⼀年级问源班",
    "tutorName": "杨晓晶 Jaye",
    "gpa": 3.4777777778,
    "photo": "/photos/徐浩淼-X.jpg",
    "strengths": [
      "语文 III",
      "荣誉心理学 I",
      "未来规划 III"
    ],
    "weaknesses": [
      "荣誉心理学 I",
      "未来规划 III"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🎨 Crafts",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提⾼阅读和⼝语能⼒ \t基本达成\n 在宿舍多练⼝语，希望在这⼀年，标化⼝语⼩分达到6。这学期看完2本篇幅不短不长的英语书籍。校内成绩到达3/4\n\n⾏动⼀：在宿舍⾥积极和舍友⽤英⽂交流。\n⾏动⼆：在每周语⽂阅读的时候多去选择英语书籍（⼀开始可以从简单的短篇阅读开始），从短篇阅读开始的话，尽\n量2-3周⼀本书。\n ⼼理学科相关 \t达成\n 参加竞赛（1-2个）争取获得较⾼名次，保持热爱，上课好好听\n\n⾏动⼀：留意⼀些与⼼理学的竞赛（⼤概1-2个），估量之后选择到底要不要参加，尽量得到⽐较⾼的名次（e.g.全\n国）。\n⾏动⼆：在平常多看⼀些关于⼼理学的书籍，奠定⼀些⼼理学基础（⾄少了解基本的⼀些⼼理测试），⽬标书籍是：\n⼼理学百科\n⾏动三：在每节课结束后，⾃我回顾上课（理论课）的知识，记录在电脑⾥。",
      "selfReflection": "这⼀学期其实明显我的学业往上⾛了，但是就是我的英语……依旧还需要提升。感觉在其他学科的学习当中已经慢慢开始\n变得游刃有余了，慢慢开始可以有更多的时间去不光是学习基础的知识了。但英语不同，⾸先是我觉得我词汇的掌握度还\n不够，有很多单词单说意思和拼写的话已经会了，但是要说运⽤，那就是还不熟练。（甚⾄我有⼀个单元的vocabulary是\n个F。。。qwq）所以说我的英语在词汇⽅⾯平常还是要多积累，还有⼝语。说完不太好的，可以来说说好的了，我的⼼理\n在我个⼈看起来还是可以的，但是还是没有达到我⾃⼰⼼⾥的⼀个最⾼的标准，所以还需努⼒。这学期我也积极参与了很\n多项⽬，例如烟囱节南⽠节的策划，我觉得我⾃⼰在这些活动⾥⾯也学到挺多的，不光是在任务中的协调统筹，还是⼈际\n交往上的⼀些事情，这些事情都让我觉得我成长了，我真正知道⾃⼰还需要什么，想要什么，已经有了什么。",
      "tutorComment": "亲爱的Evita，恭喜你完成了这漫长⼜充实的G11第⼀学期！\n这个学期，你的成长是安静但扎实的。能明显感受到，你在学习⽅式上发⽣了很重要的转变。英语学习中，你逐渐从被动\n理解⾛向主动分析，通过主题阅读、思维导图和更⾼难度的⽂本训练，开始尝试真正“⽤英语思考”，⽽不只是停留在翻译\n层⾯；⼝语⽅⾯，你愿意⾛出害怕犯错的状态，⽤每⽇练习和真实对话为⾃⼰积累表达经验，语感和流利度都有可见提\n升。⼼理学学习也不再只是兴趣驱动，⽽是逐渐⾛向系统化，你能把书本中的概念带回到⽣活中观察、反思，并通过写作\n不断复盘，这种深度学习能⼒正在形成。同时，在烟囱节、南⽠节等项⽬的策划与参与中，你不仅锻炼了任务统筹和执⾏\n能⼒，也在真实的合作中更清楚地认识了⾃⼰——你开始知道⾃⼰还缺什么、想要什么，也逐渐意识到⾃⼰已经具备了哪\n些能⼒。\n新的⼀年，期待你在保持这种清醒⾃省的同时，对⾃⼰多⼀些耐⼼。你已经看到学业整体在向上⾛，也开始在多数科⽬中\n找到从容感，⽽英语恰恰是⼀条需要长期积累的“慢线”：词汇的真正掌握、语⾔的⾃然输出，都需要时间反复打磨。与其\n被⼀两次结果牵动情绪，不如继续⽤你已经在做的⽅式——持续输⼊、主动运⽤、允许不完美。你对⼼理学的热情与深度\n思考能⼒，是你⾮常独特的优势，如果能逐步⽤英语去承载这些思考，英语也会慢慢成为你的⼯具⽽⾮负担。希望你在新\n的阶段，带着更稳定的节奏和更笃定的信⼼，继续向前⾛——你正在成为⼀个越来越了解⾃⼰、也越来越有⼒量的学习\n者。",
      "selfReflectionSummary": "这学期我也积极参与了很 多项⽬，例如烟囱节南⽠节的策划，我觉得我⾃⼰在这些活动⾥⾯也学到挺多的，不光是在任务中的协调统筹，还是⼈际 交往上的⼀些事情，这些事情都让我觉得我成长了，我真正知道⾃⼰还需要什...",
      "tutorCommentSummary": "期待你在保持这种清醒⾃省的同时，对⾃⼰多⼀些耐⼼。"
    },
    "futureDirection": "心理学",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你不仅个人学业扎实可靠，更在集体创作中扮演了不可或缺的枢纽，用你的责任感与沟通力将团队的创意有序地转化为舞\n台上的现实，这种全面而稳定的素养令人深感钦佩。你的核心品质在于投入感与协作力。 在课堂上，你总是那位认真倾\n听的同学，这份沉静保证了你能精准地吸收和理解复杂的课程内容，并直接反映在作业质量上。你的作业思完成度高，是\n个人学习成果的优质体现。在戏剧项目中，你主动承担了关键的幕后工作，以极强的责任心确保了排练的顺畅。更重要的\n是，你展现了出色的合作与沟通能力，能够有效连接不同想法的成员，化解分歧，凝聚共识，是团队中真正的“粘合剂”与\n“推进器”。你的剧本《人间好时节》中得到了细腻而深刻的表达"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Evita’s overall performance is rated as \"Developing.\" She excelled in class interaction and note-taking, and her \nhomework was completed to a good standard. However, her exam results remained at the \"Beginning\" level, indicating \na significant need to improve her ability to apply knowledge independe"
      },
      {
        "name": "English Intermediate 1（A2+）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Evita's progress this semester has reached a standstill due to a noticeable decline in her effort and engagement \ncompared to Grade 10. While she possesses a relatively weak linguistic foundation, the primary barrier to her \nimprovement is her current attitude toward the learning process. She has sh"
      },
      {
        "name": "积极倾听与主动回应",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你本学期学习基本良好，读写方面都有良好表现，听说部分还需要再加强，作业完成认真。期末考试成绩良好，进步非常\n大，反映出你自己一直在努力。课堂中自我表现的主动性略有不足，建议继续保持现在的学习习惯的同时也能更有展现自\n己能力的勇气和自信，听力方面可以学习一些简单的日文歌曲，使自己在日语的听和说两方面再加以提高。"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Evita demonstrated excellence. Her exploration of how TikTok \nportrayals of Chinese overseas students shape teens' perceptions was perceptively chosen. She handled the literature \nreview expertly, effectively synthesizing key diaspora media studies"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你对心理学的热情令人深受鼓舞，优秀的成绩也反映了你的投入。既然你有志于在这个领域深造，我想挑战你进一步拓宽\n视野。不要仅仅满足于课本上的知识，去探索课外更广阔的心理学世界吧。最重要的是，加强英语学习将是你未来通往更\n深层理解和高阶研究的通行证。你正在打下坚实的基础——现在，向更高的目标迈进吧！\nYour passion for Psychology is truly inspiring, and your strong grades reflect that dedication. Since you have the \nambition to pursue this field furthe"
      },
      {
        "name": "荣誉生命科学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "我一直很关注你在课堂上的表现，能看得出来你已经尽了最大努力去保持专注，这份坚持本身就很不容易。或许生命科学\n目前还没能激发起你的好奇心，但你依然能保持作业的工整与及时，这展现了你极强的自我管理能力。成绩并不是衡量你\n的唯一标准，老师更看重你这种“虽然难，但我依然在做”的韧劲。下学期我们可以尝试把抽象的概念和实际生活联系起\n来，或者多做些笔记来帮助记忆。保持这份踏实，老师会一直支持你。"
      },
      {
        "name": "体育：综合格斗",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "徐浩淼同学课堂参与积极，态度认真，能够主动练习各类动作。尽管身体力量偏弱，但她在学习动作时表现出较强的专注\n度和刻苦精神。建议在保证安全的前提下，通过力量和耐力训练加强体能基础，同时多重复练习动作，提高稳定性和连贯"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Evita，这一学期，你们正式进入了大学申请准备的起步阶段。在未来规划课上，你完成了选校维度的梳理，设计了属于\n自己的梦校海报，初步产出了课外活动清单初步描写，并制作了个人简历。这些任务不只是作业本身，更是一次次对自我\n认知与未来方向的深入思考。\n在未来规划课上，你的每一次作业几乎都会让我惊喜。你总是特别走心地去思考与表达，不敷衍、不应付，愿意把真实的\n想法写出来，质量也始终很高。这不仅展现了你的责任感，更体现了你对自己未来的认真态度。\n你对心理学的热爱依然坚定，也在不断用行动靠近自己的目标。从参与各类活动到持续思考前沿方向，你正在一步步为梦\n想积累力量。\n接下来，希望你能继续稳步加强语言能力"
      }
    ],
    "academicStrength": "Excels in 语文 III and 2 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "忻哲昊",
    "name": "忻哲昊 Jersey Xin",
    "chineseName": "忻哲昊",
    "className": "⼗⼀年级问源班",
    "tutorName": "杨晓晶 Jaye",
    "gpa": 2.3333333333,
    "photo": null,
    "strengths": [
      "Academic Excellence",
      "Leadership",
      "Creativity",
      "Analytical Thinking"
    ],
    "weaknesses": [
      "语文 III",
      "荣誉中国研究",
      "体育：足球"
    ],
    "activities": [
      "⚽ Football",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " Create a prototype of my free video platform for research techniques\n\nAction 1: Recruit teammates\nAction 2: Write scripts for 3 short videos\nAction 3: Make prototype videos of the scripts\nAction 4: Ask for advice from professionals\nAction 5: At least create 1 polished, presentable video\nAll this should be done before the end of the semester\n Achieving a 4–5 Grade in Chemistry & Biology\n\nAction 1: Review after lesson: Spend 15–20 minutes rewriting notes in your own words.\nAction 2: Active recall: Make flashcards for key terms, reactions, and processes.\nAction 3: Do 1–2 practice exams or past papers (timed) every month\nAction 4: Before exams: Make a study calendar 1–2 weeks before, do at least 2–\n3 full timed practice tests, review mistakes",
      "selfReflection": "Not available",
      "tutorComment": "亲爱的Jersey，恭喜你完成了这漫长⼜充实的G11第⼀学期！\n这个学期，你在多门⾼阶学科中展现出了⾮常清晰⽽突出的优势。⽆论是⼤学⽣物、⼤学化学，还是⼤学计算机编程原\n理，你都表现出独⽴思考的学习风格和扎实的理解能⼒。在课堂上，当你在场并投⼊其中时，往往能够主动参与讨论、提\n出有价值的观点，展现出你对知识的敏感度与判断⼒。尤其是在⼤学化学中，你在外部项⽬上的投⼊令⼈印象深刻，那种\n全情投⼊、专注探索的状态，清楚地说明：当你真正认定⼀个⽬标时，你具备把事情做好、做深的动⼒与能⼒。计算机编\n程⽅⾯，你也能够通过课堂讨论逐步消化概念、建⽴理解，这种稳扎稳打的学习⽅式为你后续的科学研究打下了良好基\n础。在荣誉中国研究中，你的选题与研究尝试也展现出逐渐成形的⽅向感和投⼊意识，说明你正在学习如何把兴趣转化为\n结构化的探索。后半学期因⾝体原因确实打断了你的学习节奏，但你在关键时刻展现出的能⼒，已经⾜以证明你的潜⼒并\n未因此减弱。\n展望未来，最重要的是给⾃⼰时间，慢慢找回稳定的状态与连续性。你已经⼀次次证明，只要⾝体允许、状态到位，你完\n全有能⼒胜任⾼难度的学术挑战。接下来，⽆论是在补回⼤学计算机中与 Python 数据分析相关的内容，还是在继续推进\n理科与研究型学习上，都不需要急于求成，⽽是⼀步步把节奏重新建⽴起来。希望你在新的阶段⾥，既相信⾃⼰的能⼒，\n也学会尊重⾝体的节奏，⽤更长远的眼光看待成长。你依然站在⼀条很有潜⼒的道路上，学校和⽼师们都期待着你在合适\n的时机，以更稳健的状态回到⾃⼰热爱的学习之中。",
      "selfReflectionSummary": null,
      "tutorCommentSummary": "这个学期，你在多门⾼阶学科中展现出了⾮常清晰⽽突出的优势。"
    },
    "futureDirection": "生物/神经科学",
    "courses": [
      {
        "name": "语文 III",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "本学期的语文学习，你突破阻隔，以坚定的意志，完成了一次极具挑战性的深度探索。你的彬彬有礼与面对挑战的坚韧，\n给大家留下了深刻的印象。 你为本学期戏剧展演所设计的剧本，以黛玉葬花为内核，探讨现代教育压力与个人梦想的冲\n突，从主题到形式都堪称成熟且富有创意。你精准地捕捉了《红楼梦》中“黛玉葬花”所蕴含的对美好事物易逝的感伤、对\n“质本洁来还洁去”的执着，并将其内核创造性地移植到当代高中生林晓语在应试压力与个人写作梦想间挣扎的叙事中。为\n了让这份卓越的独立创作能力在集体思辨中获得更充分的碰撞与滋养，老师对你最殷切的期望是：在课堂同步讨论中更积"
      },
      {
        "name": "大学统计学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Dear Jersey, \nYour solid foundation and excellent learning habits have clearly paid off this semester, as evidenced by your quick and \ndeep understanding of statistical concepts. The high quality of your homework consistently reflects your strong \nanalytical skills. To fully capitalize on your poten"
      },
      {
        "name": "demonstrated on several occasions.",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Jersey, you are a capable and well-balanced student with the clear potential to produce high-level work, which you have \ndemonstrated on several occasions. \nTo fully realize this potential and achieve consistent excellence, I encourage you to focus on two key areas: ensuring the \ntimely submission o"
      },
      {
        "name": "荣誉中国研究",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Throughout the G11 China Study field investigation, Jersey demonstrated budding development, with opportunities for \nfurther refinement. His topic selection started to identify media interests. He handled the literature review by introducing \nkey concepts, suggesting potential for expansion. Jersey’"
      },
      {
        "name": "大学生物 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Jersey is a natural biologist. He explains biological processes clearly and demonstrates deep insight into our curriculum \ncontent. With his strong English skills and solid knowledge base, he has great potential to earn a 5 in AP Biology. With \ncontinued self-discipline and steady preparation, I am "
      },
      {
        "name": "大学化学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Jersey is a student with a is a student with a distinct and independent learning style. When present, he is proactive in \npeer discussions, contributing valuable insights. I was particularly impressed by the enthusiasm he showed for his \nexternal project; it was a clear display of his passion and ca"
      },
      {
        "name": "大学计算机科学原理 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Jersey is new to computer science but performs well in this class. Although he was not always the first one to \nunderstand the concept, he can always clearly understand it through class discussion. Jersey missed many classes in \nthe last month. He should make up the content on analyzing data using P"
      },
      {
        "name": "体育：足球",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Jersey is still in the way of progressing, trying to assimilate the new concepts and skills of football. His attitude for \nlearning and improving is quite positive. Jersey needs to improve his physical condition in all aspects, both speed and \nflexibility, and especially develop muscle to have more "
      },
      {
        "name": "未来规划 III",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Hello Jersey，这个学期的未来规划课程，对你来说并不轻松。由于身体和状态的影响，你有较多任务未能按时完成，因\n此本学期课程成绩为 F。这个结果本身并不定义你，但它确实提醒我们，有一些重要的准备在这个阶段被迫按下了暂停\n键。\n本学期的未来规划课程围绕三个单元展开，原本希望能够陪伴你一步步理解基于全面评估政策的大学申请逻辑，学习查校\n与选校，并最终完成属于你自己的大学清单。同时，也通过系统回顾和梳理课外活动，帮助你完成第一版 activity bank 和\n简历。这些看似基础的工作，其实是在为未来的申请慢慢铺路。没能完整参与其中，确实有些可惜。\n在未来规划课上，也在人生的很多时刻，我们都"
      }
    ],
    "academicStrength": null,
    "academicWeakness": "Needs improvement in 语文 III and 3 other course(s)"
  },
  {
    "id": "杨羽茜",
    "name": "杨羽茜 Amy Yang",
    "chineseName": "杨羽茜",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "李婷婷 Tingting",
    "gpa": 3.4,
    "photo": "/photos/杨羽茜-E.jpg",
    "strengths": [
      "荣誉预备微积分 I",
      "English Intermediate 3（B1+）",
      "荣誉中国研究"
    ],
    "weaknesses": [
      "大学心理学 I",
      "大学经济学 I"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 雅思 \t未达成\n 考到6\n\n1: 利⽤零碎时间背单词 主要是在晚⾃习 ⼀天⼤约100个\n2: 利⽤晚⾃习时间多刷雅思真题 每两天⼀套 做完听⼒后要做精听\n3: 看⼀些美剧\n 志愿活动 \t基本达成\n 多积累公益时\n\n1: 多参加校内公益活动\n2: 参加志愿者\n3: 多了解课外志愿活动",
      "selfReflection": "⾸先这个学期应该是有史以来最长的⼀个学期，同时也涵纳的⾮常多的经历，⾸先有我第⼀接触到两门我之前从来没有接\n触过的学科，并且这个学期与之前都不⼀样，所有课程的体系也有所变化，⽽且我还报名了⽇语这个新语⾔，以及第⼀次\n真正接触到飞盘这个新运动，在⼀开始的时候，感觉是还可以的，对⼀切事物都充满了新鲜感。但到后⾯那个学科都逐渐\n开始出现quiz以及PA的时候，发现每⼀门新接触到的学科都对我充满了挑战，尤其是有两门对我来说⽐较难的学科，经济\n与⼼理，我认为我对这些知识点都只是停留在知识的表⾯，并没有完全深⼊的理解，光靠我对他们的浅层理解，考试是考\n不出来的，并且有些题的英语这个语⾔对我也有⼀定的挑战，还有⽇语从⼀开始⼀点都不会到现在基础的⽤语⼤部分都与\n掌握，⾃⼰⼼中也有不少的成就感，还有这个学期有⾮常多的⾃主学习的时间，运⽤这些时间去学习物理和政治，还参加\n了学考。在这个学期的期中后我通校了，我认为这也是⼀种⾮常不同的体验。还有这个学期中我们也经历很多的⼤型活\n动，有酷玩节，还有戏剧展演，尤其是关于红楼梦的改编演出，我第⼀次体验了当演员的体验，充分感受到的⾓⾊的魅\n⼒，同样还有作为服装道具后台⼈员的感受，发现幕后⼈员实则也⾮常忙碌，艰⾟，所有⼈都是⼀场演出中必不可少的元\n素。在这⼀整个学期末，我也发现终归⾃⼰还是有了不少成长的，掌握了飞盘，学习了⼀些之前从来没有接触过的知识，\n拓宽了⾃⼰的眼界，还有这⼀学期的社长轮换中，我也成功竞选成功接班了调⾹社这个社团，对我⾃⼰也有很⼤的帮助。\n总的来说，过得也⾮常的幸福，简单。",
      "tutorComment": "你不仅是同学们眼中的“开⼼果”和“冬⽇暖阳”，更是⽼师⼼中极具潜⼒和责任感的优秀学⽣。本学期，你在学术、领导\n⼒、艺术与社会公益等多个领域全⾯发⼒，展现了⼀个⾼⼆学⽣应有的⼴度与深度。⾯对这“有史以来最长”且充满变⾰的\n学期，你不仅适应了新的学科体系，更在⽣活⽅式的转变中保持了那份简单⽽坚定的幸福感。\n你⽆论是住宿期间的模范表现，还是⾛读后100%的作业提交率，你的⾼度⾃律令⽼师和⽗母感到欣慰。⾛读⽣活对你⽽\n⾔不仅是时空的转移，更是培养独⽴⽣活与时间规划能⼒的契机。请继续守护好规律作息这份“底⽓”，它是你奔赴未来的\n基⽯。\n你拥有⾜以⽀撑你实现任何梦想的聪明才智与⾃律品质。在未来的学习中，愿你少⼀分“速成”的急迫，多⼀分“深潜”的耐\n⼒。当你学会在知识的海洋中“驻⾜停留”时，你会发现⼀个更强⼤、更深刻的⾃⼰。\n期待你在下学期，以更加从容坚定的步伐，⾛在属于⾃⼰的节奏⾥。加油！",
      "selfReflectionSummary": "我也发现终归⾃⼰还是有了不少成长的，掌握了飞盘，学习了⼀些之前从来没有接触过的知识， 拓宽了⾃⼰的眼界，还有这⼀学期的社长轮换中，我也成功竞选成功接班了调⾹社这个社团，对我⾃⼰也有很⼤的帮助。",
      "tutorCommentSummary": "期待你在下学期，以更加从容坚定的步伐，⾛在属于⾃⼰的节奏⾥。"
    },
    "futureDirection": "服装+商业",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "杨羽茜同学学习态度认真积极，课堂专注，作业按时完成。她亲切友善，对文学有着细腻的感受力，具备扎实的学\n习习惯与稳定的执行力。在本学期《红楼梦》戏剧改编项目中，她作为道具负责人，展现出极强的责任心、组织协调能力\n与动手能力，为演出顺利推进贡献突出。同时，她对自己饰演的角色用心揣摩，表演自然得体；在剧本创作中也表现出独\n特的文本理解力与创造力。\n        老师看到你在幕后工作中展现的统筹能力，也注意到你在创作中蕴含的潜力。希望你在保持细致与认真态度的基础\n上，进一步强化以下高阶能力：加强整体结构意识——在理解具体章节时，同时关注章回结构、人物关系和主题线索，把\n握作品整体，提升宏观理解力；培"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Amy’s overall performance is rated as \"Proficient.\" She performed consistently well in class participation and homework, \nmaintained good note-taking habits, and completed her project at a high level. However, her midterm and final exam \nresults did not fully reflect her strong daily performance, su"
      },
      {
        "name": "English Intermediate 3（B1+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Amy, you have shown clear skill in your written work this term, with well-structured sentences and a good grasp of \ngrammar. It's great to see this strength.\nTo build on your writing ability and make balanced progress, the next step is to focus on developing confidence in your \nspoken English. Remem"
      },
      {
        "name": "积极倾听与主动回应",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你本学期学习基本良好，听说方面都有良好表现，读写部分还需要再加强，作业完成认真。期末考试成绩良好，进步很\n大，反映出你自己一直在努力。课堂中自我表现的主动性略有不足，建议继续保持现在的学习习惯的同时也能更有展现自\n己能力的勇气和自信，听力方面可以学习一些简单的日文歌曲，使自己在日语的听和说两方面再加以提高。"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hello, Amy. It was a great pleasure having you in China Study this semester. I have witnessed your significant progress \nthroughout the term as I can see that your performance truly stand out during the second half of semester. Your final \nproject was particularly well-executed, resulting in a rigor"
      },
      {
        "name": "大学心理学 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "I see so much potential in you. You pick up on ideas easily, which is a great strength. However, I notice that your exam \nperformance doesn't always show how smart you truly are. This is often because your review time is a bit too brief, \nleaving your knowledge on the surface. I want to encourage yo"
      },
      {
        "name": "大学经济学 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Amy, although you often sit by yourself in the very back row, your sincere attitude and genuine passion for economics \nhave not gone unnoticed. I know the subject felt quite daunting at the very beginning, but I have seen your steady \nprogress and the way you are becoming increasingly confident in y"
      },
      {
        "name": "体育：飞盘",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "杨羽茜在本学期的体育课里总是努力完成每一次接盘，会很主动地进行跑动接盘。在比赛里经常完成很多极限的接盘，可\n以在比赛里完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "羽茜，很高兴看到你度过了一个让未来愈发清晰的学期。无论是专业方向还是留学目的地，我们从最初的迷茫逐步聚焦，\n虽然仍在探索，但这本身就是成长的最核心部分：不断试错、不断校准、不断靠近真正适合自己的路径。\n“申请已经开始啦！”——这大概是我课上说得最多的一句话。而你也用实际行动证明了自己对大学申请的专注与投入。本\n学期的未来规划课程，我们聚焦理解高校的全面评估机制，学习查校与选校的方法，并同步启动了简历等申请材料的准\n备。让我欣喜的是，你对加州院校做了深入研究，能结合专业兴趣对查校清单进行有针对性的增减。\n在面谈中，我感受到你对目标的清晰与坚定，也看到英文给你带来的一些挑战。但更让我惊喜的是，你在"
      }
    ],
    "academicStrength": "Excels in 荣誉预备微积分 I and 3 other course(s)",
    "academicWeakness": "Needs improvement in 大学心理学 I and 1 other course(s)"
  },
  {
    "id": "汤子墨",
    "name": "汤子墨 Moe Tang",
    "chineseName": "汤子墨",
    "className": "⼗⼀年级问源班",
    "tutorName": "夏梓元 Emily",
    "gpa": 3.7777777778,
    "photo": "/photos/汤子墨-X.jpg",
    "strengths": [
      "大学统计学 I",
      "大学计算机科学原理 I",
      "平面构成与品牌"
    ],
    "weaknesses": [
      "大学计算机科学原理 I",
      "未来规划 III"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 学术⽬标：所有科⽬全4\n 虽然但是，英语有⼀点困难，所以可以接受英语有⼀个3；其他尽量努⼒⼀下还是想要全4\n\n1. 在所有的东西⾥⾯最注重校内成绩\n2. 重视所有的quiz，HW，Test之类的\n3. 上课没听就下课学，不要犯懒堆积问题\n 专业探索：研究学校专业会学什么\n 想学的专业⽐较模糊 ⼩众，所以应该更注重我感兴趣的学校有没有相关的授课内容\n\n筛选标准：\n0. Computer Art\n1. Media Art\n2. Experimental Art\n3. Interactive Art\n4. 是否是本科课程\n5. 课程产出是什么？\n6. 课程⼤纲\n同时对⼀些实验性艺术和计算机艺术（交互模块）可以有⼀些在作业中有⼀些初步的尝试和探索。\n 标化⽬标：IELTS 6.5-7.0+\n 6.5必须到，但把7.0作为⽬标\n\n1. 校内先好好研究校内成绩，在空余时间练习⼝语\n2. 国庆上课（听⼒ 阅读 写作）【不要再拖了，晚上早点睡，上课别睡觉，作业别敷衍】\n3. ⼗⼀⽉份去考试，⾄少到6.5后去申请夏校",
      "selfReflection": "这个学期的我感觉像长⼤了⼀些，变得独⽴且坚定，碰到多个问题时能够独⾃⾯对 独⾃解决，不再害怕未来会发⽣什么\n⽽是坚定的看见现在，感受当下时间的流动与感受。同时在我的作品中，我相⽐较于从前更加清晰的表达⾃⼰的意思与观\n点，主动尝试很多新的东西。即使还没有很成熟，但我相信在未来⼀定会逐渐增进，变得越来越清晰。",
      "tutorComment": "亲爱的汤⼦墨，\n⾸先为你顺利度过⾼⼆第⼀学期⽽撒花～～～这⼀学期很长，你凭借着⾃⼰的聪明才智稳扎稳打地⾛了下来，作为你的导\n师能够亲眼见证你的成长与蜕变，荣幸之⾄！\n这个学期，你能够在专业与学术发展上稳步提升，我其实并不意外。因为我看到期中之后的你，虽然⽇常咋咋唬唬，但在\n需要深⼊探索的时候，你总是能最快沉下⼼来找到适合⾃⼰的学习⽅式和路径。过程中，你对抗着⾃⼰脑海中不时迸发的\n“好奇”，克制分散的注意⼒，⽤⾃⼰⼝中略显“⽼⼟”的办法，逐渐形成了能够有效管理学习进度的⽅法。相信这份收获⼀\n定会成为你未来专业进阶和长远发展的坚实基础。社团活动中，虽历经诸多想法诞⽣后夭折，但我看到的是你从单纯的参\n与者逐渐向领导者⾓⾊的转变。你能不断思考着社团影响⼒与学⽣视⾓创意表达的平衡，这份思考远超活动本⾝。作为社\n长，你主动链接了杭州国际学校社团交流活动，⽤⾏动承担起运营团队的责任，让我真切看到了⼀个正在快速成长的⼩龙\n虾“汤社”。⽇常⾥，我也感受到了你正在从⼀株朝⽓向阳的向⽇葵，慢慢成为传递温暖与⼒量的⼩太阳。期末的素养答\n辩，更让我们看到⼀个成熟⽼练、逻辑清晰、能从多元视⾓剖析问题的“创新者”汤⼦墨。看着你从进⼊⾼中⼀点点努⼒打\n开⾃⼰，全⾝⼼拥抱每⼀段经历，在真实的感受中锻炼⾃⼰看待事物的⾓度与本质，这段旅程真是意义⾮凡⽽动⼈。\n这⼀学期的成长有⽬共睹，当然，我也要不免唠叨下⼀阶段的⽬标：\n1. 英语提升：通过素养答辩你也应该清楚地感受到了在英语为主要语⾔的专业场合开展学术交流时，⽆论从表达⾃信、临\n场反应，还是语⾔熟练度上，都仍有不⼩的提升空间。后续可制定针对性计划，增加⽇常训练机会，重点强化专业场景下\n的⼝语会话能⼒。\n2. 社团运营：保持你在同伴中的影响⼒与领导⼒，重点提升⼈群需求分析与落地执⾏能⼒。明确学⽣频道后续的核⼼运营\n⽬标与⽅向，打造系列化产出。同时，在招新、新⽼社员联动、对外宣发等⽅⾯继续发挥社长的统筹作⽤，让社团影响⼒\n持续升级。\n3. 细节与⽇常的把控：继续保持良好的学习习惯和适合的学习⽅式，关注包括排版及过程性证据管理等在内的细节。有时\n候看似只有20%细枝末节的⼯作量，可能会成为⼀个作品决定性的、需要花费更多时间精⼒打磨完整的关键步骤。\n相信接下来我们继续并肩努⼒，可以在现有基础上更加清晰和明确地奔向⾃⼰的⽬标！",
      "selfReflectionSummary": "这个学期的我感觉像长⼤了⼀些，变得独⽴且坚定，碰到多个问题时能够独⾃⾯对 独⾃解决，不再害怕未来会发⽣什么 ⽽是坚定的看见现在，感受当下时间的流动与感受。",
      "tutorCommentSummary": "这个学期，你能够在专业与学术发展上稳步提升，我其实并不意外。"
    },
    "futureDirection": "交互设计",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你如同一股清新而充满活力的风，为从经典研读到戏剧创作的全过程注入了独特的魅力与温度。你以出色的共情力、幽默\n感与表演才华，不仅让自己深度融入学习，更极大地感染和凝聚了身边的同伴，是课堂与剧团中不可或缺的“氛围担当”与\n核心演绎者。在课堂上，你的参与感很高，发言常常视角独特，引人入胜。而这一切，在你的戏剧才能中得到了极致发\n挥。在剧本创编中，你敏锐地选取了 《红楼梦》中“刘姥姥进大观园”这一充满戏剧张力和文化碰撞的经典桥段，并将其巧\n妙地置换成现代社会“新转入学生”面对陌生环境、不同圈层文化时所遭遇的困惑、试探与融合的困境。这个创意不仅机智\n幽默，更蕴含深刻的社会观察与人文关怀，显示了你将古典叙"
      },
      {
        "name": "大学统计学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hi Moe,\nYour hard work, focus in class, and high-quality homework assignments demonstrate a serious commitment to \nmastering statistics. You have built a very strong foundation! To further your growth, I encourage you to be more active \nin our class discussions. Paying closer attention to specific d"
      },
      {
        "name": "English Advanced 1（B2）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Moe is a student with undeniable creative flair and an original perspective. However, her progress this semester has \nbeen significantly hindered by a persistent lack of focus and a reluctance to engage with the curriculum's requirements. \nEven during one-on-one tutorials, Moe struggles to remain fo"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Moe demonstrated solid mastery. Her focus on why subcultures \nspread via media among teenagers, evolving from niche to mainstream, highlighted a perceptive grasp of cultural \ndynamics. She handled the literature review well-structured, effectively "
      },
      {
        "name": "大学计算机科学原理 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "I always look forward to viewing Moe's project. She is very creative and has completed many engaging and fun projects \nsuch as \"Guess Who\", \"CSP Super Tutor\". She knows how to use code as a material to create products and \ndemonstrates great experimental design skills. However, her reading ability m"
      },
      {
        "name": "平面构成与品牌",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你在时间安排上表现得非常出色，能够游刃有余地推进并完成各个项目，体现了良好的自我管理能力。若在此基础上，适\n当放慢节奏，将更多精力投入到对细节的打磨与深化中，会让作品呈现出更高的完成度。部分设计其实仍有进一步优化的\n潜力，若能在“完成”之后多停留一步，进行反思与调整，相信你的整体表现会得到显著提升。同时，可以多花一些时间整\n理一下你的碎片化想法，筛选出重点这样在项目表达和制作中会更加有序。"
      },
      {
        "name": "创作时刻",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "从作品的表现手法与呈现方式来看，你尝试了许多有趣且多样的材料，能够清晰地感受到你天马行空的创意，以及将想法\n落实为具体画面的能力。同时，你也在基础训练中进行了积极的尝试，展现出良好的学习态度。结合你的专业方向，建议\n你在进行基础练习时，多花一些时间观察与思考，再下笔创作，这样往往会比直接“看到什么就画什么”获得更深的收获。\n如果是临摹类练习，也可以在完成后进一步反思原作在表现方式、结构或笔触选择上的原因，从而加深理解，并逐步转化\n为自己的创作经验。这种练习可以让你自己多元的想法来更好的落地。"
      },
      {
        "name": "体育：综合格斗",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "子墨同学在综合格斗课程中具备一定的理解能力，能够在到课时认真完成训练内容，对基础动作和课堂要求有基本认知。\n但本阶段请假次数较多，训练的连续性受到一定影响，部分技术未能得到充分巩固。建议后续尽量保证稳定出勤，通过持\n续参与训练，逐步提升身体协调性与技术熟练度，帮助孩子建立更好的运动习惯。"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Moe 在未来规划课程中的表现一直让人很放心。从对自我的理解，到目标的判断，再到实际推进的事情，你身上有一种\n很难得的自觉和潜力，也能看出你是真的在为自己的未来做选择。\n这次拿到荣誉学生的有条件录取，是对你能力和潜力的一次重要认可，也说明你已经站在一个很不错的起点上。接下来，\n更关键的是把想法落实得更扎实一些，尤其是在英语准备上，需要更强的执行力和持续投入。只要这一块真正跑起来，你\n的整体可能性会被进一步放大。"
      }
    ],
    "academicStrength": "Excels in 大学统计学 I and 3 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "王奕涵",
    "name": "王奕涵 Harvey Wang",
    "chineseName": "王奕涵",
    "className": "⼗⼀年级问源班",
    "tutorName": "Chen Zhixiu",
    "gpa": 2.5625,
    "photo": "/photos/王奕涵-X.jpg",
    "strengths": [
      "体育：足球"
    ],
    "weaknesses": [
      "语文 III",
      "大学微积分 I",
      "荣誉中国研究"
    ],
    "activities": [
      "⚽ Football",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 本学期成长⽬标\n\n学业：标化：托福80；校内：calculus4 mechanic3 economics4 China study4 Chinese3 English4 PE5；兴趣爱好：\n赛艇：省冠军赛前6，⾹港锦标赛前三（男⼦双双open）2000划船机进7:00，体重70+；校园⽣活：晚上10:30前睡\n早上5:30前起床，睡前拉伸➕ 放松\n\n1：⽤课余时间刷题，周末上课\n2：上课认真听课，下课整理笔记\n3:及时订正作业\n4:⽇常训练照旧，周末加训\n5: 好好吃饭，增加能量补充（蛋⽩粉，⼩零⾷）\n6:每天晚上泡沫轴放松，拉伸，10:30之前睡觉",
      "selfReflection": "在这⼀个学期中，赛艇是我形影不离的伙伴，每时每刻赛艇都对我有很⼤的影响。这个学期我参加了⾹港赛艇锦标赛，并\n且从中以7:42获得男⼦轻量级双双第⼆，8:25刷新个⼈单⼈艇PB，并且在我⽇常的1000⽶测试和2000⽶测试中我也在⼀\n直进步，期中1000⽶的最好成绩也提升到了3分30，2000⽶提升到了7分30秒，5000⽶配速到了1:59.8，4000⽶配速到了\n1:57.9，这些对我来说都是很⼤的进步，可是光有这些硬实⼒的进步是远远不够的，除了硬实⼒的进步，我在这学期也着\n⼿开始思考我在赛艇⽅⾯能有什么深⼊，我希望我并不是⼀个只注重于赛艇运动本⾝，更多的是⽤赛艇这项运动想我周围\n的⼈展现我的社会影响⼒，如在这个学期我来到了上海在世界赛艇锦标赛中当志愿者，并且和许多来⾃世界各地的顶尖赛\n艇运动员讨论赛艇相关的⽂化。\n说完赛艇，我再来说⼀说我的学业。在这⼀个学期中，学业肯定是重中之重，每个⼈都在为着更好的分数⽽努⼒，我也不\n例外。在这⼀个学期中我开始了CL课程的学习，并且加强了托福的学习，我在这个学期感受到了学术的巨⼤压⼒，让我\n感到有点忙不过来了，相⽐之前的学习作业变难了，量变多了，但是我相信我可以慢慢适应这样的学习节奏。总⽽⾔之，\n这个学期相⽐上个学期学习压⼒变⼤了，当然我对学习的兴趣没有减少，因此我觉得这个学期还是算不错，在赛艇和学术\n上都有所成就，希望下⼀个学期可以做好AP⼤考最后的冲刺。",
      "tutorComment": "⼩王同学：\n回顾这学期，你⼀度处于被学业和训练反复拉扯的状态中，在迷雾中摸索着，缓慢前⾏。虽然前路充满了不确定性，但你\n依然在努⼒寻找属于⾃⼰的节奏。\n在学业上，看到你周末⼀直在坚持标化学习，这份毅⼒值得肯定。希望你能利⽤寒假潜⼼闭关，争取在新的考试形式下实\n现突破，为⾃⼰打开更多的机会之门。校内科⽬⽅⾯，由于选修课难度提升，加上语⾔关尚未攻克，你确实显得有些⼿忙\n脚乱，应接不暇了。客观地说，之前你投⼊在专业课上的时间远远不够，导致落下的内容较多。这个寒假对你⾄关重要，\n必须靠⾃⼰主动补弱，才有可能实现逆风翻盘。到了紧要关头，学会给各项事务排好优先级，懂得适当取舍，也是⼀种⼤\n智慧的策略。期末的素养答辩虽然准备得略显仓促，但在打磨过程中，我看到你有明显的认知提升和进步。你有很⼤的潜\n⼒，但时间⾮常有限，从此刻开始必须全⼒以赴了。\n在活动⽅⾯，⾃从你更换了体重适配的搭档后，终于在双⼈赛中有所突破，可喜可贺！既然现在已经明确了⾃⼰的发展路\n径和赛艇的定位，相信你能腾出更多的课后时间。关键在于如何妥善利⽤这些空档，千万不要因为缺乏明确规划，⽽迷失\n在虚⽆的⼈际交往中。集体⽣活对你来说从来不是问题，你有很强的规则意识，⾏为规范也⼀直很好。建议尽量避免陷⼊\n狭隘的“排外关系”，多和不同的⼈互动交流，⽐如每周三的⾜球运动，就是⾮常不错的调剂。\n为⼈处事上，能明显感觉到你的脾⽓有所改善，也平易近⼈了许多。即使在感受到挑衅时，你也表现出了极强的⾃制⼒，\n⽐以前更加沉稳了。希望你继续保持，不要轻易受他⼈影响，逐步建⽴起⾃⼰独⽴的是⾮观和价值观。在你内核⾜够稳定\n之前，尽量远离是⾮纷扰，做好⾃⼰的本分，毕竟⽬前的学业状况需要你百分之百的专⼼投⼊。",
      "selfReflectionSummary": "这学期也着 ⼿开始思考我在赛艇⽅⾯能有什么深⼊，我希望我并不是⼀个只注重于赛艇运动本⾝，更多的是⽤赛艇这项运动想我周围 的⼈展现我的社会影响⼒，如在这个学期我来到了上海在世界赛艇锦标赛中当志愿者，并且...",
      "tutorCommentSummary": "这学期，你⼀度处于被学业和训练反复拉扯的状态中，在迷雾中摸索着，缓慢前⾏。"
    },
    "futureDirection": "机械工程",
    "courses": [
      {
        "name": "语文 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "本学期老师看到了你潜藏于心的细腻感触与创作潜力。当你投入时，你能展现出对文本的独特理解和联系现实的能力，这\n从你构思的剧本中可见一斑。当你有时积极参与讨论时，你的观点往往能触及文本的深层意蕴，这表明你具备良好的感悟\n力和理解力。更重要的是，你在剧本创作中所展现的构想——将 《红楼梦》中“黛玉探园”所蕴含的观察、感怀与孤寂感，\n与一位名为“林雨”的现代角色的故事相结合——这本身就是一个非常富有诗意的创意。然而，学业进步是一场需要全程投\n入的马拉松，希望你在课堂参与率更高，同时提高作业提交率，期待更优秀的你！"
      },
      {
        "name": "大学微积分 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "In this semester, Harvey has barely met expectations, with his performance constrained by other commitments. He is \ncommendable for his proactive approach to clarifying doubts after class. However, his intensive training schedule leaves \nminimal time for review and practice, leading to delayed assig"
      },
      {
        "name": "English Intermediate 3（B1+）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Dear Harvey, your performance this semester is about satisfactory. I cannot say your focus span is not long enough \nbecause you seem to be able to do work independently given enough time. You do not respond to cues sometimes, yet \nyou can give insightful and accurate answers at times,  maybe because"
      },
      {
        "name": "荣誉中国研究",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "Throughout the G11 China Study field investigation, Harvey demonstrated masterful command. His focus on how self-\nmedia and official media reported the 2025 US-China trade war was timely and insightful. He handled the literature \nreview adeptly, effectively comparing key reporting biases and narrati"
      },
      {
        "name": "大学经济学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Harvey, you are undeniably one of the sharpest students in the room; your ability to grasp complex economic theories \nso quickly is a clear sign of your intelligence. However, I have to be direct with you about a habit that is holding you \nback: I often notice you leaning over your desk or even nodd"
      },
      {
        "name": "大学物理 I: 力学",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "This semester has been relatively challenging and your results have not reflected your potential. When you engage with \nthe materials, you show logical reasoning skills and some grit, as you usually complete the questions you feel \ncomfortable with and reach out for help at times. The main barrier h"
      },
      {
        "name": "体育：足球",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Harvey shows very good skill and coordination steps specially in the physical aspects. He is a very fast and secure \ngoalkeeper .Harvey is undoubtedly the most physically gifted student on the soccer team. He's fast over short distances \nand also has endurance. He has a lot of muscle mass and fibril"
      },
      {
        "name": "未来规划 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "本学期的未来规划课程主要聚焦深入大学申请全面评估政策、构建大学申请长名单、筹备申请材料。在第一单元里，你能\n紧跟老师的节奏，盘点当下的校内学术情况、制定托福考试时间线和备考计划，通过模拟招生官活动深入理解校内学术在\n申请中的重要性。在第二单元里，你向内梳理了符合自己价值观的选校标准（体育氛围、交通便利、国际交换等），并同\n时通过多场大学展、搜索Cialfo数据库、参与校友返校日等途径进一步探索了美国的大学。在第三单元里，你初步浮现了6\n个课外活动清单，制作了个人简历，并提炼了你的申请形象。正如我们三方面谈及一对一面谈中提及的，当下任务的优先\n级是：提升校内学术表现、托福冲刺90+；下学期Cap"
      }
    ],
    "academicStrength": "Excels in 体育：足球",
    "academicWeakness": "Needs improvement in 语文 III and 4 other course(s)"
  },
  {
    "id": "王越舟",
    "name": "王越舟 Robin Wang",
    "chineseName": "王越舟",
    "className": "⼗⼀年级问源班",
    "tutorName": "Chen Zhixiu",
    "gpa": 2.2,
    "photo": null,
    "strengths": [
      "Academic Excellence",
      "Creativity",
      "Analytical Thinking",
      "Teamwork"
    ],
    "weaknesses": [
      "大学微积分 I",
      "English Intermediate 3（B1+）",
      "荣誉中国研究"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 校内成绩和标化考试\n 雅思成绩提升⾄6.0，校内微积分、python应⽤编程努⼒达到5，CSP保4冲5，在AMC12中去冲前5%\n\n上课认真听讲，做好预习复习。\n每天背单词，学习英语\n在空余时间学习编程、AMC相应知识\n 兴趣爱好\n 在编程社中完成不少于两个项⽬，继续校内晨会主持\n 在编程社认真制作项⽬，在有多余时间时接主持⼈\n每天学习编程项⽬分枝技能",
      "selfReflection": "Not available",
      "tutorComment": "越⾈同学：\n这学期你迈着不紧不慢的步⼦，在⼤家的推搡和陪伴下⾛完了全程。回过头看，这段时光是否如你我所愿般充实？时间流\n逝之快令⼈感叹，为师希望你的成长步伐能再快⼀些，紧紧跟上这宝贵的青春。\n在学业上，标化考试的准备终于启动了，踏出这⼀步⾄关重要，我相信这会是个良好的开端。但在校内学业上，个别科⽬\n依然因为拖拉作业的习惯⽽受到影响。观察你的课余时间，似乎并没有被⾼效利⽤，⽽是容易在⼀些缺乏明确意义的⼈际\n交往中悄悄溜⾛，这⼀点我曾反复提醒，不知你是否能听得进。请务必优先完成每天的基本学习任务，并花⾜够的时间去\n复习那些模糊的知识点。你有着不错的逻辑思维，数学建模⼤赛的获奖也证明了你的潜⼒，明明可以学好，却似乎总缺了\n⼀股狠劲。⽬前的校内成绩和标化情况都不容乐观，如果再不发⼒，未来的遗憾恐怕会难以弥补。\n校园⽣活⽅⾯，你的个⼈⾏为⽐较稳重，从来没什么⼤问题。可你明明是个多才多艺、天赋满满的男⽣，却总是缺乏深⼊\n精进的动⼒。你需要的是坚持下去的毅⼒和克服困难的韧性，⽽不是⼀遇到需要费⼒攀爬的⾼⼭，就转头去找另⼀块容易\n⼊门的平地。\n为⼈处事上，你⼼地善良，总是很在意周围⼈的感受，但其实⼤可不必为了迎合他⼈⽽忽略了⾃⼰。有时候，学会享受独\n处也是⼀种能⼒。你需要加强⾃⼰的内核，放下所谓的“偶像包袱”，不要太在意同伴的眼光，也不要为了逞⼀时的⼝⾆之\n快⽽表现出幼稚的⾔⾏。当你逐步建⽴起属于⾃⼰的价值观和是⾮观，学会独⽴思考时，你才能真正活出⾃我。",
      "selfReflectionSummary": null,
      "tutorCommentSummary": "这学期你迈着不紧不慢的步⼦，在⼤家的推搡和陪伴下⾛完了全程。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你给人的印象是低调沉稳、善于思考。 在课堂讨论中，你或许不是发言最频繁的，但每一次发言都经过深思熟虑，言之\n有物。而在朗诵或表演中，你又能突破内敛，展现出充沛而真挚的情感表达力。剧本创作环节，你精准地抓住了《红楼\n梦》中“宝黛共读《西厢》”这一经典片段的精神内核——对超越功利的精神契合的追求，并将其提炼为对当代功利主义社会\n下“无用之用”价值的深刻反思，立意高远。你创造性地采用“平行蒙太奇”的拼贴手法，将古典情境与当代大学生共享文艺\n片的场景并置。为使这份杰出的构思与深邃的思考，在学术性书面表达中也能达到同样的高度。如果建议的话，那就是可\n以在“议论文表达”上更进一步：着重提升逻辑的严密性与语"
      },
      {
        "name": "大学微积分 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Robin has barely met the expectations this semester, maintaining a consistent but modest level of performance. While \nhe possesses latent potential, a somewhat passive attitude has hindered his progress. He faces a considerable hurdle \nwith the English language, which is compounded by late submissio"
      },
      {
        "name": "English Intermediate 3（B1+）",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Dear Robin, your learning performance this semester is unsatisfactory, this is reflected through your constant late \nsubmissions and inactive participation in class. I find it confounded as to how you can push yourself harder. For reading, \nthe reading speed is a key as for now, you are still strugg"
      },
      {
        "name": "荣誉中国研究",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "Throughout the G11 China Study field investigation, Robin demonstrated promising growth. He steadily built skills \nacross stages. His topic selection initiated a foundational exploration of media themes. He handled the literature review \nby beginning to connect relevant ideas, with room for deeper s"
      },
      {
        "name": "大学计算机科学原理 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "In general, Robin has built better learning habits compared to last semester. He could submit the majority of his \nassignments on time except the last PA. Robin is interested in Internet safety and has tried to learn more beyond the \nclass requirement. However, Robin relies on translation too much a"
      },
      {
        "name": "Python应用编程 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "王越舟同学很高兴看到你坚持了下来，完成了每一项作业。这门课程的难度很大，对你提出了更高的学习要求。你的个人\n网站和你的用户跟踪系统都做得很好，希望你再接再厉，在下学期表现得更好！"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "王越舟在本学期的体育课里传盘能力有了很大地提升，可以在比赛里完成关键的传盘甚至助攻，很好地完成了战术要求的\n团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "舟舟，很高兴看到你这个学期的状态在慢慢回温！无论是微积分还是 Python，你都选择了更高难度的课程并扎实推进；\nHIMCM 的圆满完成与获奖，也为这段努力写下了有力的注脚。\n“申请已经开始啦！”——这大概是我课上说得最多的一句话。本学期的未来规划课程，我们聚焦理解高校的全面评估机\n制、学习查校与选校的方法，并同步启动了简历等申请材料的准备。我能清楚地看到你有不错的积累与潜力，但更希望它\n们在行动中被稳定地呈现出来。\n这个寒假，希望你一方面好好休息，另一方面也别忘了，这是语言考试冲刺的黄金期。\n我对你的潜力有信心，更期待看到你把潜力“落成”可见的进步。下学期我们一起把节奏跑顺、把材料做实，让你"
      }
    ],
    "academicStrength": null,
    "academicWeakness": "Needs improvement in 大学微积分 I and 3 other course(s)"
  },
  {
    "id": "盛馨谊",
    "name": "盛馨谊 Elaine Sheng",
    "chineseName": "盛馨谊",
    "className": "⼗⼀年级问源班",
    "tutorName": "夏梓元 Emily",
    "gpa": 4.4,
    "photo": null,
    "strengths": [
      "语文 III",
      "大学统计学 I",
      "English Advanced 2（B2+）"
    ],
    "weaknesses": [
      "English Advanced 2（B2+）",
      "未来规划 III"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🎤 Debate",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 成绩全4\n 1.认真完成平时作业\n2.认真考前复习\n 托福100+\n\n1.平时抽时间做托福练习\n2.每周完成⼀篇阅读\n3.每周完成两篇写作",
      "selfReflection": "Not available",
      "tutorComment": "亲爱的Elaine，\n⾸先祝贺你凭借⾃⼰的努⼒，稳扎稳打渡过了这⼀漫长的学期！\n在这个学期，我看见了你在繁杂的活动中依然可以保持⾃⼰的学习节奏：在运动赛场上能够看到你果敢灵动的⾝姿；舞台\n上你优雅⼤⽓的艺术才华打动着每⼀位到场观众；专业分享⾥，你成熟稳重地在台上台下与来宾分享交流；⽽在个⼈学术\n专业上你也能够稳定发挥，从⽽在今年成功跻⾝荣誉学院。看着你从容地由上半学期“热闹⾮凡”的活动场切换到下半学期\n投⼊且沉静的学习模式，作为你的导师都为之叹服。同时，我也很⾼兴地看到在更多地⽅感受到了你对⾳乐的热情和对社\n区的影响⼒，相信你在这段时间所总结出的学习经验、对⽬标与路径的管理⽅法以及收获的胆识和勇⽓，都会成为你未来\n宝贵的财富之⼀。\n当然，我也能够感受到这个漫长学期带给你的压⼒和疲惫，好像有很多感受和收获还没能来得及被好好整理就被推着进⼊\n下⼀个任务。所以接下来的寒假，最重要的事情就是好好“休息”，回顾和总结这学期的“得失”，也是时候充分地汲取“⽣活”\n的养料，相信这会帮助你在专业纵深和个⼈创作上得到更多灵感。期待下学期能看到你在专业领域继续深化，探索更多创\n意的产出与表达；在素养⽅⾯有更多企业家精神板块的发展，也希望下学期的社团、capstone等新的挑战让你收获得更\n多、更全⾯地展现⾃⼰创意和领导⼒的机会。接下来的⽇⼦，我们继续⼀起加油吧～",
      "selfReflectionSummary": null,
      "tutorCommentSummary": "这个学期，我看见了你在繁杂的活动中依然可以保持⾃⼰的学习节奏：在运动赛场上能够看到你果敢灵动的⾝姿；"
    },
    "futureDirection": "音乐剧导演",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你展现了一种独特的“静水深流”式的力量。外表温婉内秀，内心却蕴藏着极具戏剧性的情感张力与卓越的创意构思，这份\n对比鲜明的特质，让你在从经典细读到剧本创作的完整过程中，留下了一系列深刻而令人难忘的印记。你为人温婉内秀，\n沉静而专注，这份气质使你能深入地沉浸于《红楼梦》的文本世界，进行细腻的品读。然而，在你所构思的戏剧世界中，\n却迸发出惊人的情感张力与结构巧思。这种“静”与“动”的内外反差，正是你作为创作者的独特优势。你创作的《园内有流\n量》，构思精妙。你将 《红楼梦》中充满文化碰撞与世情百态的“刘姥姥进大观园” 这一经典情节，与现代职场生态、网红\n文化和流量逻辑进行了大胆而贴切的拼贴。揭示了不同"
      },
      {
        "name": "大学统计学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hi Elaine,\nYour dedication to this course is evident through your hard work, active participation, and the high quality of your \nhomework assignments. You have a great momentum! To continue growing, I suggest focusing on the nuances of basic \nstatistical interpretation and mastering concepts that ar"
      },
      {
        "name": "English Advanced 2（B2+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Elaine is consistently attentive in class and shows a clear desire to learn and improve. She reliably contributes when \ncalled upon, and I believe she certainly has the English ability to participate even more than she currently does. Going \nforward, I encourage Elaine to take more initiative in dis"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Elaine demonstrated refined excellence. Her investigation of \ncontroversies in human-AI collaborative media creation and potential solutions was sophisticated, tackling ethical \nfrontiers. She handled the literature review masterfully, effectively "
      },
      {
        "name": "大学经济学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Elaine, you are a truly bright and diligent student who shows a natural aptitude for economics. Your focus in class is \nexemplary, and I always appreciate your active participation and the insightful way you tackle classroom discussions. \nYou clearly have a strong grasp of the fundamental concepts, "
      },
      {
        "name": "大学乐理 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Elanie is a steady and diligent student who approaches her learning with focus and care. You listen attentively in class, \nconsistently complete in-class tasks, and often bring your own thoughtful insights to the material. Throughout this \nsemester, you’ve built a solid foundation in music theory, a"
      },
      {
        "name": "主修乐器 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Elaine，你对歌唱和舞台的热爱是这学期最打动老师的地方。你不仅主动学习了大量新作品，而且每一首都认真打磨，完\n成度很高——无论是流行歌曲的情感表达，还是音准节奏的稳定性，都展现了你的用心。你在排练中总是充满能量，也愿\n意反复尝试不同的处理方式，这种积极的态度非常可贵。接下来的小建议是：多关注气息的支撑与控制。扎实的气息基础\n不仅能让你唱得更轻松，还能帮助你在高音或长句中保持声音的稳定和表现力。相信只要在技术细节上再下一点功夫，你"
      },
      {
        "name": "体育：美国体育舞蹈",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你在课堂上的刻苦精神是有目共睹的。每一次练习你都全神贯注，这种踏实的作风让你的动作非常标准。你极强的综合能\n力让你在应对各种风格的曲目时都能快速适应。\n 在啦啦操中，动作的爆发力非常关键。目前你的动作虽然准确，但力量感稍欠火候。建议你在课后加强手臂和腿部的小\n力量训练，让每一个定点动作都像箭一样有力。\n老师希望你继续保持认真的学习态度，同时在力量与节奏的控制上寻找新突破。期待下学期能看到你以更具震撼力的动作"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Elaine，你真称得上云谷的“代言人”。还记得那次文理学院大学展，演讲彩排结束后，你有些“怯生生”地跟我说，这是你第\n一次面对如此大型的公众演讲。那一刻我既惊讶于你的勇气，也由衷佩服：第一次登场，竟能做得这么好。你的松弛感与\n临场表现力，给了你稳定的舞台存在，你不被舞台的边界束缚，反而把舞台延展成自己的成长的天地。\n说到临场表现力，就不得不提你在校内的多次演出。每一次都有不同的惊喜与感动：不仅因音乐本身的闪耀，更因你对热\n爱的持续投入与笃定。\n恭喜本学期顺利转正荣誉学院！用你的话说，这是一个坚毅又收获满满的学期，回头看才发现，不知不觉完成了这么多\n事。最让我印象深刻的，是我们讨论“要不要向康"
      }
    ],
    "academicStrength": "Excels in 语文 III and 8 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "缪子妍",
    "name": "缪子妍 Violet Miao",
    "chineseName": "缪子妍",
    "className": "⼗⼀年级问源班",
    "tutorName": "夏梓元 Emily",
    "gpa": 3.1555555556,
    "photo": null,
    "strengths": [
      "荣誉中国研究",
      "荣誉心理学 I",
      "主修乐器 I"
    ],
    "weaknesses": [
      "荣誉预备微积分 I",
      "大学经济学 I"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🎨 Crafts",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": "Not available",
      "selfReflection": "这个学期的我，和上个学期相⽐，有了很多明显的变化。最重要的⼀点是，我变得更勇敢了。这种勇敢不是突然变得很厉\n害，⽽是即使知道⾃⼰不完美、会失败，也还是愿意⾛上前去。这学期，我第⼀次站上舞台演唱《桃花笑》。说实话，我\n并不是专业的歌⼿，唱歌只是业余爱好。站在台上时，我能清楚地感觉到⾃⼰的紧张：声⾳在发抖，⽓息不够稳定，上台\n前甚⾄⼀直在害怕会不会唱砸。舞台设计也是我第⼀次尝试，灯光很简单，⼤部分时间只是浅蓝⾊的全台灯光，副歌才有\n粉⾊桃花形状的灯光移动，动作也不多，没有那么震撼。我知道，从专业⾓度看，这次演出并不完美，甚⾄没有达到我原\n本的预期。但这是我第⼀次真正站在聚光灯下，把⾃⼰交给舞台本⾝。对我来说，这已经是⼀种突破。\n除了舞台上的挑战，我也正视了⾃⼰的失败。在学习上，我曾以为⾃⼰可以学好⼤学经济相关的内容，但现实却让我清醒\n地认识到⾃⼰的不⾜，成绩并不理想。这种落差让我失落过，也怀疑过⾃⼰，但我开始学着接受失败本⾝，并反思未来如\n何调整⽅向，⽽不是⼀味否定⾃⼰。当然，这个学期也有让我感到骄傲的时刻。我成功主持了⼀次⽣⽇会，为⽣⽇的同学\n策划并送上⽣⽇祝福，让⼤家⼀起吃到了蛋糕、感受到被重视的温暖。这件事让我意识到，⾃⼰的⾏动是可以真正影响他\n⼈的。更重要的是，我的⼼态发⽣了变化。我不再⼀味讨好别⼈，也不再⼩⼼翼翼地委屈⾃⼰。当被欺负时，我学会了为\n⾃⼰发声、为⾃⼰反击。这学期的我，开始学着坚定地⽣活，哪怕还不完美，也愿意继续向前。",
      "tutorComment": "亲爱的喵喵：\n⾸先祝贺你凭借⾃⼰的努⼒和勇敢，稳扎稳打渡过了这⼀漫长的学期！\n在这个学期，我看到了⼀个⾮常有⽬标感和⾃主性的缪⼦妍。对于优势学科，你能够找到适合⾃⼰的学习⽅式取得好成\n绩，对于弱势学科你也能够不放弃，顶住压⼒努⼒去攻破，为你的坚韧点赞；在周⼀晨会上，你总是台风沉稳地为⼤家主\n持晨会，开启新的⼀周；在团队和社群中，你很善于找到⾃⼰位置并努⼒对集体产⽣积极影响，是个“合作型领导者”。⽽\n期末的素养答辩，你也表现得⾮常出⾊，你从容⽽精准地表达着你在团队中决策时的关键重点，分享你在素养发展⽅⾯的\n得与失……相信回顾这个学期，你⼀定在学术和⽣活上都能看到⾃⼰的蜕变。\n当然，我也能够感受到了这个漫长的学期带给你的“波澜”。或许是很多事务和⼈际的压⼒交织，让你⼀时间⽆法看清和承\n担；也许是作为团队中⾮常有责任感的⼀份⼦，很多时候想冲在前⾯帮其他⼈多分担⼀些……正如当时我们所说的那样，\n把这些⼩插曲视作宝贵的成长契机，退⼀步或许就能在看到别⼈的同时也看到⾃⼰。作为你的导师，我⾮常钦佩你在危机\n时刻向前⼀步打破僵局的勇⽓，也为你的坦率真诚⽽感动，但有时候在情绪上做决策并⾮⼀个好的时机，再好的初⼼也可\n能会因为处理的时机和⽅式⽽把事情推向我们并不期望看到的⽅向；总是⼀味地给予帮助有时候也不⼀定会有好的效果，\n毕竟他⼈的成长并不是你所必须承担的责任；⽽⽆论什么时候都请不要忘记你当下的⾓⾊，以及需要遵守的基本规则。所\n以，当我们再次想要冲动表达的时候，记得给⾃⼰和情绪留⼀点退让的空间。遇到冲突和挑战，也可以适当提醒⾃⼰慢⼀\n点去⾏动哦～\n加油缪缪，寒假好好休息。接下来的⽇⼦，我们继续⼀起奔着⽬标努⼒吧～",
      "selfReflectionSummary": "这个学期的我，和上个学期相⽐，有了很多明显的变化。",
      "tutorCommentSummary": "这个学期，我看到了⼀个⾮常有⽬标感和⾃主性的缪⼦妍。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你不仅是课堂讨论中积极的贡献者，你思维活跃，富有创新精神，总能提出新颖的见解和解决方案。在课堂上，你的参与\n度极高，乐于分享，善于激发讨论。而这份天赋在你热爱的戏剧领域得到了极致绽放，你表演能力强，能生动地塑造角\n色，富有感染力。最令人赞叹的，是你将这些能力融会贯通于你的剧本创作《落花》之中。你巧妙地运用了平行结构，将 \n《红楼梦》中“黛玉葬花”这一极具美学与哲学意味的经典情境，与一位现代女学生“灵清雨”安葬流浪猫的私人仪式并置。\n这种连接超越了简单的比喻，表达对美好生命易逝的深切哀悼，以及对“洁净归处”的精神执念。对你的期待是可以在“议论"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Violet achieved an overall rating of \"Growing.\" She participated actively in class and completed her project well. \nHowever, her daily homework quality was average, and her exam scores, especially her final exam result, were \nsignificantly low. This points to a lack of depth in understanding and app"
      },
      {
        "name": "English Intermediate 2（B1）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Dear Violet, I am really pleased for you being in my group this semester. You are an invaluable addItion to us as you \nhold this sincere attitude for everything we do and you are prompt in participating in any kind of learning activity. Your \nattitude of learning is great, for better and quicker ach"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Violet demonstrated mastery. Her focus on short video idealized \ncouple content's impact on teens' love expectations was empathetic and relevant. She handled the literature review \nwell, effectively integrating key psychology and media effects. Vio"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "It has been rewarding to witness your growth this term. While the first half of the semester seemed like an adjustment \nperiod for you, your performance in the second half has been remarkable. You clearly found a study method that works, \nas demonstrated by your stronger grasp of concepts and much m"
      },
      {
        "name": "大学经济学 I",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Violet, it was a pleasure to see the incredible drive and passion you brought to the classroom at the beginning of the \nterm; your early momentum really set a high bar. However, as the material became more complex, I noticed that you hit \na bit of a plateau and your pace started to slow down. In eco"
      },
      {
        "name": "主修乐器 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Violet，你是个很有想法的学生，每次准备表演都会认真思考角色、情绪和舞台调度，这种投入让老师的印象很深。虽然\n一开始你显得有些紧张，自信心不足，说话轻声细语，动作也略显拘谨，但整个学期下来，老师明显看到你在一点点突破\n自己——眼神更坚定，声音更放开，表演也更自然了。这些进步或许你自己没察觉，但我们都能感受到。请相信，你的认\n真和努力本身就是一种力量。下学期继续勇敢站上舞台吧！不用追求完美，只要真实表达，你就已经很棒了。慢慢来，你"
      },
      {
        "name": "体育：游泳",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你对待游泳课程始终保持热情，训练中积极主动、刻苦钻研。自由泳速度不断提升，动作协调性越来越好；蛙泳核心要领\n掌握到位，细节动作持续优化。团队活动中，你主动担当，积极配合队友完成集体任务，团队意识极强。希望你继续保持"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "亲爱的Violet，恭喜你达成高一时规划的“想培养一个输出型爱好，在舞台上闪闪发光”目标。从群体阿卡贝拉表演，到本学\n期的两次独唱，你一点一滴的突破自我，在认真实践“成为最好的自己。”在这个学期里，我们讨论了未来的留学目的地 – \n加拿大、新加坡、或者西班牙/阿联酋。你在三方面谈上把自己从25年12月到26年11月都安排得妥妥当当的；同时还深度\n剖析了自己的申请形象“敏锐而富有创意的商业情感连接者。”在申请材料准备方面，你梳理了34个活动清单和1份完整的个\n人简历；这些筹备让你走在了申请准备度的最前方。接下来的主任务就是稳住校内、攻克雅思和AP，你可以的！Every"
      }
    ],
    "academicStrength": "Excels in 荣誉中国研究 and 3 other course(s)",
    "academicWeakness": "Needs improvement in 荣誉预备微积分 I and 1 other course(s)"
  },
  {
    "id": "肖麻懿喧",
    "name": "肖麻懿喧 Sean Xiao",
    "chineseName": "肖麻懿喧",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "李婷婷 Tingting",
    "gpa": 4.3666666667,
    "photo": null,
    "strengths": [
      "荣誉预备微积分 I",
      "English Advanced 2（B2+）",
      "荣誉中国研究"
    ],
    "weaknesses": [
      "English Advanced 2（B2+）",
      "荣誉心理学 I",
      "大学计算机科学原理 I"
    ],
    "activities": [
      "⚽ Football",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 雅思6.5 \t达成\n 12⽉之前出分6.5\n 每天⼀篇听⼒和⼀篇阅读⼀课单词\n 健⾝ \t基本达成\n 倾向于拉伸⾃⼰\n 每周找教练进⾏拉伸训练",
      "selfReflection": "这个学期学习的压⼒真的是陡增啊，开学的时候还没有从上学期的快乐⽣活中⾛出来。结果雅思出分考的稀烂燃起了我这\n学期的奋⽃之⼼。我这学期对⾃⼰在学术上的表现还是⽐较满意的，每天有规划的规律的学习让我第⼀次感觉到我由内⽽\n外的驱动⼒。",
      "tutorComment": "本学期是你展现出强劲“内驱动⼒”的关键阶段。你从学期初的迷茫中迅速调整，将雅思成绩的波动转化为奋⽃的⽕种，这\n种由内⽽外的转变令⼈欣慰。你不仅在学术上追求卓越，更在社交、体育和⾃我管理中展现出了⾼度的成熟度，成为了⼀\n个既有深度⼜极具幽默感的榜样学⽣。\n你正在完成从“被动学习者”到“独⽴思考者”的华丽转⾝。你拥有挑战⾼⽬标的勇⽓，也具备落实到细微处的耐⼼。下学\n期，请继续保持那份对知识的渴望和对⽣活的热忱，在打磨语法细节与整理思维逻辑的同时，继续⾃信地拥抱⾃⼰的独特\n优势。",
      "selfReflectionSummary": "这学期对⾃⼰在学术上的表现还是⽐较满意的，每天有规划的规律的学习让我第⼀次感觉到我由内⽽ 外的驱动⼒。",
      "tutorCommentSummary": "本学期是你展现出强劲“内驱动⼒”的关键阶段。"
    },
    "futureDirection": "经济/商业",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "肖麻懿喧同学课堂学习状态稳定而专注，思维敏捷，能够在小组与班级讨论中积极回应他人观点，展现出良好的理解\n力与参与度。他对学习有较高要求，作业完成及时，能够认真听取反馈并加以吸收。在《红楼梦》戏剧改编项目中，他承\n担重要表演任务，舞台呈现自然得体，能准确理解指导意见并迅速调整表现，体现出良好的学习吸收能力与合作沟通素\n养。 他在口头表达、舞台表现与临场反应方面优势明显，自信从容，台风稳健。         \n       希望懿喧同学在保持课堂专注与口头表达优势的同时，进一步加强书面表达训练。可以通过适量、有针对性的写作练\n习巩固语言组织能力，在阅读中主动积累优质语言材料，在撰写文章时，强化“观"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "Sean earned an overall rating of \"Beyond Mastery.\" His homework and project work were exceptionally strong, and he \nperformed excellently in both the midterm and final exams, demonstrating a solid mathematical foundation and strong \ntest-taking abilities. It is worth noting that his note-taking skil"
      },
      {
        "name": "English Advanced 2（B2+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Sean, in my view, clearly has a passion for English, and I appreciate how willing he is to speak his mind, clarify his \nthinking, and take language risks in our class. His participation adds energy and depth to our class, and it is a major \nstrength that he asks questions and seeks help when needed "
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hello Sean. It was a great pleasure having you in China Study this semester. Your active contributions to our class \ndiscussions were impressive, and you have a real talent for articulating your insights. While your oral expression is \nstrong, I can see significant room for future improvement in you"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "It is a delight to have a student like you in Honors Psychology. Your academic performance is a perfect reflection of your \npositive attitude and consistent effort. I can clearly see that you are not just listening, but actively thinking and building \nyour knowledge framework both in and out of clas"
      },
      {
        "name": "大学经济学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Sean, you are a remarkably bright student whose enthusiasm in class is truly infectious; your high completion rate on \nassignments and your impressive accuracy on quizzes are clear indicators of your strong grasp of economic principles. \nYou have a natural aptitude for the subject, and it is a pleas"
      },
      {
        "name": "大学计算机科学原理 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "I have greatly enjoyed having Sean in class this semester. He is attentive, participates actively in discussions, and \nseeks support from peers and myself when encountering challenges. Sean also manages his time effectively and often \ncompletes assignments ahead of deadlines.\nWe will dedicate increa"
      },
      {
        "name": "体育：足球",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Sean has improved in all aspects of the game and he did a very good practice tests. His physical condition is better than \nbefore performing well in the fitness test and he has improved his arms and upper body strength to use it as a defender. \nSean needs to improve his dribbling technique with more"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "首先，恭喜你收获了荣誉学院的 conditional offer。这份认可无疑成为了激励你前行的重要力量，也体现在你过去一个学\n期中稳步而扎实的表现上。看到你的投入与成长，我对你即将到来的申请季充满信心。\n本学期的未来规划课程围绕三个单元展开，帮助你理解基于全面评估政策的大学申请逻辑，学习查校与选校，并最终完成\n了你自己的大学清单。在系统回顾和梳理课外活动的过程中，你也完成了第一版activity bank和简历。这些看似基础的准\n备，实际上正在为未来的申请一步步夯实基础。\n在第一单元中，你能够紧跟课程节奏，通过模拟招生官案例分析，认真思考大学真正关注的核心要素，并同步梳理了当前\n七大申请材料"
      }
    ],
    "academicStrength": "Excels in 荣誉预备微积分 I and 7 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "胡优琪",
    "name": "胡优琪 Youqi Hu",
    "chineseName": "胡优琪",
    "className": "⼗⼀年级问源班",
    "tutorName": "杨晓晶 Jaye",
    "gpa": 1.9666666667,
    "photo": null,
    "strengths": [
      "未来规划 III"
    ],
    "weaknesses": [
      "语文 III",
      "大学微积分 I",
      "English Intermediate 2（B1）"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🎨 Crafts",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提⾼英语阅读和听⼒能⼒\n 本学期内阅读、听⼒⼩分上5.5\n\n⾏动⼀：⽇常听⼀些英语歌（momo和我说这个有⽤），还有⼀些含有英⽂的内容的视频。⾏动⼆：⽇常做精听，从\n短时间的开始，⽐如1分钟的⾳频开始慢慢的听，⼀周计划3-4篇。⾏动三：在学校的英语标化提升课上好好听，认真\n练习，标化提升课的阶段总评为4。\n 学科成绩稳定\n 本学期内，A3保持，微积分和经济保3争4（有5更好了，只是⽬前来看这个⽬标⽐较可⾏）\n ⾏动⼀：上课好好听，有问题及时的解决。⾏动⼆：每个单元结束当周，梳理本单元的知识点框架。⾏动三：保持\nA3的基本要求：平均总评3.5以上，作业准时提交率95%以上，每⽉的凌云积分最多扣2分，不拿T，宿舍保持整洁。\n 保持⼼情舒畅\n 本学期内，没有长时间（⼤概⼀个⽉）的焦虑情况\n ⾏动⼀：每周给⾃⼰⼀些完整的放松时间，就是不是⼀些简短的散乱的时间作为休息。⾏动⼆：⼯作⽇的时候给⾃⼰\n多安排⼀些事情，免得⼼闲脑⼦闲。⾏动三：通过⼀些⼩⽅法达到解压的⽬的，⽐如做做⼿⼯、吃顿好的。",
      "selfReflection": "Not available",
      "tutorComment": "亲爱的Youqi，恭喜你完成了这漫长⼜充实的G11第⼀学期！\n这个学期，你给⽼师们留下了⾮常⼀致⽽清晰的印象：认真、可靠、对⾃⼰要求⾼。⽆论是在学术学习中，还是在⼿⼯社\n团的投⼊与责任承担上，你都始终保持着稳定的投⼊度和踏实的态度，是那种让⼈放⼼、值得信赖的学⽣。⽼师们对你的\n评价普遍很⾼，也正是因为你总是愿意把事情做到最好。在学习上，你能专注听讲、认真完成任务，并持续推动⾃⼰进\n步。英语学习中，虽然表达偶尔会受到中式思维的影响，但你在整个学期⾥展现出了持续⽽扎实的进步，这背后是你⼀贯\n的勤奋与⾃我要求；在荣誉中国研究的学习与⽥野调查中，你的选题展现了独⽴思考的意识，也逐渐建⽴起⽂献梳理、研\n究规划与伦理意识等关键能⼒，能够主动迈出探索的步伐。这些都说明，你正在⼀条稳步向前的成长路径上，是你长期以\n来的努⼒的累积和能⼒的证明。\n展望未来，希望你在继续保持认真与⾼标准的同时，也能慢慢学会对⾃⼰多⼀些理解与耐⼼。英语和微积分的挑战，并不\n是能⼒不⾜的证明，⽽是需要时间、稳定状态和循序推进的过程；⽽你的学习态度、责任感和坚持，本⾝就是最重要的基\n础。尤其是在⾯对压⼒和不确定时，学会照顾好⾃⼰的⾝⼼状态，会⽐⼀味咬紧⽛关更有⼒量。你已经证明了⾃⼰能够踏\n实成长、持续进步，接下来更重要的是相信这⼀点。希望新的⼀年⾥，你能在更稳定的节奏中重新找回信⼼，把认真⽤在\n更长远的路上——你值得被期待，也值得被温柔以待。",
      "selfReflectionSummary": null,
      "tutorCommentSummary": "这个学期，你给⽼师们留下了⾮常⼀致⽽清晰的印象：认真、可靠、对⾃⼰要求⾼。"
    },
    "futureDirection": "商科",
    "courses": [
      {
        "name": "语文 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "你的严谨与专注，诠释了何为“学业的基石”与“合作的典范”。你不仅是事务上无可挑剔的语文课代表，更是学业上沉稳扎\n实的佼佼者。你对待学习非常认真，这份态度直接体现在你始终如一的、高质量的作业上——它们思路清晰、论述严谨、\n书写工整，是知识与思考的优质结晶。作为语文课代表，你细致负责，是老师与同学之间最可信赖的桥梁。在小组中，你\n是一位卓越的倾听者与整合者，能精准捕捉各方观点，并贡献出建设性的意见，你的存在让团队合作更加顺畅、高效。在\n你的戏剧创作中，你将舞台划分为“现实”、“内心”、“古典”三个区域，这不仅是物理空间的切割，更是心理空间、时空维度\n的诗意并置。它精准地外化了主人公林黯被现实压抑的"
      },
      {
        "name": "大学微积分 I",
        "grade": "F",
        "gradeNum": 0,
        "feedback": "Youqi’s performance has been unsatisfactory overall, exhibiting a sudden decline towards the end of the semester. \nWhile she performs adequately in daily assignments, there is a significant disparity in her test performance, likely \nexacerbated by language barriers and exam stress. She was managing "
      },
      {
        "name": "English Intermediate 2（B1）",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "Youqi is a diligent, self-motivated, and well-behaved student who approaches learning with a serious attitude. She \nlistens attentively in class and consistently tries her best to complete assignments. Although her expression is \nsometimes influenced by Chinglish patterns, she has shown steady and a"
      },
      {
        "name": "英语词汇强化",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Youqi is a pleasure to have in class. She is hardworking, diligent, goal-oriented, and highly self-disciplined. To move \nforward, she would benefit from more authentic English input, such as original videos, talks, and readings. At the same \ntime, she sometimes pushes herself too hard. Learning to s"
      },
      {
        "name": "荣誉中国研究",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "Throughout the G11 China Study field investigation, Youqi demonstrated growing potential with steady improvements. \nHer topic selection sparked media curiosity. She handled the literature review by touching on essentials, open to more \ndepth. Youqi’s fieldwork planning developed core elements with e"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "你是班上最让老师放心的学生之一。最让我印象深刻的不仅是你的分数，更是你处理信息的方式。你善于抓住关键概念并\n进行有效的复习，这显示了你学习习惯的成熟。虽然我偶尔也会捕捉到你稍显“松懈”的小瞬间，但这从未掩盖你整体的投\n入与努力。你已经找到了一种适合自己的节奏——高效、聪明且成功。为你取得的进步感到骄傲。\nYou are one of the most reliable students in the class. What impresses me most is not just your grades, but the way you \nprocess information. You h"
      },
      {
        "name": "大学经济学 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Youqi, you are a remarkably sharp student with an impressive ability to process information quickly. Your active \nparticipation in class discussions and your enthusiasm for answering questions consistently add energy to our lessons. \nIt has been a pleasure to see your steady progress throughout the "
      },
      {
        "name": "体育：综合格斗",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "胡优琪同学课堂表现认真，能够积极参与动作练习，对抱双腿摔技术掌握较好。她在练习中能够注意动作细节，并尝试自\n主调整动作完成度。建议在后续课程中继续保持专注，同时加强体能和力量训练，让动作更稳、更精准，并能在连续练习"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期你在未来规划上的表现一如既往。开放的心态让你在校园里收获了纯粹的友谊——大家踊跃为你“代抽奖”的课堂细\n节非常有爱。你在优势演讲中展现出的自我洞察力，也让老师印象深刻。在三方面谈达成将美国纳入进来的共识后，你快\n准稳地调整了脚步，这种适应能力非常难得。接下来，我们要开始为你的“梦中情校”做最切实的冲刺了，让我们一起排除"
      }
    ],
    "academicStrength": "Excels in 未来规划 III",
    "academicWeakness": "Needs improvement in 语文 III and 6 other course(s)"
  },
  {
    "id": "胡嘉乐",
    "name": "胡嘉乐 Jody Hu",
    "chineseName": "胡嘉乐",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "江宁 Johnny",
    "gpa": 3.6125,
    "photo": "/photos/胡嘉乐-J.jpg",
    "strengths": [
      "荣誉中国研究",
      "体育：综合格斗",
      "未来规划 III"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "💼 Business Club",
      "🎤 Debate"
    ],
    "growthPortrait": {
      "goals": " 雅思到5.5 \t基本达成\n 1.完成xhd每天布置的任务2.每天坚持背单词3.雅思阅读认真完成每⼀篇\n IEO和NEC拿到好成绩 \t基本达成\n 1.校内经济课认真完成 课前预习 PPT/教材，课后当天完成作业并整理知识点 2.课后看视频复习和刷题（包含AP和\nIEO真题）3. 每个单元结束后，整理公式+概念4.跟队友同步进度\n 平时成绩达到平均3以上 \t基本达成\n 1.作业认真完成2.坚持预习+复习3.注重考试成绩 4.考试前注重复习题⽬ 多做真题",
      "selfReflection": "我觉得这个学期对⽐之前有了很⼤的进步，上个学期开始的⼩红书账号，商赛教学也⼀直在继续，截⽌⽬前，帮助了很多\n同学在第⼀次参加YIS的时候就获得了超级⾦奖或者⾦奖。⾃⼰也顺带参加了⼀次，依旧获得超级⾦。这个学期开学初，\n阴差阳错的报名了AMC12，完全没准备，完全裸考，在下载证书的时候已经做好了是participation award的准备，结果没\n想到的是，下载下来⼀看是second place，真的特别惊喜，这个学期压⼒最⼤的地⽅应该是IEO，这是我第⼀次参加竞\n赛，队友们都特别厉害，ALevel⼏乎全是A星的学霸，所以我的压⼒真的很⼤，在考试期间我犯了很愚蠢的错误，我觉得\n很对不起他们，不过最后成绩出来，结果好像还可以，拿了⾦奖。我希望下个学期可以继续保持，早点把雅思考出来。",
      "tutorComment": "To Jody,\n这学期，⽆论是在学业上，还是在⼈际关系上，我都特别欣喜地看到你的蜕变与进步。你真的值得认真地给⾃⼰⼀个奖励\n——从最初的不适应，到逐渐适应，再到慢慢找到属于⾃⼰的路径，这本⾝就是⼀项⾮常了不起、也值得庆贺的成就。\n在素养答辩中看到你与商赛伙伴的合照，我看到了⼀个意⽓风发、有想法、有⽅法、也有⾏动⼒的你。虽然我只是通过照\n⽚和我们的交流，看见了你商赛经历中的⼀⼩部分，但仅是这些细节，我已然清晰地感受到你在过程中投⼊的专注、付出\n的努⼒，以及由内⽽外散发出来的热情——特别富有感染⼒，也特别动⼈。\n我相信⼀定会有⼀条道路适合你，很⾼兴你已经隐约看到了它的模样。只要持续探索、不断尝试，这条路⼀定会越来越清\n晰。\n⾝边有很多⼈⽀持你。所以，放⼼⼤胆地往前⾛吧，加油！\n导师\n江宁, 2026/02/02",
      "selfReflectionSummary": "我觉得这个学期对⽐之前有了很⼤的进步，上个学期开始的⼩红书账号，商赛教学也⼀直在继续，截⽌⽬前，帮助了很多 同学在第⼀次参加YIS的时候就获得了超级⾦奖或者⾦奖。",
      "tutorCommentSummary": "这学期，⽆论是在学业上，还是在⼈际关系上，我都特别欣喜地看到你的蜕变与进步。"
    },
    "futureDirection": "音乐编辑/环保",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "嘉乐，相较于上学期，本学期你在课堂上的专注度有所下滑，这直接影响了学习内容的消化吸收，作业质量也因此未能达\n到你的最佳水平。然而，在戏剧展演中，你成功塑造了鸳鸯这一角色，证明当你全心投入时，你完全有能力理解人物、表\n现角色。这份在特定情境下绽放的能力，正是你潜力的证明。是时候将戏剧舞台上的专注与认真，迁移到每一节语文课\n上、每一次作业中了。请找回那份对文字的敏感与投入，你的语文学习定能重回正轨，再现光彩！"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hi Jody,\nIt has been a pleasure having you in our Honor Statistics class. Your focus during our sessions is evident, and I \nappreciate the genuine effort you put into your studies. While you handle foundational tasks well, I’ve noticed that some \nof the more complex statistical concepts can occasion"
      },
      {
        "name": "English Intermediate 1（A2+）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Jody is currently facing significant challenges in the A2+ curriculum due to a very limited linguistic foundation. These \ndifficulties are compounded by frequent absences, which make it nearly impossible for her to follow the structured \nprogression of our lessons. At this stage, Jody is often unabl"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Jody demonstrated exceptional excellence and innovative thinking. \nHer focus on why the same content elicits vastly different public comments across various dissemination channels was \nmasterful, highlighting comparative media effects with sharp ac"
      },
      {
        "name": "大学经济学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hi, Jiale, your enthusiasm for economics is truly inspiring; I have seen how deeply passionate you are about the subject \nthrough your active participation in various business and economics competitions. Your drive to challenge yourself in \nthese arenas is impressive and demonstrates a strong compet"
      },
      {
        "name": "大学商业研究 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Jody shows strong interest, especially given her engagement in external business competitions. She excelled in the \nearnings call prep. While her written work is strong, she is a bit quiet in class and should fight for her participation points. \nFocusing on synthesizing content to anticipate debate "
      },
      {
        "name": "体育：综合格斗",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "胡嘉乐同学课堂态度认真，对摔柔技术表现出浓厚兴趣，能够在练习中投入较多时间和精力。她能够较好地理解动作原\n理，并在练习中注意动作细节。建议继续保持兴趣和专注度，同时在力量和体能方面进行适度补充训练，让动作完成更有"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Jody，这一学期，你们正式进入了大学申请准备的起步阶段。在未来规划课上，你完成了选校维度的梳理，设计了属于自\n己的梦校海报，初步产出了课外活动清单初步描写，并制作了个人简历。这些任务不只是作业本身，更是一次次对自我认\n知与未来方向的深入思考。\n你在商科道路上走得越来越坚定，也越来越自信。能明显感受到，你对未来方向的认知变得更加清晰，选校目标逐渐聚\n焦，心里有了“锚点”，行动起来也更有动力与节奏。\n让我一直很欣赏的是，你始终愿意把热情落到真实行动中。从频繁参与各类商赛，到尝试将自己的经验转化为帮助他人的\n能力，你不仅在积累实践，更在不断拓展对商业价值的理解。你身上那份主动、能量与执行力，在为你"
      }
    ],
    "academicStrength": "Excels in 荣誉中国研究 and 2 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "蒋嘉浩",
    "name": "蒋嘉浩 Justin Jiang",
    "chineseName": "蒋嘉浩",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "雷瑶 Yao",
    "gpa": 2.7375,
    "photo": "/photos/蒋嘉浩-E.jpg",
    "strengths": [
      "荣誉商科 I"
    ],
    "weaknesses": [
      "荣誉预备微积分 I",
      "English Intermediate 1（A2+）",
      "英语词汇强化"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "💼 Business Club",
      "🎤 Debate"
    ],
    "growthPortrait": {
      "goals": " 雅思6分，所有科⽬均分3分\n 背单词背单词背单词\n 每次作业都认真完成及时提交，⾃习课背30个单词\n 健⾝\n ⼀周三回起步\n 每天跑步",
      "selfReflection": "对于学习来讲主动性更⾼，成绩也理所应当提升许多。打过商赛和书法⽐赛，见识更多了。并且变得更帅了",
      "tutorComment": "嘉浩，这学期看下来，你在学术上的进步⾮常扎实。特别是在社科领域，你延续并加强了⾃⼰的优势，在荣誉商科课上的\n参与度很⾼，作业质量也稳步提升。在中国研究课程中，我看到你开始主动和⽼师探讨社会问题，并找到了⾃⼰真正感兴\n趣的课题进⾏深⼊研究，这⾮常棒。不过在治学上，⽼师还是建议你要更沉得下⼼来研读⽂献，有意识地去训练⾃⼰的学\n术研究⽅法。另外，英语学习是⼀个长期的过程，千万不要⽓馁，除了⽇常积累，可以多反思、多尝试更适合⾃⼰的⽅\n法，配合适量的题⽬训练，让⾃⼰在每⼀步进步中获得成就感。\n关于⼼态，我还是想叮嘱你：睡眠和健康永远是第⼀位的。你要学会掌握⾃⼰⾝体的主动权，主动去调整和控制作息，建\n⽴起健康的⽣活习惯。如果只盯着结果好坏，往往会徒增焦虑和压⼒，不如把精⼒收回到眼下，认真上好每⼀节课，写好\n每⼀次笔记，尽⼒做好每⼀道题，好结果⾃然会⽔到渠成。\n最后，⾮常恭喜你进⼊了商赛决赛！这是⼀个⾮常好的锻炼平台。希望你能更多地把这次决赛当作⼀个学习过程，去享受\n挑战，⽽不仅仅是关注最后的输赢。预祝你在⽐赛和未来的学习中收获满满，加油！",
      "selfReflectionSummary": "对于学习来讲主动性更⾼，成绩也理所应当提升许多。",
      "tutorCommentSummary": "我看到你开始主动和⽼师探讨社会问题，并找到了⾃⼰真正感兴 趣的课题进⾏深⼊研究，这⾮常棒。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "蒋嘉浩同学对文学怀有真挚的热爱，具备良好的感受力与细腻的文笔。课堂上的他总是专注而真诚，乐于表达思\n考，课后也常主动与老师沟通分享阅读创作心得。他对人物情感体察入微，这份真诚与细腻是其宝贵的财富。也祝贺他在\n期末考试中取得了优异的突破。\n        为了让你对文学的热爱走得更高更远，老师建议你在保持感性体验与创作热情的同时，加强文本分析训练，学习从\n结构、语言、人物关系等层面理解作品，将感性体验与理性分析结合起来。通过对优秀作品的深入分析，逐步实现从“经\n验表达”向“有意识创作”的转变。在阅读时，不妨多问几个“为什么”：为什么作者这样安排情节？这个人物的选择反映了何\n种价值冲突？尝试建立文"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Justin’s overall performance is rated as \"Growing.\" He participated actively in class and completed his project \nsatisfactorily. However, his homework completion was highly inconsistent, with several missing or low-scoring \nassignments, and his exam scores were at the lowest level, with a particular"
      },
      {
        "name": "English Intermediate 1（A2+）",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Justin is currently facing significant difficulties in the A2+ curriculum. His linguistic foundation is relatively weak, to the \npoint where he frequently struggles to follow basic classroom instructions. There appear to be fundamental challenges \nwith his language learning methodology, which preven"
      },
      {
        "name": "英语词汇强化",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Justin has not been consistently engaged in class this semester, and several absences have affected his learning \ncontinuity. Although he is trying to catch up, his progress has been relatively slow. He still struggles with vocabulary and \ngrammar and needs to invest more effort both in and outside "
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "It was a great pleasure having you in China Study this semester. You have demonstrated through class discussions your \ndeep interests in social issues such as educational equity and the Gaokao system, and I appreciate that you think \ncritically about these topics. However, I can see your struggled t"
      },
      {
        "name": "荣誉商科 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Justin shows a commendable interest and passion for the course, participating strongly in class discussions with a high \nparticipation score. While he grasps individual concepts well, he sometimes struggles to tie them together and apply \nthem consistently to real-world issues. Focusing on the execu"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "蒋嘉浩在本学期的体育课里总是努力完成每一次接盘，可以在比赛里完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Justin 今年在未来规划这件事上投入了不少心力，尤其在大学探索过程中，对自己的目标有了更清晰的想法，也逐渐建立\n起对自我的认识。我们也一起梳理并确定了接下来一段时间的重点方向，包括校内学习的稳定推进、学考的顺利完成，以\n及英语能力的持续积累。\n在选校上，我们保持着比较开放的视角，也期待你能在寒假的商赛中慢慢找到更真实的感受与判断。从课堂表现和未来规\n划作业来看，你上课一直很认真，如果在作业内容上再多花一点心思，把想法表达得更完整一些，会更好地呈现你的思"
      }
    ],
    "academicStrength": "Excels in 荣誉商科 I",
    "academicWeakness": "Needs improvement in 荣誉预备微积分 I and 3 other course(s)"
  },
  {
    "id": "蒋礼泽",
    "name": "蒋礼泽 Eason Jiang",
    "chineseName": "蒋礼泽",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "雷瑶 Yao",
    "gpa": 3.3666666667,
    "photo": "/photos/蒋礼泽-E.jpg",
    "strengths": [
      "荣誉生命科学 I",
      "未来规划 III"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🎤 Debate",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提⾼托福成绩\n 寒假之前完成4级词汇⾼、中频率的单词熟记，提分⾄65⽔准\n 1、每周按时保量完成4级词汇2个list的背诵\n2、按时完成机构布置的作业\n 提⾼校内学术成绩\n 期末每科达到3，部分优势学科到达4。\n 1、按时完成提交作业，保持准提\n2、improve participating.",
      "selfReflection": "在这个学期⾥，我对⽐上学期做出了很多的改变。⾸先，我对⾃⼰的认知更清晰了，在对⾃⼰有意义的事情上我变得更加\n主动，从漫⽆⽬的的在学校⾥度过⼀天⼜⼀天到现在慢慢找到了⾃⼰的⽬标，知道了⾃⼰努⼒的意义。在之前，英语学习\n对我来说⼀直是⼀个⼤困难，很难⼀⼼⼀意去学。但是现在的我了解到了不论是英语也好，其他课程也罢，对我来说从不\n是简简单单的⼀个指标。于是我不再被动，开始主动去完成很多事情。逃避的⾏为渐渐从我⾝上消失，我开始接纳很多曾\n经我不喜欢但是对我意义⾮凡的事情。我开始注重⾃⼰之前没有那么注重甚⾄是⽆所谓的事情，我时常主动关注⾃⼰的阶\n段成绩和表现，有需要时会及时找⽼师跟进。这种主动性不仅仅是在学习上，在同时展现在我的课余⽣活中。我有⾳乐⽅\n⾯的爱好，所以我在学期初选择在CCA中加⼊了乐队。这不仅让我认识了很多兴趣相投的⼈，更是给予了我很多展现⾃⼰\n的机会。所以说这种主动性也让我变得更加愿意去尝试了，⽆论结果是怎么样的，体验万事的过程也是⾮常有价值和意义\n的。通过这个学期的成长，让我对⼀些曾经⾃⼰喜欢或是不喜欢的事情都有了别样的看法和选择。在之后，我会继续抱着\n这种主动、积极的⼼态去⾯对未来遇到的事情和困难。",
      "tutorComment": "礼泽，回看这⼀学期，你最让我欣赏的就是那种“想就⾏动，⾏动就有成果”的劲头。正如你对⾃⼰“执⾏⼒强”的评价，你\n在最近的素养答辩中表现得尤为突出，能够耐⼼地按照要求⼀步步完成各项任务，最终率先完成了答辩，这种效率和定⼒\n⾮常了不起。你的这份执⾏⼒其实源于你清晰的⽬标感，在令我印象⼗分深刻的你的“三⽅⾯谈”中，你对信息的搜集整理\n⾮常详实，对未来的定位也很明确，让我感受到了你⼗⾜的⼲劲和⾃驱⼒。\n这种⾃驱⼒也直接体现在了你的学业进步上。这学期你的成绩稳中有升，尤其是在数学和⽣化物理学科上的优势⾮常明\n显，希望能继续保持下去。英语⽼师也向我反馈，你的语法准确⼒和写作⽔平都有了显著提⾼，看到你越来越⾃信，我由\n衷地为你⾼兴。关于你未来想选择的商科⽅向，学科⽼师给出了⽐较积极反馈，认可你的作业质量，当然，仍有很⼤的提\n升空间和潜⼒。\n既然你现在的专业⽅向已经⾮常明确——商科与数据分析的交叉学科，那么⽼师期待你在接下来的⽇⼦⾥能有更扎实的努\n⼒。下学期的 Capstone 课程是⼀个很好的机会，希望你能利⽤这个平台去深⼊探索⾃⼰感兴趣和擅长的领域。",
      "selfReflectionSummary": "在这个学期⾥，我对⽐上学期做出了很多的改变。",
      "tutorCommentSummary": "这学期你的成绩稳中有升，尤其是在数学和⽣化物理学科上的优势⾮常明 显，希望能继续保持下去。"
    },
    "futureDirection": "数据分析",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "蒋礼泽同学本学期语文学习状态稳定，并在多个方面呈现出积极突破。课后作业完成及时、态度认真，从中可以清\n晰看出他细腻的感受力与持续深化的思考能力。在《红楼梦》戏剧改编中，他大胆将原著与《变形记》进行融合重构，选\n题视角独特，体现出主动思考文本意义的能力。在戏剧排演过程中，他始终保持认真投入、积极配合，课后努力具有持续\n性，学习成果逐步显现。\n        老师看到你拥有扎实的努力和独特的思考视角。为了让你这份潜力得到更充分的发挥，建议你首先增强表达的自信\n与勇气，在课堂与合作中更主动地分享你的观点，你的想法值得被听见。其次，在书面表达与答题时，请有意识地强化精\n读与分析能力。用好阅读课的时间，"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hi Eason,\nI appreciate your consistent focus in class and your diligence in submitting your assignments on time. You have a solid \nfoundation, and to help you reach the next level, I encourage you to participate more actively in our class discussions. \nEngaging with your peers is a great way to test"
      },
      {
        "name": "English Intermediate 1（A2+）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Eason possesses several key strengths that provide a strong platform for language learning, most notably his clear \npronunciation and his ability to follow logical arguments. He has a natural \"ear\" for the language, which helps him \ncommunicate effectively in short bursts. However, his progress is c"
      },
      {
        "name": "英语语法强化",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Eason did a marvellous job this semester, though you started this course with a relatively confused mindset. Yet you \nchanged it rather quickly as you had set you mind to achieve better outcome from this course. You managed to maintain \nrather high participation in class and you took the work seriou"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hello Eason. It was a pleasure having you in China Study this semester. While you often stay in the background during \nclass activities, I caught a glimpse of your true potential during our discussion on the originality debate of AI. Your \ncontributions in that discussion then proved that you have a"
      },
      {
        "name": "荣誉商科 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Eason tends to be a quiet observer in class, but when pressed and fully engaged, he offers surprising and valuable \ninsights. There is a clear opportunity for him to improve his consistency by minimizing distractions and maintaining focus \nthroughout the lessons. While he is skilled at leveraging AI"
      },
      {
        "name": "荣誉生命科学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "这一学期你表现得很出色，课堂效率高，作业完成得规范且有质量，成绩名列前茅，这都源于你学科的热爱。你对知识的\n吸收很快，基础掌握得比较牢固。但老师觉得，如果你能克服腼腆，在课堂发言上再积极一些，你的学习体验会更加完\n整。沟通和表达也是科学研究中必不可少的能力，希望下学期你能试着多跟老师和同学交流。保持住现在的学习状态，相\n信你会更上一层楼。"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "蒋礼泽在本学期的体育课里总是努力完成每一次接盘，可以在比赛里完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Eason，这一学期，你们正式进入了大学申请准备的起步阶段。在未来规划课上，你完成了选校维度的梳理，设计了属于\n自己的梦校海报，初步产出了课外活动清单初步描写，并制作了个人简历。这些任务不只是作业本身，更是一次次对自我\n认知与未来方向的深入思考。\n我看到了你明显的成长与转变。相比以往更多在探索与尝试中前行，如今的你对未来方向变得更加笃定，也更加成熟清\n晰。你将兴趣延展到商业与科技的结合，尤其是对数据分析等方向的思考。\n在三方面谈中，你对选校的理解让我印象很深。你不仅知道自己想去哪里，更能清楚地说明“为什么选择这所学校”，有自\n己的逻辑与判断。这种从被动接受信息到主动思考选择的转变，是迈向申请阶"
      }
    ],
    "academicStrength": "Excels in 荣誉生命科学 I and 1 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "蒋禾君",
    "name": "蒋禾君 Alice Jiang",
    "chineseName": "蒋禾君",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "束晨燕 Eva",
    "gpa": 3.8444444444,
    "photo": null,
    "strengths": [
      "语文 III",
      "大学计算机科学原理 I",
      "创作时刻"
    ],
    "weaknesses": [
      "大学计算机科学原理 I",
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提⾼英语综合⽔平和校内GPA \t基本达成\n 每天的英语练习，阅读，听⼒，⼝语，写作。每天认真上课认真完成作业，有疑问要⽴即解答。\n 每天的英语练习，阅读，听⼒，⼝语，写作，利⽤碎⽚化时间以及晚⾃习时间完成。然后就是GPA，每天作业⾼效完\n成，认真完成PA",
      "selfReflection": "这学期和上学期相⽐，我最⼤的变化就是⼼态和学习。⾸先说说⼼态吧，⾸先最⼤的特点就是我对于交朋友这⼀个点的看\n法的改变。以前我总是很在意其他⼈的看法，对于⽣活中的⼀些交集上的问题也会很内耗，因为性格敏感，我会去考虑很\n多其实根本不需要考虑的事情，然后思考很多不必要的事情。这⼀点会导致以前的我过多的局限在朋友关系上，担⼼⾃⼰\n失去朋友或者担⼼别⼈对⾃⼰的看法。但是在这学期，我逐渐不再局限于很多⼩事情上，尤其是友谊。我觉得这不是冷\n漠，⽽是做出了正确的选择，友谊的存在让我的⽣活更快乐，这是必不可少的事情，因为没有快乐的⽣活对我来说是很艰\n难的，但是，为了维持⼀个特别特别好的关系⽽牺牲⾃⼰的⼀些事情，为了让所有⼈都喜欢我，特别在意其他⼈对我的看\n法，这件事情是不必要的。我承认友谊给我带来了许多，但事实情况是，每个⼈的三观和性格都是不同的，每个⼈的性格\n也都是不同的，世界上没有⼀个⼈是完美⽆缺符合你的每⼀个需求和喜好的。⽽正是这些缺点的存在让我看透了⼀些事\n情，很多⼈是以⾃我为中⼼的，他们会为了⾃⼰的舒适和利益，不顾其他⼈的感受，⽽我的⽣活中有很多很多这样的⼈。\n因此，我对⼀些⼈的态度也变了，不再是讨好型的，为了维持关系去对他们说好话的，我也会考虑到我⾃⼰的感受，在⾃\n⼰不舒服的时候明确和对⽅说出来，⽽且是抱着解决问题的⼼态⽽不是解决对⽅，这样可以解决⽣活中的很多交际上的困\n难，因为我相信我和我的好朋友并不会因为⼀件⼩事情就闹绝交，如果这种事情发⽣了，只能说那就是⼤家性格不合的问\n题。其次就是学习上，⾼⼆的⽣活带来了很⼤的压⼒，因为每个课程的任务都很多，加上我有⼀个考托福的任务，让我意\n识到我的时间其实不够了。这⼀学期让我意识到我在⾼⼀有多么差劲，我也在努⼒改变这⼀现实，我还奇异的发现了我的\n⼀个特质，就是适应能⼒强，虽说这个学期很累，事情很多，但我并没有因为这些⼩困难⽽萌⽣出放弃的想法，我⼀直在\n朝着⼀个⽅向努⼒，尽管我的⽔平可能并没有达到我所期待的那个⽔平。但也正是这样的⽣活让我知道了⼀件很重要的事\n情，我现在所做的⼀切，都是在为我的未来⽣活努⼒，这⼀切都是值得的，⽽且所有我的⼼态的改变和我遇到的困难，在\n未来肯定也会遇到，我也知道我应该⽤什么样的⽅式去应对了。",
      "tutorComment": "这⼀学期，你并不轻松，甚⾄可以说是在⼀段持续消耗的路上。但让我真正确定你在成长的，不是结果，⽽是你在结果迟\n迟不来的时候，依然没有停下脚步。\n托福改⾰在即，你选择给⾃⼰设定清晰⽽具体的⽇常节奏，把 10:30–12:00 变成雷打不动的训练时间。11 ⽉的成绩证明\n了你的⽅法是有效的，⽽之后的反复、停滞、⼼态波动，也是真实⽽残酷的现实。你有过崩塌、有过“⾝在⼼不在”的脆弱\n时刻，但你没有逃离，没有⾃欺，也没有放弃动作本⾝——这⼀点，⽐任何⼀次出分都重要。真正的坚持，往往不是⽃志\n昂扬，⽽是在⽃志不在时仍然选择继续。\n作为半路⾛进艺术⽅向的学⽣，你也越来越清晰地感受到“基本功”带来的限制。这种清晰并不浪漫，它会动摇信⼼，也会\n逼你反复审视⽅向，甚⾄产⽣换赛道的念头。我⼼疼你承受这些冲击，但也必须诚实地告诉你：正是这种阶段，才是真正\n为“选择”付出代价的时刻。你正在经历的，不是退步，⽽是从理想⾛向现实的必经之路。让我格外欣赏的是，你没有把这\n些压⼒封闭起来。你愿意表达、愿意求助，也愿意和家⼈、⽼师讨论真实处境。你讲述的时候，有难过、有疲惫，但没有\n消极、没有⾃暴⾃弃——你始终在想办法。这是⼀种⾮常稀缺的韧性：不靠热⾎⽀撑，⽽靠清醒前⾏。\n你的经历让我想起马拉松选⼿⼤迫杰在跌⼊低⾕后，选择远赴肯尼亚、独⾃训练的那段岁⽉。在最难的时候，他不再盯着\n终点，⽽是把⽬光收回脚下。⼀步，再⼀步。不是因为确定会赢，⽽是因为仍然选择前进。我也想把这句话送给你：越是\n⾟苦的时候，也可以把⽬标暂时放下，把注意⼒交还给当下这⼀⼩步。当双脚还在移动，路就还在你脚下。",
      "selfReflectionSummary": "这学期和上学期相⽐，我最⼤的变化就是⼼态和学习。",
      "tutorCommentSummary": "这⼀学期，你并不轻松，甚⾄可以说是在⼀段持续消耗的路上。"
    },
    "futureDirection": "游戏美术/插画",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "蒋禾君同学学科能力均衡，基础扎实，总体表现优异，并在期末考试中取得了显著突破。她是一名自主性良好的学\n习者，课堂和作业均有良好表现。在《红楼梦》戏剧改编项目中，她对人物形象的理解到位，舞台呈现自然得体，个人剧\n本创作展现出良好的艺术创造力与现实关照意识。她学习能力强，总能在接收反馈后迅速调整并取得明显进步。\n      为了更充分地发掘你的潜力，希望蒋禾君同学在今后的学习更主动地建立与老师的定期沟通反馈，不限于答疑，还可\n以分享你的阅读计划、创作构思或深度思考中的困惑，以获得更个性化的指导和深入的交流。同时，希望你能更开放、更\n从容地看待文学学习的长期价值，在从容而稳定的节奏中，逐步找到真正属"
      },
      {
        "name": "大学统计学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hi Alice,\nYour active engagement in class and the high quality of your homework have been truly impressive this semester. You \nhave a strong grasp of daily concepts; however, I noticed you feel a bit overwhelmed when various topics converge. To \novercome this, I suggest focusing on building a \"big p"
      },
      {
        "name": "English Advanced 1（B2）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Alice possesses a solid linguistic foundation, which gives her a strong starting point for her studies. However, her \nprogress is currently hindered by a desire for \"short cuts\" and a lack of patience when encountering more complex \nacademic challenges. This is most evident in her writing, where she"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hello Alice, I hope you have found our explorations in China Studies thought-provoking this semester. I truly appreciated \nthe rigorous research spirit you brought to your final project. It was really impressive that you locate a focused topic, \ndesign a specific methodology and follow through with "
      },
      {
        "name": "大学计算机科学原理 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Alice has maintained consistent interest in the course and completed a variety of interesting projects. She occasionally \nattends office hours for support when facing challenges. However, Alice is easily distracted during class and sometimes \nchats with peers on DingTalk.\nShe should invest time in d"
      },
      {
        "name": "平面构成与品牌",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "在项目初期，你在想法推进上进展顺利，“孤屿”这一概念本身也十分有吸引力。然而在中后期的制作过程中，整体发力略\n显不足，时间管理与节奏协调存在一定问题，容易在单一环节上投入过多精力，导致整体进度受阻，最终作品呈现较为仓\n促。在调研纸的完成过程中也出现了类似情况，使得最终成果在完整性上有所欠缺。后续建议你有意识地调整时间规划与\n工作节奏，在创作初期为作品预留更充足的完成与调整时间，以应对创作过程中的不确定性与突发状况。同时，也希望你\n能在闲暇时间继续完善并完成这一作品，让这个原本具有潜力的想法，能够以更完整、成熟的状态呈现出来。"
      },
      {
        "name": "创作时刻",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "作为游戏方向的学习者，在这一学期持续进行人体结构相关的 sketchbook 练习后，也希望你能回过头来思考并感受这些\n训练为你带来的变化与进步。更重要的是，期待你能在没有作业要求的情况下，依然保留并延续这样的练习习惯。绘画本\n身并非一蹴而就，而是通过不断的练习、思考与反思逐步积累而成的过程，它的复杂性与深度并不亚于任何其他学科。希"
      },
      {
        "name": "体育：飞盘",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "蒋禾君在本学期的体育课里总是努力完成每一次接盘，可以在比赛里完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "亲爱的Alice，恭喜你收获纽约大学蒂势艺术学院的游戏设计夏校录取！在成长的路上，every step counts! 这个学期你火\n力全开：在学业上稳住了多门CL难度课程的学习，在标化上一直孜孜不倦的筹备托福考试。在作品集筹备上，虽然进度\n略落后于计划，但值得点赞的是你自己主动意识到了这个问题、并主动去解决它；老师相信有了这个经历，接下来其他作\n品集项目的产出会更加顺利。目前整体的申请准备进度非常不错：有大学清单和作品集要求、托福备考进行中、活动列表\n和个人简历完整度非常高；接下来咱们主要集中在2月作品集、3月4月AP考试+托福考试、5月6月Capstone项目打造“随\n机应变的责任感艺术家"
      }
    ],
    "academicStrength": "Excels in 语文 III and 4 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "蒋雨桐",
    "name": "蒋雨桐 Valentina Jiang",
    "chineseName": "蒋雨桐",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "雷瑶 Yao",
    "gpa": 3.0888888889,
    "photo": "/photos/蒋雨桐-E.jpg",
    "strengths": [
      "体育：综合格斗"
    ],
    "weaknesses": [
      "荣誉统计学 I"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 托福到7-80\n 背单词\n 每天背单词，做阅读\n 少吃点垃圾⾷品\n 不喝奶茶，少吃泡⾯",
      "selfReflection": "这个学期的我和上学期的最⼤的改变有变胖了但是相对来说⽐上个学期的性格更好了。对⾃⼰的期待是可以多去学习学习",
      "tutorComment": "⾬桐，这⼀学期下来，我最⾼兴的是看到你依然保持着那份开朗和快乐，⽆论是在宿舍⽣活中展现出的良好⾃律，还是课\n堂上那种积极互动的状态，都让⽼师们觉得你是个⾮常省⼼且向上的孩⼦。你在⼼理课和中国研究课上的进步尤为明显，\n不仅课堂专注度提⾼了，还能够主动贡献⾃⼰的想法，这种参与感是⾮常棒的。\n在学业上，⽼师也想和你分享⼀些更扎实的建议。⽬前看你在英语词汇和部分学科的课后落实上还存在⼀些困难，这可能\n导致你虽然上课听懂了，但作业质量或考试反馈还不够理想。学习确实没有捷径，尤其是⾯对词汇积累和理科知识的巩\n固，可能需要你拿出“磨”的劲头，多花些课后的时间去反复抄写、朗读或练习，把基础打得更牢⼀些。同时，⾯对即将到\n来的申请季，如果要在标准化考试上有所突破，现在就要开始适度增加紧迫感，更⾼效地利⽤好校内外的资源。\n关于未来，我知道你⽬前⼼态⽐较放松，这挺好，但⾼中⽣活不应只是按部就班。我希望你在接下来的⽇⼦⾥，能够更有\n意识地去尝试不同领域的活动，多做⼀些探索，努⼒找到那个能让你真正热爱并愿意为之钻研的⽅向。只有找到了内⼼的\n驱动⼒，你的⾼中⽣活才会变得更加充实且富有活⼒。期待看到你更积极地挑战⾃我，加油，⾬桐！",
      "selfReflectionSummary": "这个学期的我和上学期的最⼤的改变有变胖了但是相对来说⽐上个学期的性格更好了。",
      "tutorCommentSummary": "你在⼼理课和中国研究课上的进步尤为明显， 不仅课堂专注度提⾼了，还能够主动贡献⾃⼰的想法，这种参与感是⾮常棒的。"
    },
    "futureDirection": "艺术史（留学）",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "蒋雨桐同学在语文学科中始终保持认真、稳定的学习态度，并长期坚持良好的课外阅读习惯。在阅读课中，她阅读\n量充足，且能够形成个人化的理解与思考，这为她的语文学习提供了深厚支撑。在《红楼梦》戏剧单元中，她的表现尤为\n突出：既高质量完成舞台道具调度工作，又全情投入人物塑造，同时主动协助其他班级的演出任务。尽管多饰演配角，但\n她的人物完成度与舞台表现力依然十分亮眼，展现出扎实的戏剧理解能力与责任意识。        \n        蒋雨桐同学在本学期学习中，展现了强大的执行能力、合作精神与人物理解潜力。希望你在今后的学习中，更加重\n视作业订正与反思环节，通过更深入的文本分析来提升纸笔测试中的发挥稳定性"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Dear Valentina,\nI appreciate the focus you show during our lessons. While your attentiveness is a great asset, I have noticed that \ninconsistent homework submission and occasional misunderstandings of key concepts are hindering your progress. To \nbuild more confidence, I encourage you to participate"
      },
      {
        "name": "English Intermediate 1（A2+）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Valentina possesses a strong linguistic foundation, with particularly impressive listening skills that allow her to navigate \nour lessons with ease. She has a natural aptitude for the language and can follow complex instructions and discussions \nwithout difficulty. However, her current progress is b"
      },
      {
        "name": "英语词汇强化",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Valentina is fairly engaged in class and completes assigned tasks with reasonable quality. However, she needs more \npractice after class to become truly familiar with the materials. At times, limited exposure leads her to forget content \nduring oral presentations. With more frequent use of English i"
      },
      {
        "name": "积极倾听与主动回应",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你本学期学习基本良好，听说方面都有良好表现，发音清楚正确，读写部分还需要再加强，作业完成认真。期末考试成绩\n良好，进步非常大，反映出你自己一直在努力。课堂上认真听课，大声跟读，勇于表现自己，建议继续保持现在的学习习\n惯，读写部分可以参考教科书的练习完成一些简单的日文作文，使自己在日语的读写部分再加以提高。"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hello Yutong. It was a great pleasure having you in China Study this semester. I truly appreciate the diligence you bring \nto your tasks and your active, consistent participation in our discussion. Your research topic on the prevalence of boys' \nlove fictions among young female audiences was impress"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "You are a student who clearly enjoys the engaging examples we discuss, which is a good start. But Psychology is a \nscience, not just a collection of interesting anecdotes. Currently, your grasp of the core concepts is a bit superficial \nbecause you often disconnect when the topic gets serious. My ad"
      },
      {
        "name": "体育：综合格斗",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "蒋雨桐同学对综合格斗课程兴趣浓厚，课堂参与度高，积极提出问题并主动练习技术动作。她能够在练习中认真思考动作\n细节，并尝试改进自己的动作完成度。建议在保持好奇心和兴趣的同时，加强动作连贯性和重复练习，逐步形成稳定的技"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "本学期的未来规划课程围绕三个单元展开，帮助你理解基于全面评估政策的大学申请逻辑，学习查校与选校，并最终完成\n了属于你自己的大学清单。通过回顾和梳理课外活动，你也积累了第一版activity bank和简历。这些看似基础的工作，其\n实正是在为未来的申请一步步铺路。\n在第一单元中，你能够跟上课程节奏，通过模拟招生官案例分析，认真大学究竟在看什么。同时，你完成了对自己当下七\n大申请材料模块的系统梳理，这种在阶段性节点上停下来“看一看”的能力，是非常有价值的。进入第二单元，你开始向内\n梳理自己真正看重的选校标准——专业资源丰富、学习氛围不那么“卷”、校园活动多样、以及“食堂好吃”这样非常真实也\n很重要"
      }
    ],
    "academicStrength": "Excels in 体育：综合格斗",
    "academicWeakness": "Needs improvement in 荣誉统计学 I"
  },
  {
    "id": "蔡姝含",
    "name": "蔡姝含 Vivian Cai",
    "chineseName": "蔡姝含",
    "className": "⼗⼀年级问源班",
    "tutorName": "夏梓元 Emily",
    "gpa": 3.4111111111,
    "photo": "/photos/蔡姝含-X.jpg",
    "strengths": [
      "English Advanced 1（B2）",
      "平面构成与品牌"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提升英语能⼒\n 学期结束前托福达到95分以上\n\n1 认真参与英语课\n2 每天晚⾃习进⾏英语听⼒阅读训练，⾄少⼀篇阅读，⼀组Conversation&Lecture\n3 结交⼀些⼝语教练，只跟他们说英语\n4 把⾃⼰写的中⽂剧本翻译成英语（⼤项⽬）\n 完成2个 个⼈⼤项⽬\n 完成班级剧本杀“00”的试玩会 （以及班级舞台剧“废迟⼈⽣”的公演，看情况）\n\n1 在9.27前完成“废迟⼈⽣”剧本的撰写\n2 争取将语⽂戏剧之夜PA的机会争取下来，这样就有语⽂课的排练时间。\n1 在10.10前完成9只个⼈剧本的撰写\n2 在10.30前和Evita确定好游戏流程和道具\n3 在11.2前确定游戏场地和游戏时间，发出邀请函\n4 在12.1前完成游戏\n 在期中考试后成为A2\n 准时提交率90%以上，所有科⽬GPA3及以上，没有T，凌云积分100分以上\n\n1 每⽇任务每⽇清，22:00前不留下任何漏⽹之鱼（以及要设置22:00的闹钟提醒⾃⼰！）\n2 晚⾃习不做任何与任务⽆关之事。。。（有程⽼师负责提醒）\n3 晚上0:00必须⼊睡，早上起不来会被扣T……\n4 考试之前复习，最好是让同⼀堂课的同学提醒⾃⼰",
      "selfReflection": "这个学期我真的⾮常忙碌，给⾃⼰揽了很多的活。我在学期初想要为这个社群做⼀些有意义的事情，让同学之间的趣事被\n分享。于是我改造了学⽣会宣传部，⼏乎相当于创建了⼀个新的部门。作为学⽣会宣传部的核⼼成员，我策划海报，跟进\n活动，试图将每⼀份创意都变为现实。并且我也和同学们的关系变好了，愿意倾听⼤家的各种感情问题。我倾听、安慰，\n在复杂的情感纠葛中尽⼒提供⽀持。我还尝试完成了⼀出长达45分钟的戏剧剧本，让⼤家⼀块排练。这些经历填满了我的\n⽇程，也⼀度让我沉醉于这种“被需要”的充实感中。我以为⾃⼰成长了，但是仔细想来，我可能是误以为忙碌就意味着成\n长。\n“成长的代价”很快显现在更重要的领域。我的校内成绩出现了很多不安的波动，作业也渐渐的交不上来了。托福备考进度\n⼀再推迟，那些我在学期初定下的⽬标，忽然变得有些遥远。\n当我在深夜⾯对好多没写的作业和⽇益迫近的期末考试时，我第⼀次清晰地意识到：蔡组的精⼒并⾮⽆限。⽽我过去那种\n“来者不拒”的包揽，实质上是⼀种缺乏优先级判断的⾃我消耗。\n这个学期成为了我学习“做减法”的关键⼀课。它教会我的，不是简单的拒绝或退缩，⽽是⼀种更深刻的权衡智慧。真正的\n效率和成长，源于对核⼼⽬标的清晰聚焦。⽽有价值的成长，需要为最重要的任务捍卫⾜够的时间与⼼⼒。我明⽩了，将\n热情分散给每⼀件事，最终可能稀释了它在关键事物（也就是我的学习）上的浓度。\n带着这份觉醒，我将步⼊下⼀个AP备考学期。这⼀次，我将有意识地为⽇程表留⽩，把选择置于忙碌之前。我会将有限\n的时间资源分配给学术提升与标化考试这些基⽯⽬标，⽽其他活动，则需经过是否有助于我成长的筛选。我希望我可以实\n现更精锐的专注与突破。",
      "tutorComment": "⾸先祝贺CZ努⼒渡过了这⼀漫长的学期！\n这个学期对你来说⼀定百感交集。⾸先，我很⾼兴看到你为了社群和集体所做出的努⼒，你在积极主动地推动学⽣会⼯\n作，希望通过⽉度刊物和视频增加不同年级同学之间的信息交流，提升⼤家的社区归属感和⾼中⽣活幸福感；你会在各种\n活动和⽇常⽣活⾥努⼒成为⼤家“解语花”，希望成为⾃⼰在意⼈的避风港。在专业上你也尝试充分发挥创意去表达⾃⼰对\n社群和世界的理解……这些点点滴滴你在学术、⽣活和社交中的思考，我看到了⼀个对⼈真诚、富有创意和社区责任感的\nCZ。当然，在这个过程中我也感受到了你的迷茫与挣扎，或许是在周围⼈际与⾃我表达中的挣扎，也许是观点、表达时\n机、场合与⽅式上的摩擦，可能还是⼀个好的初⼼却因为种种原因收获了并不如预期的负⾯反馈，从⽽带来了种种的压⼒\n情绪。但每个纠结的节点可能都是我们成长的信号，所以我想⽤积极的⽅式帮助你从另外⼀个⾓度回看这些“⾥程碑”：或\n许这是⼀个好时机让关注点重新收回⾃⼰⾝上，相信经历过这些你可以逐渐在外界繁杂的声⾳之外，看清听清⾃⼰的内⼼\n在说什么、需要的是什么；或许是⼀个好的机会锻炼⾃⼰的专注⼒、深度思考与时间管理，让适当的筛选和取舍帮助⾃⼰\n把集中精⼒，在更加热爱和富有天赋的领域充分释放⾃⼰；当然也是⼀个机会让你认识到，⼀件事情的成功除了好的初\n⼼，如何组织团队合作、如何制定合理的流程机制、如何从观众的视⾓在合适的场景选择合适的表达⽅式都会影响到结果\n的⾛向。总之，我相信这个学期经历的种种，⼀定会成为你未来成长路上很重要且最实⽤的“课程”。\n所以，寒假给⾃⼰⼀点时间好好休整和复盘吧～期待假期回来看到⼀个：\n更加从容和开放的CZ，清楚⾃⼰要什么、⾃⼰的精⼒和时间能够兼顾什么，因此可以更加轻松勇敢地做出取舍、判断和\n决策。对于外界，你也能够更加以开放的⼼态，让万事万物“穿”过你，感受甚⾄享受变化。\n更加专注和专业的CZ，专业上⼀定是你最值得投⼊时间积累和深⼊的，除了你开放的“脑洞”，更加积极主动地去分析和了\n解专业相关的其他艺术家及作品，尝试不同的表达⽅式，这些都能丰富你的创作题材与媒介，让你的“个性”有更“艺术性”\n的⽀撑。\n更加健康⽪实的CZ，⾝体是⼀切的基础，希望下学期的CZ可以更加坚韧，让良好的健康状况和积极的情绪状态⽀持你的\n创作⼤爆发吧～\n别担⼼，我们⼀起并肩前⾏，相信你⼀定会最终抵达你的梦想之地！",
      "selfReflectionSummary": "我以为⾃⼰成长了，但是仔细想来，我可能是误以为忙碌就意味着成 长。",
      "tutorCommentSummary": "我看到了⼀个对⼈真诚、富有创意和社区责任感的 CZ。"
    },
    "futureDirection": "电影/艺术方向/不定专业",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "本学期的语文学习，你以广博的阅读、新颖的创意和饱满的热情，为我们描绘了一位创作者的生动肖像。你的核心优势在\n于深厚的阅读积淀与非凡的创造力。 你阅读量大，这为你提供了丰沛的思想滋养和广阔的想象空间。在此基础上，你展\n现出几乎无限的创意，思维活跃，总能提出令人耳目一新的观点和构思。更难得的是，你对创作怀有极大的、纯粹的热\n情，这种热情极具感召力，能带动身边的人一同投入创造的过程。虽然在最终的舞台呈现中，你的戏剧虽然未能最终呈\n现，但其在构思和讨论阶段所展现出的独特视角、深刻立意和艺术潜力，已给老师和同学们留下了极为深刻的印象。这充\n分证明，你是一位拥有原创灵魂和强大构思能力的“编剧型”人才。对你"
      },
      {
        "name": "大学统计学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hi Vivian,\nYour enthusiasm in class is wonderful, and your ability to grasp new ideas quickly is a significant strength. However, \nbecause these concepts can be forgotten just as fast, I encourage you to focus on building a cohesive \"big picture\" of \nhow data exploration, study plans, and inference "
      },
      {
        "name": "English Advanced 1（B2）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "As an art student, Vivian brings a wonderful sense of creativity to the classroom, supported by a very strong linguistic \nfoundation. She is a dedicated student who maintains excellent focus during lessons, which is a testament to her work \nethic. Her ability to think outside the box often adds a un"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Vivian demonstrated excellent proficiency. Her focus on how self-\nmedia studios on Bilibili expand their visibility was astute, addressing real-world digital entrepreneurship. She handled \nthe literature review excellently, effectively evaluating k"
      },
      {
        "name": "大学心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "It is great to see you in class, but I notice that your engagement tends to fluctuate. You seem interested when we \ndiscuss case studies or \"fun\" facts, but your attention appears to wander when we dive into the drier, theoretical \nmechanisms. Remember, the \"boring\" parts are often where the real ps"
      },
      {
        "name": "平面构成与品牌",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你是一个想法非常丰富、从不缺乏创意的创作者，作品本身也常常呈现出有趣而鲜明的特质。与此同时，也希望你能多关\n注并研究一些与你专业方向相关的其他作品，从中汲取不同层面的灵感与启发。拥有独特的个人风格当然并不是坏事，但\n在现阶段，也期待你能够主动探索更多方向与可能性，通过不断尝试与比较，逐渐深化并丰富自己的创作语言。"
      },
      {
        "name": "创作时刻",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "在目前的 sketchbook 使用过程中，你对它的意义与潜在帮助还在逐步理解中，部分作品完成时略显仓促。后续可以尝试\n将 sketchbook 作为更深入的探索工具，结合你的专业方向进行练习，例如分镜的临摹与分析、摄影构图与光影练习、电\n影画面的观察，以及故事结构的拆解等。逐步养成持续积累与记录的习惯，相信这些看似零散的探索，会在未来的项目创\n作中为你带来更多灵感与支撑。"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "蔡姝含在本学期的体育课里总是努力完成每一次接盘，可以在比赛里完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Vivian，你是一个非常有“云谷味道”的孩子。看到你在校内各种课外活动中风生水起，老师是真的为你开心，也会忍不住\n为你喝彩。你的活力、创造力和参与感，本身就是很难得的优势。\n从未来规划本身来看，在作业的递交和管理上，你还需要再对自己严格一点。你对升学相关知识的理解，其实完全不该停\n留在一个很基础的水平——这些课程和作业并不只是“完成任务”，而是在帮你搭建更清晰、更长远的升学结构。\n这次夏校申请中，老师也看到了你在创造力上的亮点；同时，也想提醒你，校内的学术表现始终是申请中最核心、也最有\n分量的一环。希望你能把节奏稳下来，踏实学习，真实而有力量地展现你的学术能力。"
      }
    ],
    "academicStrength": "Excels in English Advanced 1（B2） and 1 other course(s)",
    "academicWeakness": "Needs improvement in 未来规划 III"
  },
  {
    "id": "贺李然",
    "name": "贺李然 Peter He",
    "chineseName": "贺李然",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "李婷婷 Tingting",
    "gpa": 2.7,
    "photo": "/photos/贺李然-E.jpg",
    "strengths": [
      "Academic Excellence",
      "Leadership",
      "Creativity",
      "Analytical Thinking"
    ],
    "weaknesses": [
      "语文 III",
      "荣誉统计学 I",
      "English Intermediate 1（A2+）"
    ],
    "activities": [
      "🏀 Basketball",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 1.托福过关2.校内成绩过关3.减肥 \t基本达成\n\n1.托福考到100，三个⽉后\n2.校内成绩最低三最⾼为四\n3.瘦掉40⽄⾄少\n\n1.单词背诵每天30个并开发新的⾼效⽅法辅助\n2.作业按时交，知识点按时背\n3.控制饮⾷并按时运动",
      "selfReflection": "这个学期相对上个学期提⾼了当前学习效率以及质量，本⼈通过将不同的任务和知识点拆分成⽆数个调理清晰的⼩模块成\n功的改进了先前的学习⽅法使得学习与作业在质量不变的情况下完成度更⾼花费的时间更短。\n当前本⼈最⼤的困难⾸先是每天的单词记忆产出⽆法稳定以及长期保留其次是减肥似乎不是很顺利，⽬前正在尝试研发新\n的单词记忆法以以提⾼当前单词记忆的稳定度以及对单词记忆⽅⾯的⾃信，同时本⼈正在尝试通过别的代偿⽅法解决本⼈\n馋瘾问题。",
      "tutorComment": "本学期，我看到了你在学习⽅法论上的积极探索与思维上的闪光点。通过将复杂任务拆解为⼩模块，你显著提升了学习效\n率，这种意识是你迈向⾼效学习的重要⼀步。\n在学术表现⽅⾯，你展现出了极佳的潜质，但也存在明显的“知⾏缺⼝”：在英语应⽤和⽣命科学的学习中，你往往在精彩\n⽚段中精神抖擞，却在逻辑分析和枯燥的实验验证中选择回避。正如⽼师们所⾔，语⾔的本质是沟通，科学的基⽯是严\n谨。下学期，我希望看到你勇敢⾛出舒适区，将“沉默的知识”转化为主动的表达。 你对新奇知识有浓厚的探究精神，但在\n对待学业的严谨度上仍有提升空间。偶尔遗漏作业或规避⾼难度任务，会成为阻碍你追求卓越的“短板”。你对减肥和单词\n记忆效率的纠结，反映出你是⼀个对⾃我有要求、追求完美的孩⼦。⽗母提到的UBC（英属哥伦⽐亚⼤学）是⼀个⾮常美\n好的梦想，那⾥的森林与海、严谨的学术氛围都值得你为之拼搏。虽然⽬前成绩与梦校仍有差距，但这种“不⽢”正是进步\n的动⼒。\n期待你在下学期能尝试做⼀个“主动的参与者”。不再只看精彩的瞬间，⽽是沉下⼼来去梳理背后的逻辑；不再只做简单的\n任务，⽽是通过攻克“琐碎”与“困难”来磨练意志。\n加油，我期待你的蜕变！",
      "selfReflectionSummary": "这个学期相对上个学期提⾼了当前学习效率以及质量，本⼈通过将不同的任务和知识点拆分成⽆数个调理清晰的⼩模块成 功的改进了先前的学习⽅法使得学习与作业在质量不变的情况下完成度更⾼花费的时间更短。",
      "tutorCommentSummary": "我看到了你在学习⽅法论上的积极探索与思维上的闪光点。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "贺李然同学具备良好的理性思考习惯与稳定的阅读积累。课堂中虽然表达不多，但从作业完成情况可以看出他在尽\n力认真投入，能够在理解基础上尽力完成学习任务，并保持良好的提交习惯。在课外阅读课中，他能够长期坚持阅读自己\n感兴趣的作品。在《红楼梦》戏剧改编初期，他曾遇到理解上的困难，但能够主动回到文本，进行精读与反复思考，逐步\n尝试理解人物处境，其文学感受力在过程中得到明显提升。考试中，他凭借清晰的逻辑与理性思维，始终保持较为均衡而\n稳定的学业表现。         \n        希望你在继续发挥理性分析优势的同时，尝试有意识地拓宽自己的感知与表达边界。在坚持深度阅读与逻辑训练的\n同时，可以更多地去体"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Dear Peter,\nI appreciate your consistent attendance and reliability this semester. While your commitment to showing up is a great \nfoundation, I’ve noticed that language barriers are currently limiting your participation and understanding of complex \nstatistical concepts. I encourage you to proactiv"
      },
      {
        "name": "English Intermediate 1（A2+）",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Peter is a student who possesses a surprisingly strong vocabulary foundation, demonstrating that he has a good \ninternal grasp of the language's building blocks. However, he is currently very reluctant to engage in the practical \napplication of these skills. He rarely participates in speaking activi"
      },
      {
        "name": "荣誉中国研究",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Hello Peter. It was a pleasure having you in China Study this semester. While you were almost silent during our \nseminars, I could sense your quiet focus and commitment to the lesson, especially during the second half of the term. \nFrom our conversations in person, I can tell that you have meaningfu"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "I appreciate your presence in class, but I want to see more consistent focus from you. You tend to perk up for the \nhighlights but drift away during the analysis, which means you are missing the logic that connects everything together. \nTo improve, you need to stop being a passive observer. Take not"
      },
      {
        "name": "荣誉商科 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Peter brings a unique personality to the classroom and has shown he can be a strong contributor when motivated, \nsurprising me with his engagement during longer projects. While his conviction in his chosen tools is noted, expanding \nhis toolkit beyond a single AI provider would help him create more "
      },
      {
        "name": "荣誉生命科学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "这一学期，你在荣誉生命科学课上展现出了非常活跃的思维和难得的探究精神。你对知识表现出的浓厚兴趣以及课后主动\n答疑的习惯，都让老师看到了你在这一学科上的潜力。然而，目前的学习状态中存在一个明显的短板：对学业的严谨性和\n执行力不足。你偶尔会遗漏作业，尤其是对于那些需要投入大量时间、注重过程表现的任务，往往表现出畏难或规避的情\n绪。生命科学不仅需要灵感的火花，更需要扎实的记录与反复的验证。希望你在下学期能磨炼自己的耐心，把对学科的热\n爱落实到每一份细致的作业和表现任务中。当你能沉下心来处理好那些“琐碎”的细节时，你的学术水平才会有质的飞跃。"
      },
      {
        "name": "体育：篮球",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "You are very special and have a rather quiet personality. Every time you encounter a problem, you always have your \nown unique insights. I hope you can continue to shine and make a difference in your future studies and basketball \ntraining. Keep exploring and you will discover more mysteries of the "
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "亲爱的小贺同学，老师发自内心的为你这学期的转变感到高兴！这学期，你在课堂上和同学们大胆分享了你对UBC大学的\n理解，在课后会和我讨论背英语单词的方法，还会在钉钉上和我沟通如何才能把作业质量迭代到精熟。从升学准备度上，\n火力全开的你在学习成绩上取得了巨大的进步，也更积极的面对英语学习和标化筹备，同时也逐渐明确和聚焦大学目标：\n英属哥伦比亚大学、维多利亚大学。在成长的路上，every step counts! 一步一步，成就最好的小贺同学。老师支持你！"
      }
    ],
    "academicStrength": null,
    "academicWeakness": "Needs improvement in 语文 III and 3 other course(s)"
  },
  {
    "id": "边曦悦",
    "name": "边曦悦 Hilary Bian",
    "chineseName": "边曦悦",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "江宁 Johnny",
    "gpa": 4.5777777778,
    "photo": "/photos/边曦悦-Johnny.jpg",
    "strengths": [
      "语文 III",
      "大学微积分 I",
      "English Advanced 1（B2）"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 每周坚持绘画⼀个⼩时 \t达成\n 1.每周六晚上的时候坚持去上绘画课\n2.在周中的时候坚持绘画20分钟（抽出⼀天即可）\n 期末总评平均分达到3.8分 \t达成\n\n1.所有作业按时提交\n2.⽣物化学⼼理的⽣词在当天的时候30分钟复习（包括拼写）\n3.在遇到不确定的时候及时询问⽼师\n4.给每次作业记时，让阅读速度和反应速度变快，直到作业时间为⽼师作业标注的时间*0.8\n5.每次作业之后分析错误原因，总结错题的特点，加强意识",
      "selfReflection": "这学期进⼊了⾼⼆忙碌的⽣活，有⾮常多的课程在等待着我。这学期我有4门CL课，整体来说还是⾮常的忙，特别是期末\n的时候。在学期初的时候，我花费了⼀段时间来适应⽤英语授课的⽇⼦。我这⼏门CL课的⽼师⽤英语上课最多的是朱银\n银⽼师，那就是⼀节课全部是英⽂，跟英语课⼀样，但是还是⾮常有⽤的对于我的英语来说。但是我还是⾮常担⼼到时候\n去⼤学上课听不懂，我就完蛋啦。但是⽬前校内的课程我还是可以听懂的，⾮常的棒👍 这学期我尝试了⼼理，⼼理有⾮\n常多⽐较散的知识点，因此我在尝试⼀种之前没有试过的复习⽅式。对于化学来说，这学期的内容会⽐之前是⼗年级的时\n候更加系统性，知识点之间的关系⽐较好联系。⽣物⼤部分学习的内容和⼗年级的差不多，但是还是有补充的知识，也正\n是因为这⼀点我这学期的⽣物上课才可以听得懂。这⼏门课中最有挑战性的就是微积分，微积分总会有⼀种你学会了，但\n是题⽬你不会做的奇妙感觉。因此对于微积分⽬前就是多做⼀点题⽬，虽然我并不喜欢刷题。这学期多了⼀个中国研究，\n这门科⽬也⾮常的有意思。在学期初学习的时候给我拓展了很多眼界，在后半学期写论⽂的时候，我也体会到了对于时间\n合理安排的合理性，因为⼤作业是⼀个晚上赶不完的。对于这学期的英语⾸先可喜可贺的是我终于到B2这个⽔平了，并\n且在这个班⾥我⽬前的成绩也是4分，就是⾮常的棒。但是呢，我的标化成绩并没有任何进展在这⼀学期⾥⾯，因为我感\n觉我的英语并没有任何标化的实质上的进步，所以为了不浪费钱加上托福马上改⾰，我没有考。我觉得这学期你很好，希\n望你之后可以⽤于尝试，奇迹说不定就藏在远⽅。",
      "tutorComment": "边边：\n这个学期，你的⽅向感更加清晰，节奏也明显更稳了。各⽅⾯都在有序推进，之前的两门 3 学科也在期末阶段顺利提升到\n了 4。3.88 的⾃我要求稳稳达成，这是⼀份实打实、值得肯定的成果。\n这学期让我印象尤为深刻的，是你在刚刚结束的素养答辩中关于⾃我认知的那⼀段思考。在 1–5 分的⾃评中，你给了⾃\n⼰ 3 分；⽽在被追问“4 会是什么状态”时，你提到：更清楚⾃⼰背后的为什么。这是⼀个⾮常重要、也⾮常难得的觉察\n——因为能这样描述，恰恰说明你其实已经⾛在通往 4 的路上了。\n⽼师今年即将 34 岁。回看前 30 年，我⼀直认为：理解世界、看清世界如何运转，是最重要的事；⽽在最近三年多⾥，\n我越来越确信——认识⾃⼰、理解⾃⼰，才是⼈⽣真正的第⼀要义。内⼼的稳定与从容，是我们与这个时刻变化着的世界\n持续对话的前提。缺少了它，就像⼀艘船失去了船体之间的连接，在⼤海中航⾏，随时都有解体的风险。\n很⾼兴看到你已经开始⾛向这条更内在、更扎实的道路。\n期待你在属于⾃⼰的⽅向上，⾛得越来越宽，也⾛得越来越⾃在、开⼼。\n加油，\n导师\n江宁, 2026/02/02",
      "selfReflectionSummary": "这学期进⼊了⾼⼆忙碌的⽣活，有⾮常多的课程在等待着我。",
      "tutorCommentSummary": "这个学期，你的⽅向感更加清晰，节奏也明显更稳了。"
    },
    "futureDirection": "生物科学",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "曦悦，你堪称语文学习的“模范生”。课堂上全情投入、思维活跃，每一次作业都闪烁着认真思考的火花，质量上乘。在戏\n剧展演中，你对贾政一角的塑造日益“走心”，这表明你不仅能进行理性分析，更能深入人物内心，进行共情式理解——这\n是文学鉴赏的高阶能力。对你而言，语文学习已进入良性自驱的轨道。接下来的挑战，或许在于如何将这种深度理解与精\n准表达，转化为考场上的稳定发挥，以及如何将个人感悟更有效地在团队中分享、碰撞，带动共同进步。你已站在高处，"
      },
      {
        "name": "大学微积分 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hillary has distinguished herself with an excellent performance this semester, demonstrating consistent improvement. \nHer sharp logical reasoning and capacity for abstraction are underpinned by disciplined study habits and active \nparticipation in class discourse. Her calm and composed demeanor faci"
      },
      {
        "name": "English Advanced 1（B2）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hilary continues to be a model student, maintaining the exemplary level of dedication and attentiveness she has \ndisplayed since Grade 10. Her commitment to completing every assignment and her consistent focus in class have \nprovided her with a vast internal \"input\" of language and grammar. This dis"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Hilary demonstrated commendable mastery and steady progress. \nHer investigation into Xiaohongshu nail art bloggers' promotional techniques and their influence on female high school \nstudents' consumption views captured beauty marketing dynamics tho"
      },
      {
        "name": "大学心理学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "It has been a genuine pleasure to witness your growth in CL Psychology this term. You are, without a doubt, one of the \nmost intellectually driven students in the class, and your consistent effort places you firmly as a top performer. I often \nnotice you deep in thought during lectures, processing c"
      },
      {
        "name": "大学生物 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hilary has worked very hard this semester, building a strong foundation in biology. As a result, she consistently performs \nwell on MCQ. However, FRQ remains a challenge. To achieve a 5 in AP Biology, she will need to further strengthen her \nbiological English and FRQ techniques. With focused practi"
      },
      {
        "name": "大学化学 I",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "Hilary Bian is a remarkably proactive learner who explores the curriculum with a high degree of self-awareness. One of \nthe most impressive aspects of her growth has been the development of her future goals; her goal has crystallized \nclearly and gradually, step by step. Driven by these objectives, "
      },
      {
        "name": "体育：美国体育舞蹈",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你这学期的进步非常显著。无论是基本的手位动作，还是复杂的步伐组合，你都能认真对待。你的综合能力很强，在队伍\n中是一个非常稳定且可靠的存在。 目前制约你更近一步的是不够自信。建议你在练习时多对着镜子寻找自己最美的一\n面，给自己积极的心理暗示。当你在跳舞时敢于抬头挺胸，整个人的气场都会变得不一样。\n老师期望看到你在舞台上更加大胆地释放光芒。希望你明白，你已经做得足够好了，只需要再多一点点自信，你就能从"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hilary，这一学期，你们正式进入了大学申请准备的起步阶段。在未来规划课上，你完成了选校维度的梳理，设计了属于\n自己的梦校海报，初步产出了课外活动清单初步描写，并制作了个人简历。这些任务不只是作业本身，更是一次次对自我\n认知与未来方向的深入思考。\n你依旧保持着一贯的稳健与高质量投入，在学术与英语提升上付出了大量时间与努力。围绕冲刺香港院校的目标，你规划\n清晰、行动坚定，展现出很强的目标感与自我管理能力。\n在专业探索上，你也更加聚焦，安排寒假赴香港进行实地探访，将兴趣与未来规划真正落到行动中。这种主动规划、持续\n投入的状态非常难得。\n期待你继续保持这份专注，在学术深度与成果积累上不断突破，相信"
      }
    ],
    "academicStrength": "Excels in 语文 III and 8 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "邓睿涵",
    "name": "邓睿涵 Raymond Deng",
    "chineseName": "邓睿涵",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "束晨燕 Eva",
    "gpa": 3.9555555556,
    "photo": "/photos/邓睿涵-E.jpg",
    "strengths": [
      "大学经济学 I",
      "大学计算机科学原理 I",
      "Python应用编程 I"
    ],
    "weaknesses": [
      "大学计算机科学原理 I",
      "未来规划 III"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 深化福寿螺卵识别统计系统 \t基本达成\n\n1.增加地图，更快看清分布\n2.优化算法，增加YOLO算法，降低性能开销\n3.和遥控设备结合，实现数据⾃动收集\n 两轴动态赛车模拟器 \t基本达成\n\n1.先完成活动层\n2.连接底座和活动层\n3.完成电机和驱动板\n4.完成⾳响系统的搭建\n5.连接显⽰器\n6（可选）.外观优化",
      "selfReflection": "⽐起上个学期，想来是有了更强的执⾏⼒，同时也稳重了许多。我好像找到了⼀个完美的平衡。上个学期在时间管理上还\n会遇到困难，⼀旦事情多起来就会找不到优先级。但会但是现在我的意识有了变化，不再⼀味的追求及时解决，时间安排\n变得弹性，学会适当的放⼿确实是⼀个很好的解决问题的⽅式。当然，学业上的投⼊仍需要增加，统计、经济都还需要我\n花更多的时间⾃学，如果可以解决周末时间利⽤率的问题的话应该不会出现现在这个情况，具体要解决的问题就不在此赘\n述了。",
      "tutorComment": "这学期，你的成长是“被反复验证”的。⽆论是成长画像中稳健的成绩结构，还是统计课进⼊前列、参与学术周与科技论坛\n的分享，都说明你已经形成了适合⾃⼰的学习⽅法，也能在更真实的学术场景中站得住脚。更让我开⼼的是，这些投⼊并\n没有停留在“完成任务”，⽽是不断被⽣活回应。你看学⽣会⼈事部的⼯作开始见到成效，为学弟学妹争取到⾃助售货机这\n样实在的资源；你也愿意站出来，就时间管理和公共卫⽣发出倡议。这些时刻，让⼈能真切感受到：当你⽤⼼对待⽣活，\n⽣活会把获得感和幸福感交还给你。\n在学业与事务之外，我也看到了你在探索中的投⼊感。亲⼿搭建模拟赛车装置，还由此萌⽣出的办新CCA的想法，我想那\n个沉浸、专注的⼿搓模拟器的周末午后，会在你的脑海⾥停留很久很久。我问你：“所以你要从编程语⾔转向⼯程语⾔了\n吗？”你摸摸头说还不确定，还在摸索。那就继续摸索吧，在⾜够年轻的年纪愿意多多尝试，本⾝就是⼀件很美好的事。\n同时，你在时间管理和压⼒管理上的进步也很明显。你没有再被焦虑频繁牵着⾛，⽽是开始建⽴⼀套更稳定的⾃我调节⽅\n式。或许你也可以回头看看，是哪些⼼态、运动或⽅法，帮助你完成了这次升级——这会是你未来很重要的⼀项能⼒。⾼\n⼆下的时间很短，节奏会更快，选择也会更现实。希望你继续保持现在的踏实与清醒，⽤⼼计划、认真执⾏，在更多挑战\n到来之前，给⾃⼰准备好底⽓。你已经⾛得很稳，接下来，愿你⾛得更远。",
      "selfReflectionSummary": "变化，不再⼀味的追求及时解决，时间安排 变得弹性，学会适当的放⼿确实是⼀个很好的解决问题的⽅式。",
      "tutorCommentSummary": "希望你继续保持现在的踏实与清醒，⽤⼼计划、认真执⾏，在更多挑战 到来之前，给⾃⼰准备好底⽓。"
    },
    "futureDirection": "计算机科技",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "邓睿涵同学在本学期语文课堂中的表现一贯稳定而优秀。他专注投入，积极发言，勇于表达个人观点，并能在与师\n生的互动中不断修正与深化思考，表达逐渐趋于完整、严谨与流畅。作业完成情况良好，态度认真，能够按时订正并落实\n反馈。在《红楼梦》戏剧改编项目中，他积极参与，准确把握人物形象，在舞台呈现中自然生动，体现出良好的文本理解\n能力与艺术表现力。同时，他在阅读与讨论中保持较高的参与度，愿意分享观点。         \n       希望邓睿涵同学在已有表达优势的基础上，进一步加强课外阅读与语言积累，将这份优势转化为更高阶的学术能力，\n希望你在“读”与“写”之间建立更紧密、更自觉的联系。例如，在阅读时，不仅"
      },
      {
        "name": "大学统计学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hi Raymond,\nYour hard work this semester has led to visible progress, particularly in your early data exploration tasks. While it is \nnatural to feel challenged as the content shifts toward complex statistical inference, I am confident you can overcome \nthis hurdle. I suggest reviewing your notes th"
      },
      {
        "name": "English Advanced 1（B2）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Raymond is currently navigating a challenging transition period in his English studies. While his IELTS results allowed \nhim entry into the B2 level, he is finding that the academic demands of the course require a deeper level of fluency than \nhe has currently mastered. At present, he is struggling "
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hello Raymond. It was a great pleasure having you in China Study course this semester. I really valued the unique \ninsights you shared during in-class discussions. While your class participation is strong, your final research project \nshowed that there is still significant room for development. The "
      },
      {
        "name": "大学经济学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Raymond, you have a remarkable ability for self-reflection; your capacity to honestly identify your own weaknesses is a \nrare strength that will serve you well in this subject. While you clearly have the analytical ability to excel in \nMacroeconomics, your current results are often hindered by a lac"
      },
      {
        "name": "大学计算机科学原理 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Raymond is an active and valuable member of our class community, contributing thoughtfully to class discussions. He is \npatient and supportive when helping peers work through questions.\nStill, there is room for growth as he works toward a score of 5 on the upcoming AP CSP exam. I am eager to see his"
      },
      {
        "name": "Python应用编程 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "邓睿涵同学在这门课中表现得很好，这门课对你来说难度很大，但你都克服并完成得很好。很多老师都喜欢你做的个人网\n站，有独特的风格。以后希望您能对作品保持这样的高要求。进一步的，希望你能够更加主动地去思考你想要做什么作\n品，避免一个作品做完即弃，要能够更新迭代，你才能学到更多的东西。"
      },
      {
        "name": "体育：综合格斗",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "邓睿涵同学在综合格斗课程中表现非常出色，课堂态度认真，能够全程专注于训练内容。他理解能力强，对技术动作掌握\n迅速，且能够在老师讲解后清楚地复述动作要点，这体现了良好的学习能力和思维敏捷性。课堂上他也能自觉调整动作细\n节，表现出较高的自主学习能力。建议在后续训练中继续保持这种专注度，同时加强实战应用和动作稳定性，让技术更加"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "积极主动、越来越有人生掌控感的雷蒙德，转眼一学期又过去了。在这个学期里，你的升学准备度获得了全面提升。蒸蒸\n日上的校内成绩，多元但适配申请形象的赛事筹备（Diamond Challenge + Fermat），扎根每日练习的英语学习，强化动\n手能力的个人项目（战斗机驾驶舱），还有日渐清晰的大学选校维度和申请清单（CS Ranking）。这些蓬勃进展的背后，\n是你的“目标感和主动性”素养在闪闪发光，清晰了解自己的优势、兴趣、与目标，并针对目标制定行动计划，每一步都走\n出了成果和人生意义感。期待下学期的申请材料筹备，一起高光你的“有责任的创新者和执行者”申请形象。"
      }
    ],
    "academicStrength": "Excels in 大学经济学 I and 4 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "邵尔雅",
    "name": "邵尔雅 Ella Shao",
    "chineseName": "邵尔雅",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "雷瑶 Yao",
    "gpa": 3.6444444444,
    "photo": "/photos/邵尔雅-E.jpg",
    "strengths": [
      "语文 III",
      "荣誉中国研究",
      "创作时刻"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": "Not available",
      "selfReflection": "Not available",
      "tutorComment": "尔雅，这⼀学期下来，你在⼈⽂和艺术领域展现出的才华⾮常亮眼。艺术⽼师对你的评价很⾼，认为你是近年来基础和审\n美最出⾊的学⽣之⼀，这种天赋与兴趣的结合是⾮常幸运的。同时，你在⼈⽂阅读上的深厚积淀也让⽼师们印象深刻，⽆\n论是对《红楼梦》的热爱，还是在中国研究课、翰林院研讨中贡献的深度观点，都体现了你极强的⼈⽂社科研究潜⼒。希\n望你能继续发挥这些擅长，在专业发展的道路上多下苦功，试着将那些发散的灵感串联起来，形成更系统的思考。\n但在肯定的同时，我也观察到你在“时间与任务管理”上遇到了⼀些瓶颈。⽬前你习惯于追求完美、想好了再⾏动，导致任\n务容易堆积到最后，形成了⼀些不必要的压⼒。⽼师建议你尝试转变思维：先动起来，先完成再完美。你可以试着使⽤\nplanner，将⼤任务拆解到具体的时间段，通过建⽴固定的 routine 来减少在“想”这个层⾯的内耗。\n最后关于考试，从最近的 AP 和托福考试来看，你在做题⽅法的训练和反思上还有提升空间。有时候，过多的条条框框反\n⽽成了负担。希望在未来的学习和考试中，你能学会调整⼼态，给⾃⼰减压，这样才能在临场发挥中表现得更加游刃有\n余。\n你现在所展现出的艺术天赋和⼈⽂思考让我想起了中国近代的⼀位极具⼈⽂底蕴的⼥建筑师林徽因。建筑是理智与情感的\n结合，希望你能带着这份对美的追求，在下学期更有计划地磨炼⾃⼰的“基本功”，⼀步步向着那个知性且坚定的梦想靠\n近。期待看到你未来也能⽤建筑和⽂字，构建出属于⾃⼰的精彩世界。",
      "selfReflectionSummary": null,
      "tutorCommentSummary": "期待看到你未来也能⽤建筑和⽂字，构建出属于⾃⼰的精彩世界。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "邵尔雅同学本学期在语文学科中的整体表现非常出色，展现出稳定而成熟的学习状态与突出的综合素养。课堂学习\n中，她始终保持高度专注，理解力与感受力尤为细腻。在《红楼梦》戏剧创作项目中，她不仅承担了灯光设计任务，还成\n功饰演王熙凤一角，能够准确理解戏剧空间中灯光与人物、情绪之间的关系，体现出良好的艺术感知力与舞台意识。她在\n个人戏剧创作中，主动将《简·爱》与《红楼梦》中的女性形象进行比较，围绕自我意识与身份认同展开深入思考，显示\n出扎实的阅读深度、清晰的比较意识与出色的人物情感捕捉能力。         \n        希望你在保持高质量表达与审美敏感的同时，继续拓展跨媒介、跨学科的阅读与体验，例如"
      },
      {
        "name": "大学统计学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Hi Ella,\nIt has been a pleasure having you in our statistics class this semester. Your positive attitude and consistent habit of \nsubmitting assignments on time demonstrate a strong sense of responsibility. To deepen your grasp of statistical \ninference, I suggest engaging more actively during our c"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hello Ella. It was a great pleasure having you in our China Study course this semester. I deeply valued your \nengagement and the way you consistently offered unique perspectives and insights during our discussions. Your ability \nto apply a critical lens to almost any topic is a real strength. It dem"
      },
      {
        "name": "大学心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Your performance this semester reflects a student who cares about their learning, and I appreciate your focus during \nlectures. You often nod along in class, which is great, but remember that following a lecture is different from owning the \nmaterial. Sometimes, you seem tripped up by slight variati"
      },
      {
        "name": "平面构成与品牌",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "你在艺术表达上具备非常突出的天赋，也有很好的审美基础。希望在今后的创作中，你能更多地从自身出发，建立属于自\n己的表达立场，而不是在每一次开始新项目时，先大量收集他人的想法。参考优秀作品当然十分重要，但创作的核心仍需\n要由你自己来把控，否则作品在整体上容易显得支离破碎——虽然作品本身依然精致动人，却可能与项目的内在逻辑产生\n偏差。你已经积累并吸收了许多“好看的作品”作为自己的资料库，接下来可以尝试在此基础上，将这些案例与个人经验、\n感受和思考相结合，进行再转化与重组，逐步发展出更具属于自己视觉语言的作品"
      },
      {
        "name": "创作时刻",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你在平面构成方面展现出非常敏锐的感受力与天赋，几乎每一张作品都能带来令人眼前一亮的视觉体验。这些作品充分体\n现了你对形式与画面关系的理解。若能在创作过程中更早地进行时间规划，避免将任务集中在最后阶段完成，将有助于作\n品呈现得更加从容，也能进一步放大你在画面构成上的优势，也会让你的作业看起来不那么仓促。"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "邵尔雅在本学期的体育课里展现出了很好的传盘能力，可以在比赛里很好地完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "“申请已经开始啦！”——这大概是我课上说得最多的一句话。而你也用实际行动证明了自己对大学申请的专注与投入。本\n学期的未来规划课程，我们聚焦于理解高校的全面评估机制，学习查校与选校的方法，并同步启动了简历等申请材料的准\n备。看到你简历上那抹自信的微笑，和日益丰富、层次分明的活动列表，再加上一次又一次用磨砺换来的托福进步，我由\n衷为你自豪。更让我欣慰的，是你越来越松弛的心态与持续扎实的付出，这比任何分数都更能支撑你走得长远。\n恭喜你完成本学期的第一所夏校申请！我真的很享受和你一起合作的时光。写文书的过程，是一次次深度对话。我能清楚\n感受到你的成长与思维的打开。和你一起共创，不仅高效，更是一件幸福的"
      }
    ],
    "academicStrength": "Excels in 语文 III and 2 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "金仕涵",
    "name": "金仕涵 James Jin",
    "chineseName": "金仕涵",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "陈⽴俊 Jason Chen",
    "gpa": 3.1333333333,
    "photo": "/photos/金仕涵-J.jpg",
    "strengths": [
      "Academic Excellence",
      "Leadership",
      "Creativity",
      "Analytical Thinking"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "💼 Business Club",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " ⽬标：提升英语词汇量加⼝语⽔平\n 每天背⼀句中等到⾼难度句⼦\n 每天下课时间，回宿舍⼀⼩时，晚⾃修空闲时间，背句⼦，周末回家空闲时间背句⼦\n 增加英语⼝语和阅读，听⼒⽔平\n 阅读英语⼩说，每天10个AWL单词\n\n1，下课有时间背单词，2，多观看英语影视，通过观看英语电影、电视剧或纪录⽚来学习新词汇，并了解它们在实\n际语境中的⽤法。 3，实践应⽤，与学校的英语⽼师多多⽤英语交流4，定期复习： 定期复习已学过的单词，以防遗\n忘",
      "selfReflection": "这学期的我，⽐上学期更加独⽴和⾃律了。我不再只是被动地完成⽼师布置的任务，⽽是开始主动规划⾃⼰的学习节奏，\n尝试寻找适合⾃⼰的⽅法。遇到难题时，我也会先⾃⼰钻研，⽽不是⽴刻寻求帮助，在⼼态上也更从容了，⾯对这学期繁\n杂的任务，我可以快速调整⼼态，从容应对",
      "tutorComment": "亲爱的仕涵。\n我曾在2025年年末送你⼀个词——“磐⽯”。磐⽯不张扬，却经得起风⾬；不急于显露⼒量，却在时间⾥证明⾃⼰。它的⼒\n量来⾃根基深固，来⾃内⼼的安定与笃定。如今再回看这半学期，你⽤⾏动让这个词有了真实的重量。\n⾼⼆上，你经历了很多。重要的不是风⾬本⾝，⽽是你没有被风⾬带⾛⽅向。你选择了调整，选择了向前，也选择了更积\n极地⾯对⽣活与学习。这种转变并不轻松，却尤为可贵。它说明你开始学会对⾃⼰负责，也开始理解成长的真正含义。\n我尤其欣赏你在学⽣活动中的表现：认真、负责、踏实、肯⼲。你为所在社区所做的贡献，安静却深远，不追求掌声，却\n真正解决问题。这正是磐⽯的品格——把事情放在⼼上，把责任扛在肩上。在学业上，你变得更加主动，也更愿意反思⾃\n⼰。我相信，只要你保持这样的态度，结果终会向你⾛来。\n在认识⾃⼰这条路上，我也想送你⼀句真诚的建议：多与有经验的成年⼈交谈，多请教，多开⼝。困惑不是弱点，表达困\n惑是⼀种能⼒。当你愿意把问题说出来，把想法拿出来，你会更快地看清⾃⼰，找到适合⾃⼰的⽅向。\n愿你继续做⼀块磐⽯——根基深固，⼼⾃巍然。不急，不躁，不退场。路还很长，⽽你已经⾛在正确的⽅向上。我始终相\n信你。",
      "selfReflectionSummary": "这学期的我，⽐上学期更加独⽴和⾃律了。",
      "tutorCommentSummary": "亲爱的仕涵。 我曾在2025年年末送你⼀个词——“磐⽯”。磐⽯不张扬，却经得起风⾬；不急于显露⼒量，却在时间⾥证明⾃⼰。它的⼒ 量来⾃根基深固，来⾃内⼼的安定与笃定。如今再回看这半学期，你⽤⾏动让这个词有了真实的重量。 ⾼⼆上，你经历了很多..."
    },
    "futureDirection": "商科",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "仕涵，你这学期的进步值得大力肯定！课堂专注度显著提高，时常能迸发出很好的观点，作业质量也越来越好，这清晰地\n描绘了一条向上的成长轨迹。尽管戏剧排练因个人请假受到影响，但这更提醒我们，稳定的出勤是集体协作与个人进步的\n保障。你的进步证明，只要态度端正、方法得当，提升就会发生。请珍视并巩固这份来之不易的进步势头，下学期继续强\n化专注力，深化思考，并注重承诺的可靠性。你已找到了正确的方向，请坚定地走下去！"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "James achieved an overall rating of \"Developing.\" He performed well in class participation and homework, and his \nproject completion was solid. However, his exam results were at the \"Beginning\" level, which stands in contrast to his \ndaily effort. This may point to a need for improved test-taking st"
      },
      {
        "name": "English Intermediate 1（A2+）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "James is currently finding the A2+ curriculum very demanding, as he is working from a particularly limited linguistic \nfoundation. His progress is further complicated by the heavy workload of his other subjects, which often leaves him \nfeeling overwhelmed. This is reflected in his struggle with fund"
      },
      {
        "name": "英语语法强化",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Dear James, you have demonstrated great efforts of learning this semester and you never let the setbacks influence \nyou. You have maintained a rather high participation level in our classes. Though you are still struggling to really put \nwhat we learned into practice due to your insufficient underst"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, James demonstrated emerging promise and developing resilience. \nHis focus on how live streamers use emotional value to influence user purchasing in e-commerce broadcasts indicated \nbudding interest in psychological marketing tactics. He handled the"
      },
      {
        "name": "荣誉商科 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "James is a very active and valuable contributor to class discussions, consistently producing good work and participating \nat a high level. He demonstrates strong skills in leveraging AI tools. To reach the next level, I encourage him to move \nbeyond surface-level content generation and focus on deep"
      },
      {
        "name": "荣誉生命科学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "这一学期，你在学习上付出的心力老师都看在眼里。尽管生命科学的某些部分对你来说有些枯燥，甚至让你在课堂上感到\n疲惫，但你依然表现出了极佳的学术准则，作业从能按时上交，成绩不断进步。这种即便缺乏热情也能把事情做好的能\n力，其实是一种非常了不起的修养。建议你不要给自己太大的心理负担，试着在实验或课外读物中寻找一点点让你觉得有\n趣的瞬间。只要保持现在的努力程度，你已经做得很棒了。"
      },
      {
        "name": "体育：飞盘",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "金仕涵在本学期的体育课里总是努力完成每一次接盘，会很主动地进行跑动接盘。可以在比赛里完成战术要求的团队配\n合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "James，本学期你在规划课程中的表现可谓“先苦后甜”。虽然两次作业因技术性失误未能拿到满意的分数，但这掩盖不了\n你在商赛备战中展现出的卓越才华——你积极启发同伴，展现了一个准商科生应有的担当。我很欣喜我们在期末面谈中解\n开了心结，你不仅没有消沉，反而能迅速转向，在老师的推荐下跨步迈向更高阶的商赛挑战。这份不纠结、向前看的执行\n力非常珍贵。接下来的一年，期待你更多地与我分享你的需求，我们一起精准导航。"
      }
    ],
    "academicStrength": null,
    "academicWeakness": null
  },
  {
    "id": "陈佳钰",
    "name": "陈佳钰 Jennifer Chen",
    "chineseName": "陈佳钰",
    "className": "⼗⼀年级问源班",
    "tutorName": "杨晓晶 Jaye",
    "gpa": 4,
    "photo": "/photos/陈佳钰-X.jpg",
    "strengths": [
      "语文 III",
      "English Advanced 1（B2）",
      "荣誉中国研究"
    ],
    "weaknesses": [
      "大学微积分 I"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "💼 Business Club",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 成为⼀个拥有优秀学术能⼒的学习者 \t基本达成\n -学术优秀（优势学科能达到5，其他学科尽量够到4，最多3门学科是3；⽬标TOEFL95+）-对标学习成果\n\n-学术优秀\n·优势学科（CL经济+CL⼼理+H商科）能达到5，其他学科尽量够到4，最多3门学科是3。\n·⽬标TOEFL95+（11⽉22⽇真考）计划如下：\n1/每天能够保持⼀篇阅读做题/错题分析的刷题量。\n2/在发现阅读/听⼒/写作困难的时候找Dora⽼师进⾏复盘+纠错。\n3/挖掘适合⾃⼰的背单词的⽅式（达成。\n 成为⼀个拥有长久学习⼒的⾃我建设者 \t达成\n -学习技能（保持认真努⼒的态度进⾏学习；善⽤⾝边资源+学习⽅⾯拥有执⾏⼒）-对标学习者素养\n\n-学习技能\n·保持⼀个静⼼的学习状态（屏蔽⼀切周围⼲扰：社交app、⽆关⼋卦信息等）。\n·能够识别机会，发现学术困难的第⼀时间⾃⼰先理解；再询问⽼师（⽬的是为了重新/加深对知识点的理解）+尤其\n是在CL Calculus学习⽅⾯。\n·识别⾃⼰真正的需求，做利益最⼤化的决定，三思⽽后⾏。\n 成为⼀个拥有企业家精神且具有影响⼒的管理者 \t超越\n -课后活动（担任BusinessClub社长+ASD官⽅商社社长+参加商赛「⾄少参加2次商赛」）-对标企业家精神\n-课后活动（参与学⽣会⽣活部⼯作）-对标影响⼒\n\n-课后活动\n·担任BC商社社长。\n1/规划社团每周的CCA时间安排。\n2/善⽤官⽅社团的资源（如：演讲知识、商业分析材料），和社员们⼀起学习。\n3/组织参加BPC+ABS云⾕场（12⽉6-7⽇）商赛（共计两场）+更多赛事。\n·参与学⽣会⼯作（每周⼀次的会议参与+节⽬活动策划等等）。\n个⼈成⻓",
      "selfReflection": "这学期，我围绕“成为拥有优秀学术能⼒的学习者、拥有长久学习⼒的⾃我建设者、拥有企业家精神且具有影响⼒的管理\n者”三⼤⽬标不断推进，从中获得了深刻的成长与对⾃我的全新认识。\n在学术能⼒的打磨上，我完成了经济、商科与微积分PA的深⼊探索。从理论梳理到落地研究的全过程，都让我体会到学\n术的厚度与创造的乐趣。我尝试⽤建模思维拆解复杂问题，将量化分析融⼊学术探究。例如在创新型经济指数的PA中，\n我主动搜集多维度信息，并提出“鸡尾酒指数”的想法，将其转化为实际可⽤的⽅程模型。那⼀刻，我感受到⾃⼰不再只是\n知识的接受者，⽽是能够以数据与逻辑去构建思维世界的创造者。\n在学习⼒的⾃我建设中，我持续探索⾼效的学习⽅法——为经济知识点搭建逻辑框架，⽤ metaphor 的⽅式梳理⼼理学概\n念，让抽象的理论变得可感与⽣动。在与组员的协作中，我们以“Pancake”为隐喻，创造性地将⼼理学知识进⾏可视化：\n神经递质的运作像煎饼的成分，⽣态圈的概念如掌控⽕候的技艺，⽽埃⾥克森的发展阶段，则是⼀层层叠加的成长过程。\n这个过程不仅让我理解更深，也让我学会⽤⾃⼰的⽅式重组知识、赋予学习以⽣命。\n⽽在企业家精神与影响⼒的实践中，我经历了更深层的成长。我以商社社长和学⽣会联合主席的⾝份，从最初的慌乱与⼿\n⾜⽆措，到后来能够从容规划、统筹团队。在最开始的南⽠节活动中，由于经验不⾜与准备不充分，整体的活动体验并不\n理想；但在复盘反思后，我学会了提前分配任务、设⽴时间节点、优化资源配置。到了烟囱节，我带领团队为云⾼社区呈\n现出兼具春晚舞台与游园体验的创新活动——那是我第⼀次真正感受到“领导⼒”的核⼼不是命令，⽽是信任与激发。学会\n倾听、理解与协调，我的影响⼒开始转化为团队的凝聚⼒。\n同时，这学期我也在⼼态上完成了⼀次重要的成长。选择CL微积分这样⾼难度的⼤学课程，是我刻意为⾃⼰设下的⼀道\n“舒适圈之外”的挑战。现实⽐我预想的艰难得多，最终那⼀个“2”的成绩让我⼀度陷⼊失落。但当我慢慢接受⾃⼰的局限、\n调整⽬标与节奏后，我学会了以更平和的⼼态⾯对不完美。每⼀次硬着头⽪去应对的微积分考试，其实已经很勇敢了。\n回望整个学期，我看到的不是单纯的成绩与成果，⽽是⼀个不断在失败中重组、在挑战中⾃我更新的⾃⼰。⽆论是在学术\n研究中的深耕，在⽅法探索中的沉淀，还是在领导与协作中的突破，我都在⼀步步成为那个更有韧性、更具创造⼒的\nJennifer。",
      "tutorComment": "亲爱的Jennifer，恭喜你完成了这漫长⼜充实的G11第⼀学期！\n这个学期，你始终以很⾼的标准要求⾃⼰，⽆论在学习还是在各项事务中，都能看到你强烈的投⼊感和责任意识。你对⽬\n标清晰，也愿意为之付出持续⽽扎实的努⼒，这份⾃我驱动⼒是⾮常难得的。你凭借稳定⽽出⾊的学业表现，获得了荣誉\n学院的有条件录取资格，这是对你长期努⼒的充分肯定，也意味着更⾼的平台与更⾼的期待正在向你⾛来。\n在学业之外，你同样展现了成熟⽽可靠的⼀⾯。作为学⽣会⽣活部长，你在南⽠节、烟囱节、迎新年等活动的策划与组织\n中，能够统筹全局、推进细节，真正把想法落到⾏动上。同时，作为 BC商社社长，你善于整合官⽅社团资源，带领社员\n持续学习与实践，并积极组织参与校内外商赛，拓展社员的实战视野与参与深度。这种既肯投⼊、⼜能带着团队⼀起成长\n的能⼒，⾮常难得。在橄榄球⽐赛场上，你奋⼒拼搏、全⼒以赴的状态，也让⼈看到你⾯对压⼒时的韧性与勇⽓——你总\n是选择认真地“上场”。\n新的⼀年，希望你在继续保持这份专注与进取⼼的同时，也能慢慢找到真正适合⾃⼰的节奏。你已经对⾃⼰提出了⾜够⾼\n的要求，接下来更重要的是学会在紧张与放松之间找到平衡：该冲的时候全⼒以赴，该调整的时候也允许⾃⼰停⼀停、想\n⼀想。“有松有紧”不是降低标准，⽽是让努⼒更可持续、让状态更稳定。期待你在更⾼的期待中，依然保持清醒与从容，\n⽤长期的眼光看待成长，⾛得坚定，也⾛得更远。",
      "selfReflectionSummary": "这学期，我围绕“成为拥有优秀学术能⼒的学习者、拥有长久学习⼒的⾃我建设者、拥有企业家精神且具有影响⼒的管理 者”三⼤⽬标不断推进，从中获得了深刻的成长与对⾃我的全新认识。",
      "tutorCommentSummary": "这个学期，你始终以很⾼的标准要求⾃⼰，⽆论在学习还是在各项事务中，都能看到你强烈的投⼊感和责任意识。"
    },
    "futureDirection": "创业学/商业管理/市场营销",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期的语文学习，你以卓越的自律精神、旺盛的求知热情和全情的课堂投入，完美诠释了一位优秀学习者的风范。你最\n大的亮点在于强大的自我驱动与专注的学习品质。 你自律，能有效管理自己的学习节奏；你求知欲强，主动探索文本内\n外的广阔世界；你对待作业极其认真，体现了严谨的学术态度；你在课堂上积极参与，思维活跃，是推动讨论深度的关键\n力量。这些品质共同构筑了你稳定而优异的学习表现。尤为出色的是你在戏剧创作中展现出的深刻洞察与创造性转化能\n力。 你创作的剧本《风撕两界》，其构思令人拍案叫绝。你精准地抓住了 《红楼梦》中“晴雯撕扇”这一极具象征性的反抗\n片段，并将其内核——一种对压抑的、带有毁灭美感的情绪宣泄"
      },
      {
        "name": "大学微积分 I",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Jennifer has barely met expectations this semester, with a noticeable regression in her results. Despite this, she \ndisplays admirable resilience and consistent study habits, frequently seeking clarifications. Her primary challenge lies in \nthe fact that she requires a longer duration to construct n"
      },
      {
        "name": "English Advanced 1（B2）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Jennifer remains one of the top students in the class, showing remarkable growth this semester, particularly in her \nwriting. Her ability to construct sound reasoning and apply logical thinking to her writing has developed significantly, \nmarking a new level of academic maturity. She has a clear tal"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Jennifer demonstrated outstanding engagement and insight. Her \nexploration of whether AI portrait posts on the Xiaohongshu platform generalize body aesthetics among adolescent \nfemales compared to traditional photography showed keen originality in "
      },
      {
        "name": "大学心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "I thoroughly enjoy your presence in CL Psychology. You are never afraid to share your thoughts, and your questions \noften show that you are thinking on your feet. That said, being a great psychology student is also about the quiet, \nsolitary work of consolidation. At times, your understanding of key"
      },
      {
        "name": "大学经济学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Jennifer, you are a remarkably diligent student with a unique perspective on economic phenomena. Your proactive \nparticipation in class is a breath of fresh air, and I truly admire the enthusiasm you show when seeking guidance after \nhours to deepen your understanding. Throughout our preparation for"
      },
      {
        "name": "荣誉商科 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Jennifer shows genuine passion and interest in the subject, quickly grasping concepts as they are introduced. She is a \nstellar student, arguably one of the strongest in her cohort, with an impressive participation record. To refine her skills \nfurther, she should work on synthesizing AI-generated c"
      },
      {
        "name": "体育：飞盘",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "陈佳钰在本学期的体育课里传盘能力有了很大地提升，可以在比赛里完成关键的传盘，也可以很好地沟通跑动的空间，很\n好地完成了战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hello JenJen～\n这个学期你在未来规划上真的做了很多事，我也明显感觉到你整个人变稳了不少。无论是商社的创办还是备赛过程，都让\n你又上了一个台阶。拿到荣誉学生的有条件录取，其实也意味着外界对你有了更高的期待，而你的行动力，确实一次次证\n明了你配得上这些期待。\n接下来夏校的申请会带你提前体验一次完整的大学申请流程，希望你能认真准备、好好感受这个过程，也预祝你接下来的"
      }
    ],
    "academicStrength": "Excels in 语文 III and 6 other course(s)",
    "academicWeakness": "Needs improvement in 大学微积分 I"
  },
  {
    "id": "陈卡尔",
    "name": "陈卡尔 Carl Chen",
    "chineseName": "陈卡尔",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "江宁 Johnny",
    "gpa": 3.7875,
    "photo": "/photos/陈卡尔-J.jpg",
    "strengths": [
      "English Intermediate 3（B1+）",
      "大学化学 I",
      "体育：足球"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "⚽ Football",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 平均GPA达到4 \t基本达成\n 全学科成绩⼤于等于4\n\n对于CL课程\n微积分：保证每⼀课之前都预习，lim‘s club，保证每⼀次上课的时候都可以有容错的时间⾛神，不会跟不上。每次\n作业完成之后，检查，我对于数学上最⼤的问题就是逻辑不完全，没法想到问题的所有⽅⾯，所以要保证检查的时候\n有更多维度的思考。最后，每次课后需要对所有的theorem有⼀个完整的认知，这也是保证逻辑完整性的必要步骤。\n⼒学：现在还没有想好 因为还没有开始上\n化学：熟悉所有物质，化合物，离⼦的英⽂名称，保证上课都可以理解。⼀定要完成每⼀个课后不会的题⽬的理解，\n不能有遗漏的知识点出现/\n对于⾮CL课程。每天看journal，理解学术⽂章的⾏⽂逻辑\n语⽂：坚持看红楼梦\n中国研究：好好上课\n 在11⽉22内托福毕业 \t未达成\n 到90\n 每天100个学科词汇，早上50，下午50，睡前复习\n每天晚上⼀篇精听",
      "selfReflection": "回顾去年的画像，那个时候的我，像个混进⾼端局的新⼿，满脑⼦都是“别拖后腿”的焦虑和“抱⼤腿”后的⼼虚。那时的所\n谓成长，更多是被荣誉学院的硬指标推着⾛，是被⼴东那群⼤神队友的凌晨四点吓出来的。我那⼀年的关键词是“适应”和\n“愧疚”，我拼命想证明⾃⼰不仅仅是个只会蹭车的⼈。\n⽽今年，我觉得我终于从那种虚浮的紧张感⾥落地了。\n最直接的变化是，我不再是被动地完成任务，⽽是开始主动找苦吃。看看我现在⼿⾥的这副牌：AP Physics C、AP\nCalculus BC、AP Chemistry，全是硬⾻头。去年我还在为托福90分发愁，今年我已经能在⼀堆“转动惯量”、“杂化轨道”和\n“极坐标积分”⾥打滚了。虽然物理⼒学的转动运动经常让我头秃，虽然为了算个重物的体积我要去折腾梯形法则，但这种\n痛苦是真实的，也是踏实的。我不再是为了谁的期待⽽学，⽽是因为我看到了那个清晰的⽬标——包装⼯程。我想帮⽗母\n的公司做 3D 展⽰⽹站，我想研究防溅⽔材料，我想成为那个能解决实际问题的⼈。\n在项⽬上，我也终于撕掉了“边缘划⽔”的标签。去年的 CTB 我因为编程不好⽽退缩，今年的 AIGC 媒体伦理研究，我却\n敢直接去采访三联和浙江卫视的资深前辈，硬桥硬马地搞定⽅法论。哪怕是⽂艺活动，我也没闲着，从《红楼梦》的剧本\n改编到《Hamilton》的登台演出，甚⾄是给学⽣会搭⽹站，我都在努⼒站到 C 位。那个曾经在演讲台上忘词、⾯对提问\n⽀⽀吾吾的我，现在敢在舞台上唱跳，敢在论⽂⾥输出⾃⼰的观点。\n当然，我也不是⽆坚不摧。⾯对即将到来的物理和语⽂期末考，⾯对那些还没背熟的《雷⾬》⼈物关系，我依然会焦虑。\n但我现在的焦虑，不再是那种“我不配”的⾃我怀疑，⽽是“我还没做完”的紧迫感。我开始像我在⾜球场上踢的前锋\n（Striker）位置⼀样，不再等着球传到脚下，⽽是开始主动跑位、寻找射门的机会。\n如果说去年我是看着别⼈的背影奔跑，那今年，我终于开始跑出了⾃⼰的节奏。哪怕姿势还有点笨拙，哪怕还会跌跌撞\n撞，但这每⼀步踩下去，脚印都是深的。我不必再羡慕别⼈的光环，因为我正在打磨⾃⼰的武器。",
      "tutorComment": "卡尔：\n这个学期似乎是⼀个波澜壮阔的学期。兜兜转转、起起伏伏，你⼏乎都经历了⼀遍。当过往熟悉的学习模式不再奏效时，\n涅槃新⽣，成了唯⼀的出路 —— 我相信，你已经⾛在了这条路上。\n为什么我能这么肯定？因为在刚刚结束的素养答辩中，我真切地感受到了这⼀点——Cooperative Pragmatist，或许正是\n更接近“终极版”的你。\n从 Leader ⾛向 Cooperative Pragmatist，不仅需要认知，更需要勇⽓。当周围的声⾳在不断歌颂 Leadership 时，是否还\n能选择做⼀个 Cooperative Pragmatist，这点是许多⼈犹豫不能决的命题。我不认为这是所有⼈都具备的判断⼒与勇⽓去\n解这道题，但我很⾼兴你在⾜球这⽚热⼟上，率先完成了这样的突破。\n我也相信，这样的突破不是⼀蹴⽽就，在最近⼏年⾥，你多少感受到过⼀种状态：有时会停在原地打转，却难以真正向\n前。我的经验是——最有效的⽅法，往往是先做起来，成为⼀名 Pragmatist。做起来，就会有反馈；有反馈，才有调整⽅\n向的可能；不断调整，才能逐渐靠近真正属于⾃⼰的那条路。正如你说的，你正从别⼈的影⼦⾥出来，变成真正的⾃⼰，\n这点特别棒！\n在接下来的过程中，留意主动去寻找并使⽤你能接触到的优质资源——这正是 “Cooperative” 的意义所在。与⼈协作、借\n⼒前⾏，会让你⾛得更稳，也更远。\n⼈的⼀⽣不会只经历⼀次涅槃，但每⼀次涅槃都值得特别去珍惜。因为每⼀次都是⼀个更深⼊理解世界，理解⾃⼰的过\n程。\n下个学期，我很期待看到那个⼲劲满满、持续⾏动中的你。\n加油，\n导师\n江宁, 2026/02/03",
      "selfReflectionSummary": "变化是，我不再是被动地完成任务，⽽是开始主动找苦吃。",
      "tutorCommentSummary": "卡尔： 这个学期似乎是⼀个波澜壮阔的学期。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "卡尔，你是一位非常聪明且懂得“策略性学习”的学生。你能根据知识点的重要性和自身情况调整听课状态，抓大放小，这\n展现了良好的元认知能力。作业完成得及时且质量不错，戏剧展演中不仅舞台表现力佳，还能灵活“临时加戏”，说明你具\n备即兴发挥的机敏与创造力。这种能力十分可贵。若能在语文学习中，将这份机敏更多地与文本的深度细读、概念的精确\n辨析相结合，让你的创造力建立在更坚实的学术根基上，你的语文素养将更加无懈可击。期待你继续运用智慧，下学期创"
      },
      {
        "name": "大学微积分 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Carl has met expectations overall, though his performance has experienced a decline in the 2nd half of the semester. \nHe is diligent in seeking clarifications, yet he often attempts to learn ahead without fully mastering the current material, \nwhich leads to unnecessary anxiety and distraction. Furt"
      },
      {
        "name": "English Intermediate 3（B1+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Dear Carl, I hope you are feeling much more confident and released while reading the semester feedback. You have \nbeen maintaining rather high level of positivity through this semester and you have continuously been the most attentive \nand goal-oriented one. I believe this attitude carry you in the "
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Carl demonstrated solid proficiency and consistent effort. His \nexploration of the limits to which self-media and mass media should use AI-generated content reflected thoughtful \nconsideration of ethical boundaries in digital production. He handled"
      },
      {
        "name": "大学化学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Carl Chen is a student of remarkable tenacity and strong execution. He combines a diligent study ethic with a dynamic \ncuriosity; he actively observes interesting phenomena and possesses the unique ability to convert those observations \ninto viable research questions. He then has the drive to dive d"
      },
      {
        "name": "大学物理 I: 力学",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Carl has faced challenges this semester, with performance falling short of expectations. He is a genuinely curious \nstudent who asks questions without hesitation. However, his thinking can be dispersed, often drifting toward details less \nrelevant to the core concepts. He tends to rely on AI or rush"
      },
      {
        "name": "体育：足球",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Carl has performed well in every of the drills that we set up. His coordination and conduction of the ball both are quite \ngood but he still needs to improve the accuracy on  passing the ball. He is one of the most physically capable students \non the football team, very fast over short and long dist"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "在我印象里，你依然是那个意气风发的“飞驰少年”，也是点子层出不穷的“创意少年”。还记得你和我分享研究项目计划\n时，眼睛里那束对学术探索的光，让我看到你把好奇心变成方法、把兴趣变成路径的能力。\n“申请已经开始啦！”——这大概是我课上说得最多的一句话。而你也用实际行动证明了自己对大学申请的专注与投入。本\n学期的未来规划课程，我们聚焦理解高校的全面评估机制，学习查校与选校的方法，并同步启动了简历等申请材料的准\n备。看到你在 MSU 视频里对学校与专业的热爱与聚焦，我看见了你对匹配度的清晰判断、对方向的坚定选择，以及愿意\n为热爱持续投入的耐力。\n尽管这个学期偶尔也遇到了一些“卡点”，但更让我欣慰的是你"
      }
    ],
    "academicStrength": "Excels in English Intermediate 3（B1+） and 3 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "陈奕霏",
    "name": "陈奕霏 Esther Chen",
    "chineseName": "陈奕霏",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "钱寒轩 Hanhsuan",
    "gpa": 3.6888888889,
    "photo": null,
    "strengths": [
      "语文 III",
      "大学统计学 I",
      "大学经济学 I"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🎤 Debate",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": "Not available",
      "selfReflection": "⼲得不错哟 继续加油",
      "tutorComment": "奕霏，⾼⼆这⼀年，你在学业和热爱的⾳乐剧之间找到了属于⾃⼰的平衡点，也收获了双份的成长。许多科⽬取得了4的\n优异成绩，这背后是你对学习的认真与坚持；⽽在舞台上，你全情投⼊排练已久的⾳乐剧，不仅圆满完成演出，更在过程\n中学会了如何倾听、协作，如何与同伴沟通、磨合、彼此⽀持——这些经历带来的成长，或许⽐掌声更珍贵。\n看到你在追逐热爱的同时，没有放松对学业的要求，反⽽在两者之间不断调整、努⼒兼顾，这份⾃律与韧性让我由衷为你\n骄傲。⾳乐剧带给你的不只是舞台上的光亮，更是团队中那份相互托举的⼒量；⽽学业则为你未来的道路打下坚实的基\n础。\n希望你继续守护这份对艺术的热忱，也别忘了在⽇常中持续积累、稳步前⾏。热爱可抵岁⽉漫长，⽽踏实能助你⾛得更\n远。坚持下去，你会遇见更⼴阔的世界，也会成为更完整的⾃⼰。",
      "selfReflectionSummary": "⼲得不错哟 继续加油",
      "tutorCommentSummary": "希望你继续守护这份对艺术的热忱，也别忘了在⽇常中持续积累、稳步前⾏。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "奕霏，你身上有一种令人动容的“创作者的赤诚”。从你为原创戏剧投入的巨大热情，到剧目调整后你依然开放包容、积极\n投身宣传的团队精神，都展现了你超越功利的学习态度与可贵的合作品格。课堂上你眼神专注、及时提问，作业质量一贯\n较高——尽管偶尔的拖延提示我们需加强时间管理。这份对语文的真诚热爱，是你最宝贵的财富。若能在创作中更注重结\n构的严谨与主题的凝练，在学术写作中更追求论证的缜密，你的文学表达将更趋成熟。请保持这份热情，让它照亮你的人"
      },
      {
        "name": "大学统计学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Dear Esther,\nYour quick understanding of new topics and the high quality of your homework have led to impressive test performance \nthis semester. You clearly have a strong grasp of our study plans and data exploration techniques. To further your \nprogress, I encourage you to be more active in class "
      },
      {
        "name": "English Advanced 1（B2）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Esther possesses a sophisticated foundation in English, often demonstrating a level of insight and linguistic fluency that \nexceeds that of her peers. However, her progress this term has been hampered by inconsistent attendance and a \ntendency to deprioritise her English studies in favour of other s"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Esther demonstrated commendable mastery and resilience. Her \nexamination of how mass media reporting on disasters (e.g., Hong Kong fires) influences public emotions and \nperceptions revealed perceptive insight into journalism's psychological role. "
      },
      {
        "name": "大学经济学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Yifei, I have been very impressed by your performance this term; despite your frequent absences, you have \ndemonstrated a remarkable capacity for independent learning and a strong grasp of complex macroeconomic concepts, \nas evidenced by your consistently high exam scores. Your academic focus is exe"
      },
      {
        "name": "大学乐理 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Esther is a thoughtful and conscientious student who always prepares thoroughly for every assessment. Despite having \nto take frequent absences due to health reasons, you’ve managed to stay on track with the course material—often \nproactively reviewing with classmates after class to catch up and rei"
      },
      {
        "name": "主修乐器 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Esther在本学期主修声乐课程中虽因故未能参与最终的音乐展演，但从你按时提交的阶段性练习视频中，老师能清晰感受\n到你对作品的理解和良好的舞台表现力——眼神、肢体与声音的配合自然流畅，具备成为出色表演者的潜质。你在课堂上\n专注认真，练习目标明确，也展现了扎实的演唱基础。希望下学期你能克服客观困难，勇敢站上舞台，让现场观众亲身体\n验你的歌声与魅力。老师非常期待在未来的演出中看到你自信登台的身影！"
      },
      {
        "name": "体育：美国体育舞蹈",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "在出勤的课堂上，你展现出了非常认真的学习态度。你的动作伸展度很好，对于每一个细节的把控都尽力做到位，那种专\n注的神情非常具有感染力。由于本学期你缺席的课次较多，在整体动作的连贯性和熟练度上稍显落后。建议你利用假期或\n课余时间，对照视频多加练习，弥补缺失的课时，把基本功打得更扎实一些。老师相信只要你保证练习时间，你的进步会\n是非常惊人的。希望下学期能看到一个全勤出席、动作纯熟的你，用坚持和汗水换来更加绚丽的舞姿，加油！"
      },
      {
        "name": "未来规划 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Esther，这一学期，你们正式进入了大学申请准备的起步阶段。在未来规划课上，你完成了选校维度的梳理，设计了属于\n自己的梦校海报，初步产出了课外活动清单初步描写，并制作了个人简历。这些任务不只是作业本身，更是一次次对自我\n认知与未来方向的深入思考。\n我每次都会被你由内而外的热爱所感染。《Hamilton》的大获成功，演员们的巨大进步，让我特别感动，这些成果从来不\n是一时兴起，而是你带领着大家一次次排练、修改、坚持与付出的真实积累。\n我很欣赏你身上那份既愿意站在舞台中央追逐梦想，也愿意统筹全局、带领团队前行的成熟。在学术周的展示、晨会的分\n享中，你作为宣传部部长用心总结校园点滴，让更多人看到集体"
      }
    ],
    "academicStrength": "Excels in 语文 III and 3 other course(s)",
    "academicWeakness": "Needs improvement in 未来规划 III"
  },
  {
    "id": "陈禹墨",
    "name": "陈禹墨 Mia Chen",
    "chineseName": "陈禹墨",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "李林平 Jason",
    "gpa": 2.5555555556,
    "photo": "/photos/陈禹墨-J.jpg",
    "strengths": [
      "体育：美国体育舞蹈"
    ],
    "weaknesses": [
      "语文 III",
      "荣誉预备微积分 I",
      "English Intermediate 2（B1）"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": "Not available",
      "selfReflection": "这学期的我多了⾃信，也多了⼀份对⾃⼰梦想的坚定。我发现确定专业后，我更加有⽬标感，我更加懂得安排好⾃⼰的时\n间。我会在作业完成后⾃⾏去舞蹈房练习专业，坚持训练体能，我认为这是我之前很难做到的。\n我希望在新的学期⾥继续坚持我每天的专业训练，并且多参加课外活动。⼀定⼀定的是要及时完成作业。在学科上，数\n学！⼀定要好好记笔记，然后巩固知识点，知道薄弱就要改。",
      "tutorComment": "这个学期，你依旧是那个在舞台上闪闪发光、充满热情与创造⼒的美少⼥，你⽤⾃信和才华为集体增添了⽆数光彩，⼤家\n都很欣赏你在舞台上专注、投⼊的模样。同时，⽼师也发现，你和传说中的“睡美⼈”有⼀点⼩⼩的相似——清晨的教室，\n常常在等待你完全醒来。这虽然是你可爱的⼀⾯，但也反映出在时间管理上还有进步空间。其实，你完全有能⼒把舞台上\n的那份专注和热情，也⽤到⽇常学习中来。如果你能在作息上稍作调整，把每天的重⼼更清晰地放在完成作业、上课认真\n听讲上，减少闲聊和发呆的时间，尤其善⽤留⽩和⾃修时段来规划好作业与复习——那么，你的学习效率⼀定会⼤⼤提\n⾼，也能为⾃⼰争取更多⾃由发展兴趣的时间。期待看到你在时间管理上的进步，相信你会逐渐成为那个不仅舞台耀眼、\n⽇常也从容有序的少年。下个学期，让我们⼀起努⼒，把“睡美⼈”的魔⼒⽤在夜晚按时休息，⽩天精神饱满地迎接每⼀个\n挑战吧！加油，禹墨！你的潜⼒，远不⽌于舞台。",
      "selfReflectionSummary": "这学期的我多了⾃信，也多了⼀份对⾃⼰梦想的坚定。",
      "tutorCommentSummary": "这个学期，你依旧是那个在舞台上闪闪发光、充满热情与创造⼒的美少⼥，你⽤⾃信和才华为集体增添了⽆数光彩，⼤家 都很欣赏你在舞台上专注、投⼊的模样。"
    },
    "futureDirection": "化学/药物化学等",
    "courses": [
      {
        "name": "语文 III",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "禹墨，你在戏剧展演中认真配合、活泼可爱的表现，让大家看到了你性格中开朗、合作的一面。然而，课堂上频繁的说话\n导致思维脱节，作业的拖延与缺交，这些都构成了你语文学习的严峻挑战。这些行为习惯，正在透支你的学习基础与潜\n力。下学期时间紧迫，改变刻不容缓。请从管住嘴，跟上思维开始，强制自己专注听讲、记录要点；从今日事今日毕开\n始，杜绝作业拖延。你拥有很好的性格基础，现在需要用纪律与行动，为你的潜能搭建上升的阶梯。老师和同学都愿意帮"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "Mia’s overall performance is at the \"Beginning\" level, making her a student requiring focused attention. Although she \nparticipated actively in class, the quality of her homework and her exam scores were very low, with all dimensions \nindicating significant difficulties in the course. Close collabor"
      },
      {
        "name": "English Intermediate 2（B1）",
        "grade": "生长[2]",
        "gradeNum": 2,
        "feedback": "Dear Mia, your learning this semester is generally satisfactory as you have shown your willingness to learn but \nconfidence fluctuates when encountering difficulty. You remained positive in class yet you seem to fail to capture main \ncontent efficiently in class. As you said in the class, you know t"
      },
      {
        "name": "英语词汇强化",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Mia has good pronunciation and shows genuine interest in English. However, her effort level has not always matched \nher potential, and she is sometimes distracted by other academic demands, which is understandable for a senior \nstudent. That said, vocabulary improvement requires time, focus, and con"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Mia demonstrated promising growth and emerging skills. Her \ninquiry into how deep fans reconstruct identity and community when internet celebrities' personas collapse, through \npersonal storytelling, showed developing insight into fan culture and d"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "I appreciate your presence in class, but I want to see more consistent focus from you. You tend to perk up for the \nhighlights but drift away during the analysis, which means you are missing the logic that connects everything together. \nTo improve, you need to stop being a passive observer. Take not"
      },
      {
        "name": "荣誉商科 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Mia generally makes a valid effort to engage with the course content, but often appears to be \"going through the \nmotions\" rather than showing a deep commitment to learning. For longer projects, I encourage her to take more \nindividual ownership of her work rather than relying heavily on the contrib"
      },
      {
        "name": "体育：美国体育舞蹈",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你是那种综合实力非常均衡且突出的学生。你在舞台上的表现力极佳，能够很好地将音乐的情绪通过肢体传达出来，整套\n动作行云流水，观赏性极强。在追求流畅感的同时，要更加注意动作的“控制力”。有时你的动作会因为过快而显得略微发\n飘。建议加强定点的控制，让每一个结束位都稳如泰山，增加动作的力量感和专业度。你已经具备了成为一名优秀啦啦操\n选手的全部潜质。希望你在细节处继续精雕细琢，将控制与爆发完美融合。老师期望在未来的舞台上，你能以领军人物的"
      },
      {
        "name": "未来规划 III",
        "grade": "萌芽[1]",
        "gradeNum": 1,
        "feedback": "Mia，恭喜你最终决定申请自己的“梦中情专”！在专业能力提升的同时，也别忘了校内的学习是你坚实的基础，而英语能\n力将会是你最重要的工具。\n在未来规划课程上，你的课堂投入度很不错，不过作业的质量和节奏还有非常大的提升空间。希望你能对学校、专业以及\n申请条件做得更细致一些，因为未来规划的作业不仅是任务本身，更是在帮你为升学做好全方位的准备。"
      }
    ],
    "academicStrength": "Excels in 体育：美国体育舞蹈",
    "academicWeakness": "Needs improvement in 语文 III and 3 other course(s)"
  },
  {
    "id": "陈锐",
    "name": "陈锐 Ray Chen",
    "chineseName": "陈锐",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "李林平 Jason",
    "gpa": 3.9555555556,
    "photo": "/photos/陈锐-J.jpg",
    "strengths": [
      "荣誉统计学 I",
      "英语词汇强化",
      "荣誉中国研究"
    ],
    "weaknesses": [
      "荣誉心理学 I",
      "未来规划 III"
    ],
    "activities": [
      "🥏 Frisbee",
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " ⾼2下申请Agency2\n 所有学科评级到3及以上\n 1、做科⽬相关词汇表记录课堂词汇背诵\n2、利⽤碎⽚时间如利⽤课间、睡前复习当天知识做回顾。定期回顾各科错题，提⾼解题能⼒和知识掌握程度。\n 寒假雅思5.5-6.0\n\n1、1周1篇雅思写作真题。\n2、联系雅思⼝语真题，在寝室或者⽇常⽣活多使⽤英⽂交流培养语感。\n3、听 BBC / TED / 雅思播客等材料锻炼听⼒能⼒。\n4、记录每天阅读、听⼒、⼝语等遇到的⽣词",
      "selfReflection": "这学期与上学期的不同：\n主动性提升\n上学期，我有时不太愿意主动提问，常常将问题压在⼼⾥，或者直到最后⼀刻才去处理。⽽这学期，我的主动性得到了显\n著提升。不仅在课堂上积极提问，遇到不懂的地⽅⽴即向⽼师或同学请教，课后我也会主动去找⽼师讨论问题，确保⾃⼰\n能更好地理解知识点。主动寻求帮助，提升学习效果。\n学术成绩的关注与进步\n上学期，我在学术⽅⾯的关注度可能没有这学期那么强，⽽这学期，我更加重视学术成绩的提⾼。我通过系统地整理学习\n资料、制定学习计划，并在课后花时间复习和巩固知识，努⼒提升⾃⼰的学术⽔平。我不仅关注成绩的提升，更注重⾃⼰\n在学习过程中的成长和进步，在各个⽅⾯都取得实质性突破。\n任务管理和执⾏⼒的提升\n上学期，我在处理任务时有时缺乏清晰的步骤和时间规划，导致效率低下。⽽这学期，我学会了更有效的任务管理技巧。\n我会在开始⼀个任务前设定清晰的⽬标和详细的执⾏计划，把⼤任务拆解成⼩步骤，并根据优先级逐步完成。通过这种⽅\n式，我不仅能更⾼效地推进⼯作，还能够确保任务的⾼质量完成。\n对⾃⼰的欣赏和期待：\n培养更强的⾃律性\n我希望⾃⼰在未来能更加⾃律，保持⾼效的⼯作习惯和规律的⽣活⽅式。⽆论是学习还是⽣活中的其他事务，我都希望能\n够通过⾃我管理，更好地控制⾃⼰的时间和精⼒，从⽽提升整体效率。\n拓展⾃⼰的多⽅⾯能⼒\n除了学术能⼒，我也希望⾃⼰能在其他领域获得更⼤的进步。例如，我希望在领导⼒、沟通技巧和创新思维等⽅⾯不断提\n升，做到不仅在学术上表现出⾊，也能在⽣活中发挥更多的影响⼒和能⼒。\n保持积极的⼼态⾯对挑战\n我希望⾃⼰能始终保持积极的⼼态，不论遇到什么挑战，都能以乐观的态度去⾯对并寻找解决办法。我希望能够更好地应\n对压⼒和挫折，不轻易放弃，通过不断尝试和调整，最终迎接更多的成功。",
      "tutorComment": "这个学期，⽼师欣喜地看到你在各个学科上都取得了稳步进步，这说明你已经开始找到适合⾃⼰的学习⽅法，并且在时间\n管理上也变得更加主动、⾼效。你逐渐展现出的⾃主学习能⼒，是你这个学期最宝贵的收获。更难能可贵的是，你不仅关\n⼼⾃⼰的成长，也乐于帮助⾝边的同学。当同伴遇到问题时，⼤家总是很⾃然地想到向你求助，这充分说明你是⼀个值得\n信赖、有能⼒也有担当的同学。\n如果说还有什么可以继续提升的地⽅，⽼师想和你分享⼀点关于沟通的⼩建议：沟通的本质是为了解决问题、促进理解。\n在帮助同学或者讨论问题时，如果能更注意表达的语⽓和⽅式，让建议听起来更温和、更易于接受，那么你的善意和智慧\n将会被更多⼈理解和感激。你已经在“做好事情”上展现了能⼒，未来在“说好话语”上多加留意，⼀定会让你的⼈际协作如\n虎添翼。\n陈锐，你就像⼀棵不断扎根、抽枝的树，既在向上⽣长，也在向外伸展。继续保持你的踏实与勤勉，也慢慢修炼沟通中的\n柔和与智慧，你⼀定会成为⼀个更有影响⼒、也更被欣赏的⼈。\n期待下个学期，遇见⼀个更从容、也更有温度的你。",
      "selfReflectionSummary": "这学期与上学期的不同： 主动性提升 上学期，我有时不太愿意主动提问，常常将问题压在⼼⾥，或者直到最后⼀刻才去处理。",
      "tutorCommentSummary": "这个学期，⽼师欣喜地看到你在各个学科上都取得了稳步进步，这说明你已经开始找到适合⾃⼰的学习⽅法，并且在时间 管理上也变得更加主动、⾼效。"
    },
    "futureDirection": "生物/生物科学",
    "courses": [
      {
        "name": "语文 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "陈锐，你本学期的表现稳定而可靠。课堂上状态积极，能与师生良性互动；作业不仅及时认真，而且质量不错，展现出扎\n实的学习功底。在戏剧展演中，你作为场记极度认真尽责，记录问题、协助调整，这种幕后工作的细致与耐心，是团队成\n功的重要保障。你身上体现了一种“沉稳的胜任力”。在下学期的学考冲刺阶段，这份沉稳尤为宝贵。建议你在保持现有优\n势的同时，适当挑战更有难度的文本分析与论述写作，突破自己的舒适区，让沉稳之上，再添锋芒！"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Dear Ray\nYou have been a standout participant in our Honor Statistics class this semester. I am particularly impressed by your \nactive engagement during our discussions and the high standard you maintain in your homework assignments. You \nclearly have a strong technical command of data exploration. "
      },
      {
        "name": "English Intermediate 1（A2+）",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Ray is a highly dedicated student who brings a consistently positive attitude to the classroom. Despite starting the year \nwith a relatively weak linguistic foundation, his work ethic is exemplary; he is attentive during lessons and diligent in \ncompleting his homework to a high standard. As a resul"
      },
      {
        "name": "英语词汇强化",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Ray is a hardworking and well-behaved student with a very positive learning attitude. He stays focused in class and \ntakes tasks seriously. However, he sometimes lacks sufficient familiarity with the materials, which leads to hesitation and \nreduced fluency when speaking. As he prepares for standard"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Ray demonstrated solid excellence and proficient analysis. His \nexploration using Xiaohongshu and Bilibili as examples to examine factors constituting initial content push weights, how \nuser interactions adjust them, and their effects on news sprea"
      },
      {
        "name": "荣誉心理学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "It is a joy to have a student with such a positive attitude and genuine interest in my class. You are doing very well, but I \nbelieve you are capable of even more. Psychology is a global discipline, and to truly excel, you need to access \nresources beyond our current curriculum. I strongly encourage"
      },
      {
        "name": "荣誉商科 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Ray is consistently one of the strongest students in the class, demonstrating a deep and practical understanding of \nbusiness concepts and how they interconnect. His effort is exemplary, both in in-class assignments and out-of-class \nprojects, and his near-perfect participation record reflects his d"
      },
      {
        "name": "体育：飞盘",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "陈锐在本学期的体育课里总是努力完成每一次接盘，会很主动地进行跑动接盘。可以在比赛里完成战术要求的团队配合。\n同时你在比赛里也会坚持完成每一次进攻、防守。很好地锻炼了所需的两个素养。"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "本学期的未来规划课程围绕三个单元展开，帮助你理解基于全面评估政策的大学申请逻辑，学会查校、选校，并最终完成\n了你自己的大学清单。通过回顾和梳理课外活动，你也积累了第一版activity bank和简历，这些看似基础的工作，其实正\n是在为未来申请一步步铺路。\n在第一单元中，你能够跟上课程节奏，通过模拟招生官案例分析，认真思考全面评估下大学究竟在看什么。同时，你也开\n始正视自己当下的七大申请材料模块，并为雅思提分和校内成绩的提升制定了相对清晰的计划，这一步本身就很值得肯\n定。\n进入第二单元，你向内梳理了自己真正看重的选校标准——安全性、综合排名、专业资源和就业支持；向外则通过大学\n展、Cialfo"
      }
    ],
    "academicStrength": "Excels in 荣誉统计学 I and 6 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "陶佳禧",
    "name": "陶佳禧 Sandy Tao",
    "chineseName": "陶佳禧",
    "className": "⼗⼀年级奥德赛班",
    "tutorName": "李婷婷 Tingting",
    "gpa": 4.4,
    "photo": "/photos/陶佳禧-J.jpg",
    "strengths": [
      "语文 III",
      "荣誉预备微积分 I",
      "English Intermediate 3（B1+）"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提升英语标化成绩 \t达成\n 托福本学期达到85分\n 制定每个⽉的托福学习计划。\n周⼀到周五花⾄少1⼩时学习托福，周末每天⾄少花2⼩时学习。\n 艺术作品集 \t超越\n 制订好作品集计划，按时完成本学期的任务。\n 和作品集机构⽼师以及校内⽼师⼀起讨论制定计划\n每周⾄少花半天去作品集机构学习。",
      "selfReflection": "今年我步⼊了⾼⼆，我有了更加清晰的升学⽅向后，将重点聚焦于了校内成绩和标化成绩上。总的来说，我这个学期变得\n更加⾃律和坚毅了。\n⾸先，在校内成绩上。学期初我给⾃⼰的⽬标是所有成绩均为3及以上，由于这个学期我们的必修课程少了很多，其他均\n为选修，因此这个⽬标也变得更加可实现了。我分析⾃⼰在每⼀门课上的优势与不⾜，⽤不同的学习⽅法应对不同的学\n科。在数学课上，我每节课都会认真的记笔记，遇到不懂的地⽅就主动提问⽼师，在做题时⾃⼰总结解题步骤，每个单元\n复习时绘制思维导图，最终取得了较⾼的成绩；在⼼理课上，我会将⽼师提到的重点概念⽤⾃⼰理解的意思记下来，并在\n复习时梳理所学内容的笔记，得到了⽼师的赞扬，最终成绩也⼀直在进步；在英语课上，⾯对较简单的教材，我主动找到\n英语组⽼师进⾏沟通，获得了更加⾼效的学习⽅法建议；在语⽂课上，我主动承担起班级戏剧项⽬中导演的岗位，编排了\n⼀出戏剧，统筹台前和台后，最终成功展演，得到了观众们的掌声和喜爱，我⾃⼰也尝试了舞台灯光的调节，是⼀次⼗分\n宝贵和难忘的经历。终于，我拿到了A2，实现了⾃⼰的⼩⽬标。\n这个学期我最想重点谈的就是我的托福。在⾼⼆这个准备申请的关键阶段，托福⼜即将⾯临改⾰，我希望我在学期末可以\n达到80分的成绩，确保我过了⼤学申请⽣死线。在学期初的时候，我曾准备⾃学托福，于是我主动向学校的英语组⽼师请\n教了托福学习的计划和⽅法，但是经过半个学期的尝试，我发现并没有太⼤的成效。因此，我⼜主动联系了之前语⾔机构\n的⽼师，安排了更加个性化的托福备考计划。我坚持每周上三节托福课，课后成套地做练习题，不断反思和复盘⾃⼰的错\n题。我在⽉底报了两场真考，各科的成绩都有了明显的提升，最终达到了我的⽬标分数。在查成绩的时候，我⾮常的激\n动，更多的是对于⾃⼰的骄傲和欣慰，感觉到⾃⼰这个学期付出的努⼒都有了回报。这段时间的努⼒也让我成长了很多，\n我发现⽐起吃喝玩乐及时满⾜给我带来的短暂的多巴胺，长期坚持努⼒达到我想要的成绩，这份延迟满⾜所带来的内啡肽\n则更加令⼈振奋。之前我总抱怨所处在⼀个松弛懈怠的学习环境中，没有任何外⼒促使我进步，可我也从这种环境中得到\n了真正的⾃驱⼒。\n我总觉得⾃⼰只是在假装努⼒，总觉得⾃⼰做的还不够，但在最后这个辞旧迎新的时刻，我想告诉⾃⼰：2025年圆满落\n幕，你做的真的很棒。我知道2026年的你即将⾯临新的困难和挑战，但我相信你可以的，专注⾃⼰，坚持就是胜利，加\n油！",
      "tutorComment": "本学期是你展现出极强⾃驱⼒与韧性的⼀个学期。在升⼊⾼⼆这⼀关键阶段，你⽬标明确，顺利晋升⾄A2层级，并成功\n达到了托福80分的⼩⽬标，实现了校内成绩与标化考试的双重突破。你对“延迟满⾜”的深刻领悟——意识到长期努⼒带来\n的内啡肽⽐短期快感更有⼒量，标志着你⼼态上的成熟。\n你是同伴眼中的榜样，也是⽗母⼼中善良、懂事、共情能⼒极强的孩⼦。在学⽣会和班级戏剧项⽬中，你不仅承担了导演\n等领导职责，更展现了统筹全局的能⼒。你对家⼈深沉的爱令⼈动容，这种温柔的品质是你⼈格魅⼒的⼀部分。\n在⽣活管理上，你展现了极⾼的⾃律性，如⾃觉上交电⼦设备、保持内务整洁。然⽽，⽣活导师也关注到你在学期末出现\n的作息不规律现象。请记住，稳定的作息是⾝⼼的“充电站”，在⾼强度的学习⽣活中，守护好早睡早起的习惯，才能⽀撑\n你⾛得更远。\n你曾担⼼⾃⼰是在“假装努⼒”，但本学期圆满落幕的各项指标（学科成绩、A2、托福80）⾜以证明你的每⼀分付出都是真\n实且厚重的。2025年你做得⾮常棒！⾯对即将到来的2026年，请保持这份严谨与⾃驱，专注⾃我，愿你继续保持内⼼的\n光芒，在新的学期绽放更璀璨的⾃我！加油！",
      "selfReflectionSummary": "我成长了很多， 我发现⽐起吃喝玩乐及时满⾜给我带来的短暂的多巴胺，长期坚持努⼒达到我想要的成绩，这份延迟满⾜所带来的内啡肽 则更加令⼈振奋。",
      "tutorCommentSummary": "本学期是你展现出极强⾃驱⼒与韧性的⼀个学期。"
    },
    "futureDirection": "视觉艺术",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "陶佳禧同学本学期在语文学科展现了卓越的综合素养。课堂上，她始终保持专注倾听与积极参与，思维活跃，理解\n力与领悟力表现优异。她善于从生活经验出发进行反思性、批判性思考，常能提出见解独到、富有深度的观点，为课堂讨\n论提供重要推动。在作业完成与反馈修正方面，她态度认真、自主性强，能够根据反馈及时调整，体现出良好的学习习惯\n与反思能力。在《红楼梦》戏剧改编项目中，她既能从整体把握文本结构，又能关注戏剧舞台性的创作空间，作为编剧与\n导演展现出突出的统筹意识、沟通能力与责任感，个人创作能力与领导力均有显著提升。\n        希望陶佳禧同学在保持高效学习习惯的同时，更进一步发展高阶能力：在阅读中尝试建立"
      },
      {
        "name": "荣誉预备微积分 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Sandy received an overall rating of \"Proficient.\" She excelled in class participation and note-taking, and her project work \nwas completed to a high standard, showing good comprehension and application. However, some of her homework \nscores were inconsistent, and her final exam performance did not m"
      },
      {
        "name": "English Intermediate 3（B1+）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Sandy, you have made solid progress in the B1+ class this term. Your written work shows good attention to detail and a \ndeveloping understanding of grammar. It's clear you put thoughtful effort into your assignments.\nTo help you take a significant step forward, I strongly encourage you to focus on i"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Hello Sandy. It was a great pleasure having you in our China Studies course this semester. I really valued your active \ncontributions to our class discussions. Your analysis of media and the female body, especially your insights into the \nmale gaze and the reverse male gaze were truly impressive. Yo"
      },
      {
        "name": "大学心理学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "It has been a pleasure to have you in the course. Your dedication is evident, and you are clearly engaged during our \nsessions. Currently, your performance is great, yet I believe you are capable of much more if you adjust how you \nencode information. You seem to rely a bit too heavily on rote learn"
      },
      {
        "name": "平面构成与品牌",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "你是一位非常擅长进行时间规划的同学，项目推进始终有条不紊，完成度也较为稳定。但希望在今后的创作中，你能更多\n地以自己的判断作为衡量标准，而不仅仅是思考“老师是否觉得可以”。艺术本身并不存在唯一的标准答案，教学要求也并\n非评定作品价值的唯一尺度。真正重要的进步，往往来自于你个人的持续研究、反复推敲与内在判断的建立。"
      },
      {
        "name": "创作时刻",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "本次作业完成得非常出色，sketchbook 中的内容与个人项目的推进紧密相关，体现了你对艺术家资料的整理、分析以及\n将其转化为自身创作资源的能力。希望这些研究与思考，能够持续为你的项目发展以及未来的艺术探索提供支持。同时，\n也鼓励你保留并深化使用 sketchbook 的习惯，尝试更多不同的方向、材料与方法，让灵感与想法得以及时记录与沉淀。\n在创作过程中，也希望你不仅将 sketchbook 视为完成作业的工具，更把它当作一种自主探索与实验的空间，慢慢体会并"
      },
      {
        "name": "体育：综合格斗",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "陶佳禧同学在课程中表现较为稳重，能够遵守课堂规则并参与练习。但由于一些身体原因，有时候坐在场边休息，对课程\n节奏和技术衔接的熟悉程度有限。建议后续通过增加练习次数，逐步提升自信心与动作完成质量。"
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Sandy 真的是一个让人很放心的学生，每次三方面谈你都准备得特别充分，对自己的目标、选择和接下来的路径都想得很\n清楚。\n今年最让老师印象深刻的，是你主动去和 ETS 复议托福成绩这件事～虽然最后维持原来的结果，但是能看到你多维度解\n决困难的能力～\n接下来就继续稳稳地走，把节奏保持好，好好准备今年的 AP 考试，加油呀。 💪✨"
      }
    ],
    "academicStrength": "Excels in 语文 III and 7 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "黄俊齐",
    "name": "黄俊齐 Allen Huang",
    "chineseName": "黄俊齐",
    "className": "⼗⼀年级凌霄班",
    "tutorName": "陈⽴俊 Jason Chen",
    "gpa": 3.5555555556,
    "photo": "/photos/黄俊齐-J.jpg",
    "strengths": [
      "语文 III",
      "荣誉统计学 I",
      "English Elementary 1（A1）"
    ],
    "weaknesses": [
      "未来规划 III"
    ],
    "activities": [
      "🎭 Musical/Drama",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 提⾼英语⼝语和听⼒能⼒以及写作能⼒\n ⽤英语与他⼈交谈，多听英语⾳频，套⽤写作结构\n\n⾏动⼀：在⽇常⽣活中，先尝试简单的⼝语交谈，在熟练上去后可以运⽤复杂的句⼦交流。⾏动⼆：从简到难，听⼀\n些英语⾳频，先尝试不看字幕光听，看能否听懂，后⾯再听⼀些难的⾳频，并不看字幕。⾏动三：在看英语⽂章时留\n意优秀句⼦，将它们记下来，分析句型结构，并应⽤到写作中。\n 提升词汇量和句型结构储备\n 每天背单词和记忆句⼦，分析结构并仿写\n ⾏动⼀：每天背单词提升词汇量，第⼆天再记⼀遍，防⽌忘记，也可以不定期再记⼀次。⾏动⼆：周⼀到周五每天背\n诵并仿写句⼦，记忆句⼦、分析结构、进⾏仿写，在第⼆天时再次复习⼀下",
      "selfReflection": "⾸先是在英语这⽅⾯有所进步，词汇量增加，能更好的“说”和“听”了。其次是勇敢了⼀回，第⼀次去考了雅思，虽然成绩\n不是很好，但是有迈出这⼀步，在接下来的时间了需要更加努⼒的提升英语了。然后是初次进⼊学术界，在中国研究的课\n上初次尝试了撰写论⽂，虽然很累，但是有了这次经验在以后会更轻松。最后是经济这块，选了经济作为专业⽅向，并且\n在课上也有所收获，对经济的了解更多了，还与同学完成了模拟公司体系的设计，总的来说收获⾮常⼤。希望在新的⼀年\n会变得更好。",
      "tutorComment": "亲爱的俊齐，\n去年年末，我送给你⼀个词——“破晓”。我希望你不负⾃⾝的天赋，更希望你学会主动⾛向光明。破晓不是被动等待天\n亮，⽽是在⿊暗尚未散尽时，已经决定向前的那⼀步。这是⼀种选择，也是⼀种勇⽓。\n回望这⼀学期，你在学业上的表现稳健⽽踏实。你或许不是最张扬、最急于证明⾃⼰的那⼀个，但你始终保持着应有的责\n任感：只要任务在肩，便会认真对待、全⼒完成。这种不敷衍、不退缩的态度，是你最值得珍惜的底⾊，也是未来⾛得长\n远的重要根基。\n更让我感到欣慰的，是你在社区志愿服务中的成长。⾼⼆上半学期，我多次看见你投⼊其中、专注⽽安静地付出。这对你\n⽽⾔，是⼀次向外的迈步，也是⼀次⾃我突破。你开始意识到，个⼈的价值并不只存在于课堂与成绩之中，更体现在对他\n⼈、对社会的回应⾥。\n当然，真正的成长还需要更深⼊地认识⾃⼰。你需要慢慢看清⾃⼰的优势与短板，也需要主动⾛近那些有经验的成年⼈，\n与他们交谈、倾听、思考他们⼀路⾛来的选择与代价。这些真实的故事，会成为你理解世界、理解⾃⼰的重要参照。\n破晓从来不是⼀瞬间的光芒，⽽是⼀段持续向光⽽⾏的过程。愿你在未来的学习与⽣活中，多⼀些主动，多⼀份⾃省，在\n⼀次次选择中坚定⽅向。当天⾊渐明，你会发现，真正的黎明，是你亲⼿⾛出来的。",
      "selfReflectionSummary": "⾸先是在英语这⽅⾯有所进步，词汇量增加，能更好的“说”和“听”了。",
      "tutorCommentSummary": "值得珍惜的底⾊，也是未来⾛得长 远的重要根基。"
    },
    "futureDirection": "",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "俊齐，课堂上你总是充满热情，积极回答问题，带动了良好的学习氛围；作业也能保质保量完成，展现了积极的学习态度\n和扎实的基础。在戏剧展演中，你所塑造的人物比较真实，这说明你对生活与文本有一定的观察力和表现力。总体而言，\n你是一位让老师放心、为课堂增色的学生。下学期，可以在“思维的深度”和“表达的精度”上提出更高要求。例如，在回答\n问题或写作时，不满足于第一反应，追求更独到的角度、更严密的逻辑、更精准的语言。你已做得很好，但你可以做到卓"
      },
      {
        "name": "荣誉统计学 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Dear Allen,\nYour performance in Honor Statistics this semester has been exemplary. I am incredibly impressed by your active \nparticipation during class and your proactive approach to seeking clarification afterward. Your homework consistently \nreflects a high level of effort and accuracy. To further"
      },
      {
        "name": "English Elementary 1（A1）",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "It has been a pleasure to have Allen in our class. He is consistently attentive, responsive, and earnest in lessons, and \nhe sets a strong example by completing all tasks on time and with high quality. His positive learning attitude has \ncontributed to a focused and supportive classroom atmosphere.\n"
      },
      {
        "name": "英语词汇强化",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Allen approaches this course in a task-oriented and careful manner, and he has performed well on assigned tasks and \nassessments. However, it is also clear that he currently views the class more as a set of requirements than as a chance \nto truly develop his English ability. To move forward, Allen n"
      },
      {
        "name": "英语语法强化",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Dear Allen, you are the most active student in the class and you are willing to participate in many of our class discussion \nperiods. You intend to go extra miles for a great result of learning, I want to encourage you to keep doing this. My \nsuggestion for your English improvement is for you to rea"
      },
      {
        "name": "荣誉中国研究",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Throughout the G11 China Study field investigation, Allen demonstrated commendable proficiency and forward-thinking. \nHis investigation into the positive impacts of advanced generative AI on news media's information collection and editing, \nwhen sufficiently intelligent, demonstrated solid vision fo"
      },
      {
        "name": "荣誉商科 I",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "Allen has shown tremendous growth throughout the semester, which has been a joy to witness. Initially defensive and \nunsure about the discussion-based structure of the class, he made a remarkable turnaround halfway through the term. \nHe transformed into one of the most frequent and confident contrib"
      },
      {
        "name": "体育：综合格斗",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "黄俊齐同学课堂态度认真，参与度高，愿意主动学习新动作，理解能力和动作表达能力较强。在练习中能够较好地消化老\n师的指导，并尝试将动作连贯起来。建议继续保持学习积极性，同时在体能和技术连贯性方面加强训练，让动作完成更加"
      },
      {
        "name": "未来规划 III",
        "grade": "掌握[3]",
        "gradeNum": 3,
        "feedback": "本学期的未来规划课程围绕三个单元展开，帮助你理解基于全面评估政策的大学申请逻辑，学习查校与选校，并最终完成\n了你自己的大学清单。通过回顾和梳理课外活动，你也积累了第一版activity bank和简历。这些看似基础的工作，其实正\n是在为未来的申请一步步铺路。\n在第一单元中，你能够跟上课程节奏，通过模拟招生官案例分析，认真思考大学究竟在看什么。同时，你完成了对自己当\n下七大申请材料模块的系统梳理，并制定了专属于自己的行动计划。这一步非常值得肯定。进入第二单元，你开始向内梳\n理自己真正看重的选校标准——专业资源、安全性、录取要求以及未来的工作与实习机会；向外则通过大学展、招生官来\n访、Cialfo"
      }
    ],
    "academicStrength": "Excels in 语文 III and 3 other course(s)",
    "academicWeakness": null
  },
  {
    "id": "黄溥畅",
    "name": "黄溥畅 Chris Huang",
    "chineseName": "黄溥畅",
    "className": "⼗⼀年级问源班",
    "tutorName": "Chen Zhixiu",
    "gpa": 4.6875,
    "photo": null,
    "strengths": [
      "语文 III",
      "大学微积分 I",
      "English Advanced 2（B2+）"
    ],
    "weaknesses": [
      "English Advanced 2（B2+）",
      "未来规划 III"
    ],
    "activities": [
      "⚽ Football",
      "🎭 Musical/Drama",
      "🎤 Debate",
      "🖼️ Art"
    ],
    "growthPortrait": {
      "goals": " 托福出分\n 10-11⽉份考试100+ 1⽉改版前冲刺110\n 每⽇固定10分钟单词积累 30分钟课外英语⽂学类阅读+摘抄 20分钟TED talk ⼩站托福2篇阅读+3篇听⼒ 专注状态\n+纠错\n 校内成绩\n 经济 微积分 物理 英语冲刺5分 语⽂ 中国研究保4\n 每⽇10-15分钟each 当⽇科⽬复习答疑 ⾼效课堂学习时间\n 成功创⽴Cycling Beyond骑⾏社\n 利⽤周末、节假⽇时间，带着⼀些辍学、抑郁的孩⼦或公路骑⾏爱好者游杭州，打开⼼境\n 10⽉前完成宣传视频剪辑，谈好场地安排 后续每周跟进，并做视频/图⽚记录\n ⾝体素质\n 通过坚持锻炼、⾜球训练全⾯提⾼⾝体素质\n 作息23:15-6:30确保7⼩时睡眠 每⽇晨跑+⽆氧30分钟 每⽇1-2⼩时⾜球校队训练 周末每⽇2⼩时+骑⾏\n 每⽇阅读积累\n 学期结束前读完2本感兴趣的书 红楼梦前80回 英语⽂学读物1本\n 20分钟红楼梦 10分钟《别逗了，费曼先⽣》 30分钟《50 great short stories》",
      "selfReflection": "⾼⼆第⼀学期的时光结束的⽐想象中快得多，回望这段历程，最⼤的感触是极致的充实与忙碌，但与⾼⼀不同的是，现在\n的我多了⼀份在多重挑战中游刃有余的从容。如果说上个学期是适应与积淀，那么这个学期则是能量的全⾯爆发与绽放。\n学期伊始，是对过去努⼒最好的回馈时刻，我凭借⾼⼀学年的优异表现，荣获了 Dean's List，成功获得 Honor College 头\n衔，并拿到了 Agency 3 的⾃主性评级。这些来⾃学校的认可，为我的⾼⼆⽣涯奠定了⾼起点的基调，给了我更多学习和\n⽣活中的⾃由，能让我完全沉浸在⾃⼰的节奏中发挥到极致。课外活动⽅⾯，本学期留下了最浓墨重彩的⼀笔。我有幸在\n全校范围内演出的Hamilton舞台剧中饰演 Aaron Burr，从排练室的反复打磨到聚光灯下的最终呈现，我收获了演出的巨⼤\n成功和好评，也深刻体会到了艺术表达的魅⼒和团队中的合作精神。这次经历不仅是才艺的展⽰，更是对⾃信⼼的⼀次洗\n礼。学术⽅⾯，我经受住了多线程任务的考验。在全⾝⼼投⼊⾼强度排练和各种竞赛准备的同时，我从未放松对学业的⾼\n标准要求，成功实现了兴趣与学术的完美平衡。期中考试中，我取得了全 4、两个 5 分的优异成绩，证明了⾃⼰在⾼压环\n境下中⾼效的时间管理能⼒和学习能⼒。此外，我积极拓展学科深度与⼴度，不仅参加了 AMC 竞赛，还作为队长带领团\n队攻坚 HiMCM 数学建模⽐赛，并取得全球⼀等奖M奖的成绩。未来我期待能继续保持这份韧性和激情，在⾼⼆的下半场\n继续深度探索兴趣和学术边界，创造更多可能。",
      "tutorComment": "黄溥畅同学：\n回顾这学期，你的⽣活可以⽤“充实⽽忙碌”来形容。⼀路⾛来，你或许经历过挫折，也曾感到迷茫和纠结，但令⼈欣慰的\n是，在这些起伏之中，你依然有所收获，稳步前⾏。\n在学业上，你的标化成绩有了⼩幅进步，虽尚未迎来⼤的突破，但假期正是攻克新考试模式的好时机。变化往往伴随着机\n遇，有时候主动求变也是⼀种破局的智慧。你的校内成绩⼀如既往地优秀，但我相信你也感受到了，本学期个别选修课难\n度陡增，你可能还在适应中，唯有持之以恒的投⼊才能确保学懂⽤好。遇到了更强的对⼿是件好事，它会让你看到进步的\n空间。特别值得庆贺的是，虽然过程⼏经波折，团队磨合也不易，但你们依然凭借实⼒拿下了数学建模⼤赛的奖项。更让\n我印象深刻的是，即便准备时间并不充分，你在答辩时依然能信⼿拈来，这充分体现了你极强的⾃我认知和对素养的深层\n理解。接下来，希望你能在个⼈笔试类竞赛中寻求突破，虽然我们不提倡盲⽬的题海战术，但该刷题的时候绝不能⼿软。\n校园⽣活⽅⾯，你的⾏为规范⼀直很优秀，鲜少犯错。在此特别提醒你，趁着寒假调整好作息，保证充⾜的睡眠，这样才\n能有更好的精神和效率，也是对⾃⼰的⾝体负责。每周三的⾜球和周末的骑⾏是你为数不多的放松时刻，希望你不要轻易\n放弃。以你的⾃主性，我相信⽆论⾯对什么兴趣爱好，你都能把握好度，做到不沉迷。\n为⼈处事上，你依然保持着那份“⼩⾼冷”的贵公⼦⽓质。这学期或许是因为忙碌和学英语的原因，经常看到你戴着⽿机独\n来独往。享受独处确实是⼀种能⼒，但偶尔摘下⽿机，和同学们有说有笑也是⼀种⽣活的调剂。懂得欣赏和⾃⼰旗⿎相当\n的强者是天经地义的，但同时也希望你能试着去发掘普通同学在不同⽅⾯的优势。学会互相包容与成就，才能更好地与⼈\n共处或合作，这对未来的你⾄关重要。",
      "selfReflectionSummary": "⾼⼆第⼀学期的时光结束的⽐想象中快得多，回望这段历程，最⼤的感触是极致的充实与忙碌，但与⾼⼀不同的是，现在 的我多了⼀份在多重挑战中游刃有余的从容。",
      "tutorCommentSummary": "这学期，你的⽣活可以⽤“充实⽽忙碌”来形容。"
    },
    "futureDirection": "工程?",
    "courses": [
      {
        "name": "语文 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "你以令人惊叹的文学天赋和深厚的艺术素养，展现了一位青年创作者早熟的才华与深度。你不仅是经典的卓越解读者，更\n是富有原创精神的表达者。你的核心优势在于卓越的写作天赋、广博的阅读积淀与强大的舞台表现力。 你拥有很高的写\n作天赋，文字兼具细腻的感知力与凝练的诗意。这背后离不开你广泛的阅读，丰厚的积累为你的创作提供了源源不断的养\n分与广阔的参照系。在戏剧表演中，你同样展现出强大的表现力与感染力，能精准地捕捉并外化角色的内在情绪与精神特\n质。这三种能力在你身上形成了美妙的闭环。你的剧本《春·觉》你精准地抓住了《红楼梦》中“宝黛共读《西厢》”这一经\n典场景的精神内核——青春的觉醒、情感的启蒙与礼教的樊篱。"
      },
      {
        "name": "大学微积分 I",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Chris has delivered an excellent performance overall, with only minor fluctuations reflecting varying levels of effort \nthroughout the semester. His success is driven by exceptional logical reasoning and abstraction skills, which are \nreinforced by his consistent study habits. Beyond his own learnin"
      },
      {
        "name": "English Advanced 2（B2+）",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "Chris has an extremely strong command of English and is ready for greater challenge. He excels across all skill areas: \nhe communicates fluently and confidently, and his writing and listening performance are consistently above average \ncompared to the class as a whole. I also appreciate how he parti"
      },
      {
        "name": "荣誉中国研究",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Throughout the G11 China Study field investigation, Chris demonstrated masterful excellence. His delving into how \ncontemporary China constructs a \"red information cocoon\" via algorithms under authoritarianism was profoundly \nanalytical. He handled the literature review expertly, effectively synthes"
      },
      {
        "name": "大学经济学 I",
        "grade": "超越[5]",
        "gradeNum": 5,
        "feedback": "Chris, you are one of the few students in this class who possesses a rare, natural \"feel\" for economics; your intellectual \nagility and intuition for how the world works are truly exceptional. I have noticed that you often spend class time working \non other subjects, and while I understand that you "
      },
      {
        "name": "大学物理 I: 力学",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Chris has delivered an excellent performance this semester, with overall improvement despite occasional fluctuations. \nHe combines strong mathematical fluency with rigorous logical reasoning. His intellectual curiosity drives him to uncover \nthe fundamental \"why\" behind every concept, enabling him t"
      },
      {
        "name": "体育：足球",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "Chris has performed well in every of the different drills done. His coordination, conduction of the ball and passing is very \naccurate. His will of doing better and better has paid off. He has been doing a great fitness workout and he improved his \narms and upper body strength, which are needed for "
      },
      {
        "name": "未来规划 III",
        "grade": "精熟[4]",
        "gradeNum": 4,
        "feedback": "亲爱的刀刀，当我在写这段寄语的时候，你正坐在我旁边专注地筹备夏校的申请。这是我第一次如此近距离的感受到你的\n“专注”优势 – 刚坐下，就能马上进入全脑高速运转地筹备申请材料的状态。这个学期，你的申请准备度取得了全面升级 – \n一骑绝尘的校内成绩、英语标化的突破性进展、HiMCM国际赛事成就等。最大的突破我觉得是专业方向的聚焦和申请形\n象的聚焦，这两个是打造“令人怦然心动的申请”的核心。目前这个核心的表象是以“共情驱动的技术专家”形象申请工程专\n业，但这个核心的本质是对自我优势和兴趣的了解、以及下一人生阶段的目标设定。我们目前达成共识的计划是：2月3月\nSAT筹备与首考，4月5月AP准备与考试，"
      }
    ],
    "academicStrength": "Excels in 语文 III and 7 other course(s)",
    "academicWeakness": null
  }
]